[
  {"id":"aoki2007","abstract":"This paper proposes an analytical-cum-conceptual framework for understanding the nature of institutions as well as their changes. First, it proposes a new definition of institution based on the notion of common knowledge regarding self-sustaining features of social interactions with a hope to integrate various disciplinary approaches to institutions and their changes. Second, it specifies some generic mechanisms of institutional coherence and change – overlapping social embeddedness, Schumpeterian innovation in bundling games, and dynamic institutional complementarities – useful for understanding the dynamic interactions of economic, political, social, organizational, and cognitive factors.","accessed":{"date-parts":[[2021,11,3]]},"author":[{"family":"Aoki","given":"Masahiko"}],"citation-key":"aoki2007","container-title":"Journal of Institutional Economics","DOI":"10.1017/S1744137406000531","ISSN":"1744-1382, 1744-1374","issue":"1","issued":{"date-parts":[[2007,4]]},"language":"en","page":"1-31","publisher":"Cambridge University Press","source":"Cambridge University Press","title":"Endogenizing institutions and institutional changes*","type":"article-journal","URL":"https://www.cambridge.org/core/journals/journal-of-institutional-economics/article/abs/endogenizing-institutions-and-institutional-changes/AD5F9B9201F6AA456644417DC245B764","volume":"3"},
  {"id":"aumann1974","accessed":{"date-parts":[[2022,5,26]]},"author":[{"family":"Aumann","given":"Robert J."}],"citation-key":"aumann1974","container-title":"Journal of Mathematical Economics","container-title-short":"Journal of Mathematical Economics","DOI":"10.1016/0304-4068(74)90037-8","ISSN":"03044068","issue":"1","issued":{"date-parts":[[1974,3]]},"language":"en","page":"67-96","source":"DOI.org (Crossref)","title":"Subjectivity and correlation in randomized strategies","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/0304406874900378","volume":"1"},
  {"id":"aumann1987","accessed":{"date-parts":[[2021,5,9]]},"author":[{"family":"Aumann","given":"Robert J."}],"citation-key":"aumann1987","container-title":"Econometrica","container-title-short":"Econometrica","DOI":"10.2307/1911154","ISSN":"00129682","issue":"1","issued":{"date-parts":[[1987,1]]},"page":"1","source":"DOI.org (Crossref)","title":"Correlated Equilibrium as an Expression of Bayesian Rationality","type":"article-journal","URL":"https://www.jstor.org/stable/1911154?origin=crossref","volume":"55"},
  {"id":"barsalou2013","author":[{"family":"Barsalou","given":"Lawrence W."}],"citation-key":"barsalou2013","container-title":"Cortex; a Journal Devoted to the Study of the Nervous System and Behavior","container-title-short":"Cortex","DOI":"10.1016/j.cortex.2013.06.010","ISSN":"1973-8102","issue":"10","issued":{"literal":"2013 Nov-Dec"},"language":"eng","page":"2951-2953","PMID":"23911126","source":"PubMed","title":"Mirroring as Pattern Completion Inferences within Situated Conceptualizations","type":"article-journal","volume":"49"},
  {"id":"bechtel2009","accessed":{"date-parts":[[2021,8,10]]},"author":[{"family":"Bechtel","given":"William"}],"citation-key":"bechtel2009","container-title":"Philosophical Psychology","container-title-short":"Philosophical Psychology","DOI":"10.1080/09515080903238948","ISSN":"0951-5089, 1465-394X","issue":"5","issued":{"date-parts":[[2009,10]]},"language":"en","page":"543-564","source":"DOI.org (Crossref)","title":"Looking down, around, and up: Mechanistic explanation in psychology","title-short":"Looking down, around, and up","type":"article-journal","URL":"http://www.tandfonline.com/doi/abs/10.1080/09515080903238948","volume":"22"},
  {"id":"bicchieri2005","accessed":{"date-parts":[[2021,2,19]]},"author":[{"family":"Bicchieri","given":"Cristina"}],"citation-key":"bicchieri2005","DOI":"10.1017/CBO9780511616037","event-place":"Cambridge","ISBN":"978-0-511-61603-7","issued":{"date-parts":[[2005]]},"language":"en","publisher":"Cambridge University Press","publisher-place":"Cambridge","source":"DOI.org (Crossref)","title":"The Grammar of Society: The Nature and Dynamics of Social Norms","title-short":"The Grammar of Society","type":"book","URL":"http://ebooks.cambridge.org/ref/id/CBO9780511616037"},
  {"id":"bicchieri2018a","abstract":"Social norms, the informal rules that govern behavior in groups andsocieties, have been extensively studied in the social sciences.Anthropologists have described how social norms function in differentcultures (Geertz 1973), sociologists have focused on their socialfunctions and how they motivate people to act (Durkheim 1895 [1982],1950 [1957]; Parsons 1937; Parsons & Shils 1951; James Coleman1990; Hechter & Opp 2001), and economists have explored howadherence to norms influences market behavior (Akerlof 1976; Young1998a). More recently, also legal scholars have touted social norms asefficient alternatives to legal rules, as they may internalizenegative externalities and provide signaling mechanisms at little orno cost (Ellickson 1991; Posner 2000)., With a few exceptions, the social science literature conceives ofnorms as exogenous variables. Since norms are mainly seen asconstraining behavior, some of the key differences between moral,social, and legal norms—as well as differences between norms andconventions—have been blurred. Much attention has instead beenpaid to the conditions under which norms will be obeyed. Because ofthat, the issue of sanctions has been paramount in the socialscience literature. Moreover, since social norms are seen as centralto the production of social order or social coordination, research onnorms has been focused on the functions they perform. Yeteven if a norm may fulfill important social functions (such as welfaremaximization or the elimination of externalities), it cannot beexplained solely on the basis of the functions it performs. Thesimplistic functionalist perspective has been rejected on severalaccounts; in fact, even though a given norm can be conceived as ameans to achieve some goal, this is usually not the reason why itemerged in the first place (Elster 1989a, 1989b). Moreover, although aparticular norm may persist (as opposed to emerge) because of somepositive social function it fulfills, there are many others that areinefficient and even widely unpopular., Philosophers have taken a different approach to norms. In theliterature on norms and conventions, both social constructs are seenas the endogenous product of individuals’ interactions (Lewis1969; Ullmann-Margalit 1977; Vandershraaf 1995; Bicchieri 2006). Normsare represented as equilibria of games of strategy, and as such theyare supported by a cluster of self-fulfilling expectations. Beliefs,expectations, group knowledge and common knowledge have thus becomecentral concepts in the development of a philosophical view of socialnorms. Paying attention to the role played by expectations insupporting social norms has helped differentiate between social norms,conventions, and descriptive norms: an important distinction oftenoverlooked in the social science accounts, but crucial when we need todiagnose the nature of a pattern of behavior in order to intervene onit.","accessed":{"date-parts":[[2021,11,6]]},"author":[{"family":"Bicchieri","given":"Cristina"},{"family":"Muldoon","given":"Ryan"},{"family":"Sontuoso","given":"Alessandro"}],"citation-key":"bicchieri2018a","container-title":"The Stanford Encyclopedia of Philosophy","edition":"Winter 2018","editor":[{"family":"Zalta","given":"Edward N."}],"issued":{"date-parts":[[2018]]},"publisher":"Metaphysics Research Lab, Stanford University","source":"Stanford Encyclopedia of Philosophy","title":"Social Norms","type":"chapter","URL":"https://plato.stanford.edu/archives/win2018/entries/social-norms/"},
  {"id":"craver2013","abstract":"Neuroscientists investigate the mechanisms of spatial memory. Molecular biologists study the mechanisms of protein synthesis and the myriad mechanisms of gene regulation. Ecologists study nutrient cycling mechanisms and their devastating imbalances in estuaries such as the Chesapeake Bay. In fact, much of biology and its history involves biologists constructing, evaluating, and revising their understanding of mechanisms. With In Search of Mechanisms, Carl F. Craver and Lindley Darden offer both a descriptive and an instructional account of how biologists discover mechanisms. Drawing on examples from across the life sciences and through the centuries, Craver and Darden compile an impressive toolbox of strategies that biologists have used and will use again to reveal the mechanisms that produce, underlie, or maintain the phenomena characteristic of living things. They discuss the questions that figure in the search for mechanisms, characterizing the experimental, observational, and conceptual considerations used to answer them, all the while providing examples from the history of biology to highlight the kinds of evidence and reasoning strategies employed to assess mechanisms. At a deeper level, Craver and Darden pose a systematic view of what biology is, of how biology makes progress, of how biological discoveries are and might be made, and of why knowledge of biological mechanisms is important for the future of the human species.","author":[{"family":"Craver","given":"Carl F."},{"family":"Darden","given":"Lindley"}],"citation-key":"craver2013","ISBN":"978-0-226-03982-4","issued":{"date-parts":[[2013,10,3]]},"language":"en","number-of-pages":"251","publisher":"University of Chicago Press","source":"Google Books","title":"In Search of Mechanisms: Discoveries across the Life Sciences","title-short":"In Search of Mechanisms","type":"book"},
  {"id":"epstein2015","author":[{"family":"Epstein","given":"Brian"}],"call-number":"H61.15 .E67 2015","citation-key":"epstein2015","collection-title":"Oxford studies in philosophy of science","event-place":"New York, NY","ISBN":"978-0-19-938110-4","issued":{"date-parts":[[2015]]},"language":"en","number-of-pages":"298","publisher":"Oxford University Press","publisher-place":"New York, NY","source":"Library of Congress ISBN","title":"The ant trap: rebuilding the foundations of the social sciences","title-short":"The ant trap","type":"book"},
  {"id":"epstein2018","abstract":"Social ontology is the study of the nature and properties of thesocial world. It is concerned with analyzing the various entities inthe world that arise from social interaction., A prominent topic in social ontology is the analysis of social groups.Do social groups exist at all? If so, what sorts of entities are they,and how are they created? Is a social group distinct from thecollection of people who are its members, and if so, how is itdifferent? What sorts of properties do social groups have? Can theyhave beliefs or intentions? Can they perform actions? And if so, whatdoes it take for a group to believe, intend, or act?, Other entities investigated in social ontology include money,corporations, institutions, property, social classes, races, genders,artifacts, artworks, language, and law. It is difficult to delineate aprecise scope for the field (see section 2.1). In general, though, the entities explored in social ontology largelyoverlap with those that social scientists work on. A good deal of thework in social ontology takes place within the social sciences (see sections 5.1–5.8)., Social ontology also addresses more basic questions about the natureof the social world. One set of questions pertains to theconstituents, or building blocks, of social things in general. Forinstance, some theories argue that social entities are built out ofthe psychological states of individual people, while others argue thatthey are built out of actions, and yet others that they are built outof practices. Still other theories deny that a distinction can even bemade between the social and the non-social., A different set of questions pertains to how social categories areconstructed or set up. Are social categories and kinds produced by ourattitudes? By our language? Are they produced by causal patterns? Andis there just one way social categories are set up, or are there manyvarieties of social construction?, The term ‘social ontology’ has only come into widecurrency in recent years, but the nature of the social has been atopic of inquiry since ancient Greece. As a whole, the field can beunderstood as a branch of metaphysics, the general inquiry into thenature of entities.","accessed":{"date-parts":[[2021,11,2]]},"author":[{"family":"Epstein","given":"Brian"}],"citation-key":"epstein2018","container-title":"The Stanford Encyclopedia of Philosophy","edition":"Summer 2018","editor":[{"family":"Zalta","given":"Edward N."}],"issued":{"date-parts":[[2018]]},"publisher":"Metaphysics Research Lab, Stanford University","source":"Stanford Encyclopedia of Philosophy","title":"Social Ontology","type":"chapter","URL":"https://plato.stanford.edu/archives/sum2018/entries/social-ontology/"},
  {"id":"ferguson1980","abstract":"A subtle critique of declining communal virtues, arguing instead for active citizenship. Copyright Â© Libri GmbH. All rights reserved.","author":[{"family":"Ferguson","given":"Adam"}],"citation-key":"ferguson1980","ISBN":"978-1-4128-1717-2","issued":{"date-parts":[[1980,1,1]]},"language":"en","number-of-pages":"370","publisher":"Transaction Publishers","source":"Google Books","title":"An Essay on the History of Civil Society, 1767","type":"book"},
  {"id":"french2010","abstract":"According to ‘Ontic Structural Realism’ (OSR), physical objects—qua metaphysical entities—should be reconceptualised, or, more strongly, eliminated in favour of the relevant structures. In this paper I shall attempt to articulate the relationship between these putative objects and structures in terms of certain accounts of metaphysical dependence currently available. This will allow me to articulate the differences between the different forms of OSR and to argue in favour of the ‘eliminativist’ version. A useful context is provided by Floridi’s account of the relationship between ‘ontic’ and ‘epistemic’ structural realisms and I shall conclude with some brief remarks on possible extensions of OSR into other scientiﬁc domains.","accessed":{"date-parts":[[2021,2,20]]},"author":[{"family":"French","given":"Steven"}],"citation-key":"french2010","container-title":"Synthese","container-title-short":"Synthese","DOI":"10.1007/s11229-010-9734-2","ISSN":"0039-7857, 1573-0964","issue":"S1","issued":{"date-parts":[[2010,8]]},"language":"en","page":"89-109","source":"DOI.org (Crossref)","title":"The interdependence of structure, objects and dependence","type":"article-journal","URL":"http://link.springer.com/10.1007/s11229-010-9734-2","volume":"175"},
  {"id":"gilbert1992","abstract":"Are social groups real in any sense that is independent of the thoughts, actions, and beliefs of the individuals making up the group? Using methods of philosophy to examine such longstanding sociological questions, Margaret Gilbert gives a general characterization of the core phenomena at issue in the domain of human social life. After developing detailed analyses of a number of central everyday concepts of social phenomena--including shared action, a social convention, a group's belief, and a group itself--she proposes that the core social phenomena among human beings are \"plural subject\" phenomena. In her analyses Gilbert discusses the work of such thinkers as Emile Durkheim, Georg Simmel, Max Weber, and David Lewis. \"Gilbert's book aims to ... exhibit some general and structural features of the conceptual scheme in terms of which we think about social groups, collective action, social convention, and shared belief.... [It] offers an important corrective to individualistic thinking in the social sciences....\"--Michael Root, Philosophical Review \"In this rich and rewarding work, Margaret Gilbert provides a novel and detailed account of our everyday concepts of social collectivity. In so doing she makes a seminal contribution to ... some vexed issues in the philosophy of social science.... [An] intellectually pioneering work.\"--John D. Greenwood, Social Epistemology","author":[{"family":"Gilbert","given":"Margaret"}],"citation-key":"gilbert1992","ISBN":"978-0-691-02080-8","issued":{"date-parts":[[1992,4,12]]},"language":"en","number-of-pages":"532","publisher":"Princeton University Press","source":"Google Books","title":"On Social Facts","type":"book"},
  {"id":"gintis2007","abstract":"The various behavioral disciplines model human behavior in distinct and incompatible ways. Yet, recent theoretical and empirical developments have created the conditions for rendering coherent the areas of overlap of the various behavioral disciplines. The analytical tools deployed in this task incorporate core principles from several behavioral disciplines. The proposed framework recognizes evolutionary theory, covering both genetic and cultural evolution, as the integrating principle of behavioral science. Moreover, if decision theory and game theory are broadened to encompass other-regarding preferences, they become capable of modeling all aspects of decision making, including those normally considered “psychological,” “sociological,” or “anthropological.” The mind as a decision-making organ then becomes the organizing principle of psychology.","accessed":{"date-parts":[[2021,8,6]]},"author":[{"family":"Gintis","given":"Herbert"}],"citation-key":"gintis2007","container-title":"Behavioral and Brain Sciences","DOI":"10.1017/S0140525X07000581","ISSN":"1469-1825, 0140-525X","issue":"1","issued":{"date-parts":[[2007,2]]},"language":"en","page":"1-16","publisher":"Cambridge University Press","source":"Cambridge University Press","title":"A framework for the unification of the behavioral sciences","type":"article-journal","URL":"https://www.cambridge.org/core/journals/behavioral-and-brain-sciences/article/abs/framework-for-the-unification-of-the-behavioral-sciences/BD567D3230E34716C8AFFF2ED65180B5","volume":"30"},
  {"id":"gintis2013","accessed":{"date-parts":[[2021,10,16]]},"author":[{"family":"Gintis","given":"Herbert"},{"family":"Helbing","given":"Dirk"}],"citation-key":"gintis2013","container-title":"SSRN Electronic Journal","container-title-short":"SSRN Journal","DOI":"10.2139/ssrn.2362262","ISSN":"1556-5068","issued":{"date-parts":[[2013]]},"language":"en","source":"DOI.org (Crossref)","title":"Homo Socialis: An Analytical Core for Sociological Theory","title-short":"Homo Socialis","type":"article-journal","URL":"http://www.ssrn.com/abstract=2362262"},
  {"id":"glennan2017","abstract":"This book argues for a new image of nature and of science—one that understands both natural and social phenomena to be the product of mechanisms, and that suggests that much of the work of natural and social scientists involves discovering, describing, and explaining how these mechanisms work. The book explores the interplay between ontological questions about mechanisms as things in the world and methodological questions about how these mechanisms can be characterized. Ontologically, mechanisms are understood to be collections of entities whose organized activities and interactions give rise to phenomena. This minimal conception of mechanism is abstract enough to encompass most of the wide variety of things that scientists have called mechanisms. While mechanisms are particular things, localized in space and time, the models that scientists use to describe them must be abstract and idealized. The mechanistic approach provides new ways of thinking about traditional metaphysical questions—for instance, about the nature of objects, part-whole and cause-effect relations, properties and universals, natural kinds, and laws of nature. It also suggests novel approaches for thinking about methodological questions concerning scientific representation, causal inference, reduction, and scientific explanation. The New Mechanical Philosophy offers the promise of a better understanding of the sources of both the unity and diversity of science.","accessed":{"date-parts":[[2023,3,6]]},"author":[{"family":"Glennan","given":"Stuart"}],"citation-key":"glennan2017","DOI":"10.1093/oso/9780198779711.001.0001","ISBN":"978-0-19-877971-1","issued":{"date-parts":[[2017,9,21]]},"language":"en","publisher":"Oxford University Press","source":"DOI.org (Crossref)","title":"The New Mechanical Philosophy","type":"book","URL":"https://academic.oup.com/book/9835","volume":"1"},
  {"id":"guala2007","abstract":"Ontological debates have always been prominent in the philosophy of social science. Philosophers have typically conceived of such debates as pre-scientific attempts to reform social scientific practice, rather than as post-scientific reflections on a firm body of scientific knowledge. Two celebrated contemporary research programs in social ontology – collective intentionality and evolutionary game theory – also follow this approach. In this paper I illustrate their central elements and criticize their weak empirical foundations. I finish by reviewing some work that combines empirical evidence with theoretical reflection, and suggest that it constitutes the way forward in the philosophy of social science.","accessed":{"date-parts":[[2021,10,6]]},"author":[{"family":"Guala","given":"Francesco"}],"citation-key":"guala2007","container-title":"Philosophy Compass","DOI":"10.1111/j.1747-9991.2007.00095.x","ISSN":"1747-9991","issue":"6","issued":{"date-parts":[[2007]]},"language":"en","page":"954-980","source":"Wiley Online Library","title":"The Philosophy of Social Science: Metaphysical and Empirical","title-short":"The Philosophy of Social Science","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1747-9991.2007.00095.x","volume":"2"},
  {"id":"guala2015","abstract":"Current debates in social ontology are dominated by approaches that view institutions either as rules or as equilibria of strategic games. We argue that these two approaches can be unified within an encompassing theory based on the notion of correlated equilibrium. We show that in a correlated equilibrium each player follows a regulative rule of the form ‘if X then do Y’. We then criticize Searle's claim that constitutive rules of the form ‘X counts as Y in C’ are fundamental building blocks for institutions, showing that such rules can be derived from regulative rules by introducing new institutional terms. Institutional terms are introduced for economy of thought, but are not necessary for the creation of social reality.","accessed":{"date-parts":[[2021,11,3]]},"author":[{"family":"Guala","given":"Francesco"},{"family":"Hindriks","given":"Frank"}],"citation-key":"guala2015","container-title":"The Philosophical Quarterly","container-title-short":"The Philosophical Quarterly","DOI":"10.1093/pq/pqu072","ISSN":"0031-8094","issue":"259","issued":{"date-parts":[[2015,4,1]]},"page":"177-201","source":"Silverchair","title":"A UNIFIED SOCIAL ONTOLOGY","type":"article-journal","URL":"https://doi.org/10.1093/pq/pqu072","volume":"65"},
  {"id":"guala2016","author":[{"family":"Guala","given":"Francesco"}],"call-number":"HM826 .G815 2016","citation-key":"guala2016","event-place":"Princeton","ISBN":"978-0-691-17178-4","issued":{"date-parts":[[2016]]},"language":"en","number-of-pages":"222","publisher":"Princeton University Press","publisher-place":"Princeton","source":"Library of Congress ISBN","title":"Understanding institutions: the science and philosophy of living together","title-short":"Understanding institutions","type":"book"},
  {"id":"guala2020","accessed":{"date-parts":[[2021,6,10]]},"author":[{"family":"Guala","given":"Francesco"}],"citation-key":"guala2020","container-title":"Minimal Cooperation and Shared Agency","DOI":"10.1007/978-3-030-29783-1_9","editor":[{"family":"Fiebich","given":"Anika"}],"event-place":"Cham","ISBN":"978-3-030-29782-4 978-3-030-29783-1","issued":{"date-parts":[[2020]]},"language":"en","page":"149-168","publisher":"Springer International Publishing","publisher-place":"Cham","source":"DOI.org (Crossref)","title":"Solving the Hi-lo Paradox: Equilibria, Beliefs, and Coordination","title-short":"Solving the Hi-lo Paradox","type":"chapter","URL":"http://link.springer.com/10.1007/978-3-030-29783-1_9","volume":"11"},
  {"id":"harms2004","abstract":"This book is intended to help transform epistemology - the traditional study of knowledge - into a rigorous discipline by removing conceptual roadblocks and developing formal tools required for a fully naturalized epistemology. The evolutionary approach which Harms favours begins with the common observation that if our senses and reasoning were not reliable, then natural selection would have eliminated them long ago. The challenge for some time has been how to transform these informal musings about evolutionary epistemology into a rigorous theoretical discipline capable of complementing current scientific studies of the evolution of cognition with a philosophically defensible account of meaning and justification.","author":[{"family":"Harms","given":"William F."}],"citation-key":"harms2004","ISBN":"978-1-139-45162-8","issued":{"date-parts":[[2004,4,26]]},"language":"en","number-of-pages":"282","publisher":"Cambridge University Press","source":"Google Books","title":"Information and Meaning in Evolutionary Processes","type":"book"},
  {"id":"hawley2018","abstract":"If we are sympathetic to the project of naturalising metaphysics, how should we approach the metaphysics of the social world? What role can the social sciences play in metaphysical investigation? In the light of these questions, this paper examines three possible approaches to social metaphysics: inference to the best explanation from current social science, conceptual analysis, and Haslanger-inspired ameliorative projects.","accessed":{"date-parts":[[2021,2,19]]},"author":[{"family":"Hawley","given":"Katherine"}],"citation-key":"hawley2018","container-title":"Journal for General Philosophy of Science","container-title-short":"J Gen Philos Sci","DOI":"10.1007/s10838-017-9389-5","ISSN":"0925-4560, 1572-8587","issue":"2","issued":{"date-parts":[[2018,6]]},"language":"en","page":"187-198","source":"DOI.org (Crossref)","title":"Social Science as a Guide to Social Metaphysics?","type":"article-journal","URL":"http://link.springer.com/10.1007/s10838-017-9389-5","volume":"49"},
  {"id":"hindriks2005","author":[{"family":"Hindriks","given":"Frank"}],"citation-key":"hindriks2005","event-place":"Alblasserdam","ISBN":"978-90-90-19461-5","issued":{"date-parts":[[2005]]},"language":"en","number-of-pages":"183","publisher":"Haveka BV","publisher-place":"Alblasserdam","source":"K10plus ISBN","title":"Rules & institutions: essays on meaning, speech acts and social ontology: essays over betekenis, taalhandelingen en sociale ontologie = Regels & instituties","title-short":"Rules & institutions","type":"book"},
  {"id":"hindriks2015","abstract":"We propose a new framework to unify three conceptions of institutions that play a prominent role in the philosophical and scientific literature: the equilibria account, the regulative rules account, and the constitutive rules account. We argue that equilibrium-based and rule-based accounts are individually inadequate, but that jointly they provide a satisfactory conception of institutions as rules-in-equilibrium. In the second part of the paper we show that constitutive rules can be derived from regulative rules via the introduction of theoretical terms. We argue that the constitutive rules theory is reducible to the rules-in equilibrium theory, and that it accounts for the way in which we assign names to social institutions.","accessed":{"date-parts":[[2021,10,28]]},"author":[{"family":"Hindriks","given":"Frank"},{"family":"Guala","given":"Francesco"}],"citation-key":"hindriks2015","container-title":"Journal of Institutional Economics","DOI":"10.1017/S1744137414000496","ISSN":"1744-1374, 1744-1382","issue":"3","issued":{"date-parts":[[2015,9]]},"language":"en","page":"459-480","publisher":"Cambridge University Press","source":"Cambridge University Press","title":"Institutions, rules, and equilibria: a unified theory*","title-short":"Institutions, rules, and equilibria","type":"article-journal","URL":"https://www.cambridge.org/core/journals/journal-of-institutional-economics/article/institutions-rules-and-equilibria-a-unified-theory/CD04E89BC01304500EFF2B7845E17BD7","volume":"11"},
  {"id":"hobbes2016","accessed":{"date-parts":[[2021,7,23]]},"author":[{"family":"Hobbes","given":"Thomas"}],"citation-key":"hobbes2016","DOI":"10.4324/9781315507613","edition":"0","editor":[{"family":"Missner","given":"Marshall"}],"ISBN":"978-1-315-50760-6","issued":{"date-parts":[[2016,5,23]]},"language":"en","publisher":"Routledge","source":"DOI.org (Crossref)","title":"Thomas Hobbes: Leviathan (Longman Library of Primary Sources in Philosophy)","title-short":"Thomas Hobbes","type":"book","URL":"https://www.taylorfrancis.com/books/9781315507606"},
  {"id":"hume2003","abstract":"Unpopular in its day, David Hume's sprawling, three-volume 'A Treatise of Human Nature' (1739-40) has withstood the test of time and had enormous impact on subsequent philosophical thought. Hume's comprehensive effort to form an observationally grounded study of human nature employs John Locke's empiric principles to construct a theory of knowledge from which to evaluate metaphysical ideas. A key to modern studies of eighteenth-century Western philosophy, the Treatise considers numerous classic philosophical issues, including causation, existence, freedom and necessity, and morality. Unabridged republication of the edition originally published by Oxford at the Clarendon Press, London, 1888.","author":[{"family":"Hume","given":"David"}],"citation-key":"hume2003","ISBN":"978-0-486-43250-2","issued":{"date-parts":[[2003,1,1]]},"language":"en","number-of-pages":"484","publisher":"Courier Corporation","source":"Google Books","title":"A Treatise of Human Nature","type":"book"},
  {"id":"huneman2018","abstract":"This paper argues that in some explanations mathematics are playing an explanatory rather than a representational role, and that this feature unifies many types of non-causal or non-mechanistic explanations that some philosophers of science have been recently exploring under various names (mathematical, topological, etc.). After showing how mathematics can play either a representational or an explanatory role by considering two alternative explanations of a same biological pattern—“Bergmann’s rule”—I offer an example of an explanation where the bulk of the explanatory job is done by a mathematical theorem, and where mechanisms involved in the target systems are not explanatorily relevant. Then I account for the way mathematical properties may function in an explanatory way within an explanation by arguing that some mathematical propositions involving variables non directly referring to the target system features constitute constraints to which a whole class of systems should comply, provided they are describable by a mathematical object concerned by those propositions. According to such “constraint account”, those mathematical facts are directly entailing the explanandum (often a limit regime, a robustness property or a steady state), as a consequence of such constraints. I call those explanations “structural”, because here properties of mathematical structures are accounting for the explanandum; various kinds of mathematical structures (algebraic, graph-theoretical, etc.) thereby define various types of structural explanations.","accessed":{"date-parts":[[2021,11,21]]},"author":[{"family":"Huneman","given":"Philippe"}],"citation-key":"huneman2018","container-title":"Philosophical Studies","container-title-short":"Philos Stud","DOI":"10.1007/s11098-017-0887-4","ISSN":"1573-0883","issue":"3","issued":{"date-parts":[[2018,3,1]]},"language":"en","page":"665-702","source":"Springer Link","title":"Outlines of a theory of structural explanations","type":"article-journal","URL":"https://doi.org/10.1007/s11098-017-0887-4","volume":"175"},
  {"id":"huttegger2007","abstract":"Recently there has been some interest in studying the explanation of meaning by using signaling games. I shall argue that the meaning of signals in signaling games remains suﬃciently unclear to motivate further investigation. In particular, the possibility of distinguishing imperatives and indicatives at a fundamental level will be explored. Thereby I am trying to preserve the generality of the signaling games framework while bringing it closer to human languages. A number of convergence results for the evolutionary dynamics of our models will be proved.","accessed":{"date-parts":[[2021,2,19]]},"author":[{"family":"Huttegger","given":"Simon M."}],"citation-key":"huttegger2007","container-title":"Erkenntnis","container-title-short":"Erkenntnis","DOI":"10.1007/s10670-006-9022-1","ISSN":"0165-0106, 1572-8420","issue":"3","issued":{"date-parts":[[2007,4,17]]},"language":"en","page":"409-436","source":"DOI.org (Crossref)","title":"Evolutionary Explanations of Indicatives and Imperatives","type":"article-journal","URL":"http://link.springer.com/10.1007/s10670-006-9022-1","volume":"66"},
  {"id":"kaidesoja2019","accessed":{"date-parts":[[2021,7,27]]},"author":[{"family":"Kaidesoja","given":"Tuukka"},{"family":"Sarkia","given":"Matti"},{"family":"Hyyryläinen","given":"Mikko"}],"citation-key":"kaidesoja2019","container-title":"Journal for the Theory of Social Behaviour","container-title-short":"J Theory Soc Behav","DOI":"10.1111/jtsb.12226","ISSN":"0021-8308, 1468-5914","issue":"4","issued":{"date-parts":[[2019,12]]},"language":"en","page":"480-498","source":"DOI.org (Crossref)","title":"Arguments for the cognitive social sciences","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/10.1111/jtsb.12226","volume":"49"},
  {"id":"kincaid2008","abstract":"After sorting different structuralist claims, I argue that structural realist ideas are instantiated in the social sciences, providing both clarification of social science research and support for some components of structural realism. My main focus is on three distinct ways that the social sciences can be about structural relations—exemplified by claims about social structure, reduced form structures in causal modeling, and equilibrium explanations—and on the implication of structuralist ideas for thinking about issues concerning causal explanation and nonreductive pictures of the unity of the science.","accessed":{"date-parts":[[2022,2,21]]},"author":[{"family":"Kincaid","given":"Harold"}],"citation-key":"kincaid2008","container-title":"Philosophy of Science","DOI":"10.1086/594517","ISSN":"0031-8248, 1539-767X","issue":"5","issued":{"date-parts":[[2008,12]]},"language":"en","page":"720-731","publisher":"Cambridge University Press","source":"Cambridge University Press","title":"Structural Realism and the Social Sciences","type":"article-journal","URL":"https://www.cambridge.org/core/journals/philosophy-of-science/article/abs/structural-realism-and-the-social-sciences/CB2B4C02C343A114181B7E8862E800D3","volume":"75"},
  {"id":"knoblich2011","accessed":{"date-parts":[[2021,10,25]]},"author":[{"family":"Knoblich","given":"Günther"},{"family":"Butterfill","given":"Stephen"},{"family":"Sebanz","given":"Natalie"}],"citation-key":"knoblich2011","container-title":"Psychology of Learning and Motivation","DOI":"10.1016/B978-0-12-385527-5.00003-6","ISBN":"978-0-12-385527-5","issued":{"date-parts":[[2011]]},"language":"en","page":"59-101","publisher":"Elsevier","source":"DOI.org (Crossref)","title":"Psychological Research on Joint Action","type":"chapter","URL":"https://linkinghub.elsevier.com/retrieve/pii/B9780123855275000036","volume":"54"},
  {"id":"kuhn2009","author":[{"family":"Kuhn","given":"Thomas S."}],"citation-key":"kuhn2009","edition":"3. ed., [Nachdr.]","event-place":"Chicago","ISBN":"978-0-226-45807-6 978-0-226-45808-3","issued":{"date-parts":[[2009]]},"language":"en","number-of-pages":"212","publisher":"Univ. of Chicago Press","publisher-place":"Chicago","source":"K10plus ISBN","title":"The structure of scientific revolutions","type":"book"},
  {"id":"lewis2008","abstract":"Convention was immediately recognized as a major contribution to the subject and its significance has remained undiminished since its first publication in 1969. Lewis analyzes social conventions as regularities in the resolution of recurring coordination problems-situations characterized by interdependent decision processes in which common interests are at stake. Conventions are contrasted with other kinds of regularity, and conventions governing systems of communication are given special attention.","author":[{"family":"Lewis","given":"David"}],"citation-key":"lewis2008","ISBN":"978-0-470-69296-7","issued":{"date-parts":[[1969,4,15]]},"language":"en","number-of-pages":"229","publisher":"John Wiley & Sons","source":"Google Books","title":"Convention: A Philosophical Study","title-short":"Convention","type":"book"},
  {"id":"north1990","author":[{"family":"North","given":"Douglas"}],"citation-key":"north1990","issued":{"date-parts":[[1990]]},"publisher":"Cambridge: Cambridge University Press.","title":"Institutions, Institutional Change and Economic Performance","type":"book"},
  {"id":"oconnor2019","author":[{"family":"O'Connor","given":"Cailin"}],"call-number":"HM821 .O654 2019","citation-key":"oconnor2019","edition":"First edition","event-place":"Oxford ; New York, NY","ISBN":"978-0-19-878997-0","issued":{"date-parts":[[2019]]},"language":"en","note":"OCLC: on1082315381","number-of-pages":"240","publisher":"Oxford University Press","publisher-place":"Oxford ; New York, NY","source":"Library of Congress ISBN","title":"The Origins of Unfairness: Social Categories and Cultural Evolution","title-short":"The Origins of Unfairness","type":"book"},
  {"id":"parsons1937","author":[{"family":"Parsons","given":"Talcott"}],"citation-key":"parsons1937","event-place":"Glencoe, Illinois","issued":{"date-parts":[[1937]]},"publisher":"The Free Press","publisher-place":"Glencoe, Illinois","title":"The Structure of Social Action","type":"book"},
  {"id":"parsons2015","accessed":{"date-parts":[[2021,11,3]]},"archive_location":"world","author":[{"family":"Parsons","given":"Talcott"}],"citation-key":"parsons2015","container-title":"The International Journal of Ethics","DOI":"10.1086/intejethi.45.3.2378271","ISSN":"1526-422X","issued":{"date-parts":[[2015,9,29]]},"language":"en","publisher":"University of Chicago Press","source":"www.journals.uchicago.edu","title":"The Place of Ultimate Values in Sociological Theory","type":"article-journal","URL":"https://www.journals.uchicago.edu/doi/abs/10.1086/intejethi.45.3.2378271"},
  {"id":"pufendorf1673","abstract":"Vol. I. A Phographic Reproduction of the Ed. of 1682 . Vol.II. A Translation of the Text, by Frank Gardner Moore","accessed":{"date-parts":[[2022,5,25]]},"author":[{"family":"Pufendorf","given":"Samuel"}],"citation-key":"pufendorf1673","issued":{"date-parts":[[1673]]},"language":"fr","publisher":"Lund: Junghans","title":"De Officio Hominis et civis juxta legem naturalem libri duo","type":"book","URL":"https://catalogue-bu.u-bourgogne.fr/discovery/fulldisplay/alma991001697579706659/33UB_INST:33UB_INST"},
  {"id":"sarkia2020","abstract":"Discussions of the relations between the social sciences and the cognitive sciences have proliferated in recent years. Our article contributes to the philosophical and methodological foundations of the cognitive social sciences by proposing a framework based on contemporary mechanistic approaches to the philosophy of science to analyze the epistemological, ontological and methodological aspects of research programs at the intersection of the social sciences and the cognitive sciences. We apply this framework to three case studies which address the phenomena of social coordination, transactive memory, and ethnicity. We also assess how successful these research programs have been in providing mechanistic explanations for these phenomena, and where more work remains to be done.","accessed":{"date-parts":[[2021,8,10]]},"author":[{"family":"Sarkia","given":"Matti"},{"family":"Kaidesoja","given":"Tuukka"},{"family":"Hyyryläinen","given":"Mikko"}],"citation-key":"sarkia2020","container-title":"Social Science Information","container-title-short":"Social Science Information","DOI":"10.1177/0539018420968742","ISSN":"0539-0184","issue":"4","issued":{"date-parts":[[2020,12,1]]},"language":"en","page":"580-603","publisher":"SAGE Publications Ltd","source":"SAGE Journals","title":"Mechanistic explanations in the cognitive social sciences: Lessons from three case studies","title-short":"Mechanistic explanations in the cognitive social sciences","type":"article-journal","URL":"https://doi.org/10.1177/0539018420968742","volume":"59"},
  {"id":"searle1995","abstract":"'John Searle has a distinctive intellectual style. It combines razor-sharp analysis with a swaggering chip-on-the-shoulder impudence that many of his opponents might find intolerably abrasive were it not for the good humour that pervades all he writes. This is a man who likes a good philosophical brawl.'New Scientist","author":[{"family":"Searle","given":"John"}],"citation-key":"searle1995","ISBN":"978-0-02-928045-4","issued":{"date-parts":[[1995]]},"language":"en","number-of-pages":"266","publisher":"Simon and Schuster","source":"Google Books","title":"The Construction of Social Reality","type":"book"},
  {"id":"searle2010","abstract":"There are few more important philosophers at work today than John Searle, a creative and contentious thinker who has shaped the way we think about mind and language. Now he offers a profound understanding of how we create a social reality--a reality of money, property, governments, marriages, stock markets and cocktail parties. The paradox he addresses in Making the Social World is that these facts only exist because we think they exist and yet they have an objective existence. Continuing a line of investigation begun in his earlier book The Construction of Social Reality, Searle identifies the precise role of language in the creation of all \"institutional facts.\" His aim is to show how mind, language and civilization are natural products of the basic facts of the physical world described by physics, chemistry and biology. Searle explains how a single linguistic operation, repeated over and over, is used to create and maintain the elaborate structures of human social institutions. These institutions serve to create and distribute power relations that are pervasive and often invisible. These power relations motivate human actions in a way that provides the glue that holds human civilization together. Searle then applies the account to show how it relates to human rationality, the freedom of the will, the nature of political power and the existence of universal human rights. In the course of his explication, he asks whether robots can have institutions, why the threat of force so often lies behind institutions, and he denies that there can be such a thing as a \"state of nature\" for language-using human beings.","author":[{"family":"Searle","given":"John"}],"citation-key":"searle2010","ISBN":"978-0-19-974586-9","issued":{"date-parts":[[2010,1,12]]},"language":"en","number-of-pages":"358","publisher":"Oxford University Press","source":"Google Books","title":"Making the Social World: The Structure of Human Civilization","title-short":"Making the Social World","type":"book"},
  {"id":"sebanz2021","abstract":"Humans have a striking ability to coordinate their actions with each other to achieve joint goals. The tight interpersonal coordination that characterizes joint actions is achieved through processes that help with preparing for joint action as well as processes that are active while joint actions are being performed. To prepare for joint action, partners form representations of each other’s actions and tasks and the relation between them. This enables them to predict each other’s upcoming actions, which, in turn, facilitates coordination. While performing joint actions, partners’ coordination is maintained by (a) monitoring whether individual and joint outcomes correspond to what was planned, (b) predicting partners’ action parameters on the basis of familiarity with their individual actions, (c) communicating task-relevant information unknown to partners in an action-based fashion, and (d) relying on coupling of predictions through dense perceptual-information flow between coactors. The next challenge for the field of joint action is to generate an integrated perspective that links coordination mechanisms to normative, evolutionary, and communicative frameworks.","accessed":{"date-parts":[[2021,9,25]]},"author":[{"family":"Sebanz","given":"Natalie"},{"family":"Knoblich","given":"Günther"}],"citation-key":"sebanz2021","container-title":"Current Directions in Psychological Science","container-title-short":"Curr Dir Psychol Sci","DOI":"10.1177/0963721420984425","ISSN":"0963-7214","issue":"2","issued":{"date-parts":[[2021,4,1]]},"language":"en","page":"138-143","publisher":"SAGE Publications Inc","source":"SAGE Journals","title":"Progress in Joint-Action Research","type":"article-journal","URL":"https://doi.org/10.1177/0963721420984425","volume":"30"},
  {"id":"skyrms2010","author":[{"family":"Skyrms","given":"Brian"}],"call-number":"P99 .S549 2010","citation-key":"skyrms2010","event-place":"Oxford ; New York","ISBN":"978-0-19-958082-8 978-0-19-958294-5","issued":{"date-parts":[[2010]]},"language":"en","note":"OCLC: ocn477256653","number-of-pages":"199","publisher":"Oxford University Press","publisher-place":"Oxford ; New York","source":"Library of Congress ISBN","title":"Signals: evolution, learning, & information","title-short":"Signals","type":"book"},
  {"id":"sober1983","accessed":{"date-parts":[[2021,10,12]]},"author":[{"family":"Sober","given":"Elliott"}],"citation-key":"sober1983","container-title":"Philosophical Studies","container-title-short":"Philos Stud","DOI":"10.1007/BF00372383","ISSN":"1573-0883","issue":"2","issued":{"date-parts":[[1983,3,1]]},"language":"en","page":"201-210","source":"Springer Link","title":"Equilibrium explanation","type":"article-journal","URL":"https://doi.org/10.1007/BF00372383","volume":"43"},
  {"id":"sperber2011","accessed":{"date-parts":[[2021,7,27]]},"author":[{"family":"Sperber","given":"Dan"}],"citation-key":"sperber2011","container-title":"Analytical Sociology and Social Mechanisms","DOI":"10.1017/CBO9780511921315.004","editor":[{"family":"Demeulenaere","given":"Pierre"}],"event-place":"Cambridge","ISBN":"978-0-511-92131-5","issued":{"date-parts":[[2011]]},"language":"en","page":"64-77","publisher":"Cambridge University Press","publisher-place":"Cambridge","source":"DOI.org (Crossref)","title":"A naturalistic ontology for mechanistic explanations in the social sciences","type":"chapter","URL":"https://www.cambridge.org/core/product/identifier/CBO9780511921315A012/type/book_part"},
  {"id":"sperry-taylor2021","abstract":"Equilibrium explanations use an equilibrium to represent and explain a system’s dynamic behavior. They provide a system with the property of global stability: a system will converge towards and remain in equilibrium regardless of its initial conditions and dynamic process. Thus, equilibrium explanations are generally treated as non-causal explanations. There are two claims subsumed under that comprehensive thesis. The first claim is that equilibrium explanations do not identify any causes because a system with global stability resists manipulation. The second claim is that even if equilibrium explanations do identify causes by manipulation, those causes are embedded in a system’s deeper, underlying structural relationships, and those causes are irrelevant to explaining a system’s behavior. Only the system’s structural relationships are relevant. But equilibrium explanations are not monolithic. I compare dynamic systems with multiple, competing equilibria to systems with a globally stable equilibrium. Equilibrium explanations of the former use intervention on a system’s initial conditions and dynamic process to manipulate equilibria, which identifies causes. Furthermore, a system’s initial conditions and dynamic process are relevant to explaining why one equilibrium is selected instead of another. I then apply these lessons to systems with a globally stable equilibrium and discuss when their corresponding equilibrium explanations have a proper role in the parent sciences.","accessed":{"date-parts":[[2022,5,26]]},"author":[{"family":"Sperry-Taylor","given":"Ashton T."}],"citation-key":"sperry-taylor2021","container-title":"Synthese","container-title-short":"Synthese","DOI":"10.1007/s11229-019-02423-2","ISSN":"1573-0964","issue":"6","issued":{"date-parts":[[2021,6,1]]},"language":"en","page":"5577-5598","source":"Springer Link","title":"Reassessing equilibrium explanations: When are they causal explanations?","title-short":"Reassessing equilibrium explanations","type":"article-journal","URL":"https://doi.org/10.1007/s11229-019-02423-2","volume":"198"},
  {"id":"sterelny2003","author":[{"family":"Sterelny","given":"Kim"}],"call-number":"BF698.95 .S74 2003","citation-key":"sterelny2003","event-place":"Malden, MA","ISBN":"978-0-631-18886-5 978-0-631-18887-2","issued":{"date-parts":[[2003]]},"number-of-pages":"262","publisher":"Blackwell","publisher-place":"Malden, MA","source":"Library of Congress ISBN","title":"Thought in a hostile world: the evolution of human cognition","title-short":"Thought in a hostile world","type":"book"},
  {"id":"suarez2019","abstract":"Philippe Huneman ha cuestionado recientemente los límites en la aplicación de los modelos mecanicistas de la explicación científica en base a la existencia de lo que denomina \"explicaciones estructurales\", en las que el fenómeno se explica en virtud de las propiedades matemáticas del sistema en que el fenómeno ocurre. Las explicaciones estructurales pueden darse en formas muy diversas: en virtud de la forma de pajarita (bowtie) de la estructura, de las propiedades topológicas del sistema, de los equilibrios alcanzados, etc. El papel que juegan las matemáticas en las explicaciones que apelan a la estructura de pajarita o a las propiedades topológicas del sistema ha sido recientemente examinado en varios trabajos. Sin embargo, el papel exacto que juegan las matemáticas en el caso de las explicaciones en términos de equilibrio aún no ha sido totalmente clarificado, y diferentes autores defienden interpretaciones contradictorias, algunas de las cuales las asemejarían más al modelo defendido por algunos filósofos mecanicistas que al modelo estructural de Huneman. En este trabajo, tratamos de cubrir ese déficit estudiando el papel que juegan las matemáticas en el modelo de equilibrio anidado (nested equilibrium) elaborado por Blaser y Kirchner para explicar la estabilidad de las asociaciones ontogenética y filogenéticamente persistentes entre humanos y microorganismos. De nuestro análisis se desprende que su modelo es explicativo porque i) se identifica una estructura matemática del sistema que viene dada por un conjunto de ecuaciones diferenciales que satisfacen una estrategia evolutivamente estable; ii) la estructura anidada del modelo hace que la estrategia evolutivamente estable sea robusta ante posibles perturbaciones; iii) esto es así porque las propiedades del sistema empírico son isomorfas a, pero no causalmente responsables de, las propiedades de la estrategia evolutivamente estable. La combinación de estas tres tesis hace que las explicaciones en términos de equilibrios se asemejen más al modelo estructural de explicación que al modelo mecanístico. Philippe Huneman has recently questioned the widespread application of mechanistic models of scientific explanation based on the existence of structural explanations, i.e. explanations that account for the phenomenon to be explained in virtue of the mathematical properties of the system where the phenomenon obtains, rather than in terms of the mechanisms that causally produce the phenomenon. Structural explanations are very diverse, including cases like explanations in terms of bowtie structures, in terms of the topological properties of the system, or in terms of equilibrium. The role of mathematics in bowtie structured systems and in topologically constrained systems has recently been examined in different papers. However, the specific role that mathematical properties play in equilibrium explanations requires further examination, as different authors defend different interpretations, some of them closer to the new-mechanistic approach than to the structural model advocated by Huneman. In this paper, we cover this gap by investigating the explanatory role that mathematics play in Blaser and Kirschner's nested equilibrium model of the stability of persistent long-term human-microbe associations. We argue that their model is explanatory because: i) it provides a mathematical structure in the form of a set of differential equations that together satisfy an ESS; ii) that the nested nature of the ESSs makes the explanation of host-microbe persistent associations robust to any perturbation; iii) that this is so because the properties of the ESS directly mirror the properties of the biological system in a non-causal way. The combination of these three theses make equilibrium explanations look more similar to structural explanations than to causal-mechanistic explanation.","accessed":{"date-parts":[[2022,5,29]]},"author":[{"family":"Suárez","given":"Javier"},{"family":"Deulofeu","given":"Roger"}],"citation-key":"suarez2019","container-title":"Teorema: Revista Internacional de Filosofía","ISSN":"0210-1602","issue":"3","issued":{"date-parts":[[2019]]},"page":"95-120","publisher":"[KRK Ediciones, SL, Luis Manuel Valdés-Villanueva]","source":"JSTOR","title":"Equilibrium Explanation as Structural Non-Mechanistic Explanations: The Case of Long-Term Bacterial Persistence in Human Hosts","title-short":"Equilibrium Explanation as Structural Non-Mechanistic Explanations","type":"article-journal","URL":"https://www.jstor.org/stable/26874514","volume":"38"},
  {"id":"torok2019","abstract":"When people perform simple actions, they often behave efficiently, minimizing the costs of movement for the expected benefit. The present study addressed the question of whether this efficiency scales up to dyads working together to achieve a shared goal: Do people act efficiently as a group (i.e., coefficiently), or do they minimize their own or their partner’s individual costs even if this increases the overall cost for the group? We devised a novel, touch-screen-based, sequential object-transfer task to measure how people choose between different paths to coordinate with a partner. Across multiple experiments, we found that participants did not simply minimize their own or their partner’s movement costs but made coefficient decisions about paths, which ensured that the aggregate costs of movement for the dyad were minimized. These results suggest that people are able and motivated to make coefficient, collectively rational decisions when acting together.","accessed":{"date-parts":[[2021,10,27]]},"author":[{"family":"Török","given":"Georgina"},{"family":"Pomiechowska","given":"Barbara"},{"family":"Csibra","given":"Gergely"},{"family":"Sebanz","given":"Natalie"}],"citation-key":"torok2019","container-title":"Psychological Science","container-title-short":"Psychol Sci","DOI":"10.1177/0956797619842550","ISSN":"0956-7976","issue":"6","issued":{"date-parts":[[2019,6,1]]},"language":"en","page":"930-941","publisher":"SAGE Publications Inc","source":"SAGE Journals","title":"Rationality in Joint Action: Maximizing Coefficiency in Coordination","title-short":"Rationality in Joint Action","type":"article-journal","URL":"https://doi.org/10.1177/0956797619842550","volume":"30"},
  {"id":"tuomela2013","abstract":"Social ontology, in its broadest sense, is the study of the nature of social reality, including collective intentions and agency. The starting point of Tuomela's account of collective intentionality is the distinction between thinking and acting as a private person (\"I-mode\") versus as a \"we-thinking\" group member (\"we-mode\"). The we-mode approach is based on social groups consisting of persons, which may range from simple task groups consisting of a few persons to corporations and even to political states. Tuomela extends the we-mode notion to cover groups controlled by external authority. Thus, for instance, cooperation and attitude formation are studied in cases where the participants are governed \"from above\" as in many corporations. The volume goes on to present a systematic philosophical theory related to the collectivism-versus-individualism debate in the social sciences. A weak version of collectivism (the \"we-mode\" approach) depends on group-based collective intentionality. We-mode collective intentionality is not individualistically reducible and is needed to complement individualistic accounts in social scientific theorizing. The we-mode approach is used in the book to account for collective intention and action, cooperation, group attitudes, and social practices and institutions, as well as group solidarity. Tuomela establishes the first complete theory of group reasons (in the sense of members' reasons for participation in group activities). The book argues in terms of game-theoretical group-reasoning that the kind of weak collectivism that the we-mode approach involves is both conceptually and rational-functionally different from what an individualistic approach (\"pro-group I-mode\" approach) entails.","author":[{"family":"Tuomela","given":"Raimo"}],"citation-key":"tuomela2013","ISBN":"978-0-19-997827-4","issued":{"date-parts":[[2013,8,23]]},"language":"en","number-of-pages":"327","publisher":"Oxford University Press","source":"Google Books","title":"Social Ontology: Collective Intentionality and Group Agents","title-short":"Social Ontology","type":"book"},
  {"id":"turner2007","abstract":"In the nineteenth century, there was substantial and sophisticated interest in neuroscience on the part of social theorists, including Comte and Spencer, and later Simon Patten and Charles Ellwood. This body of thinking faced a dead end: it could do little more than identify highly general mechanisms, and could not provide accounts of such questions as `why was there no proletarian revolution?' Psychologically dubious explanations, relying on neo-Kantian views of the mind, replaced them. With the rise of neuroscience, however, some of the problems of concern to earlier thinkers, such as imitation, have revived because of the discovery of neuronal mechanisms, or through fMRI studies. The article reviews the history and discusses the implications of current work for the reconsideration of traditional social theory concepts. It is suggested that certain kinds of bridging work with neuroscience would enable us to answer many questions in social theory that empirical sociology has failed to answer.","accessed":{"date-parts":[[2021,10,6]]},"author":[{"family":"Turner","given":"Stephen"}],"citation-key":"turner2007","container-title":"European Journal of Social Theory","container-title-short":"European Journal of Social Theory","DOI":"10.1177/1368431007080700","ISSN":"1368-4310","issue":"3","issued":{"date-parts":[[2007,8,1]]},"language":"en","page":"357-374","publisher":"SAGE Publications Ltd","source":"SAGE Journals","title":"Social Theory as a Cognitive Neuroscience","type":"article-journal","URL":"https://doi.org/10.1177/1368431007080700","volume":"10"},
  {"id":"turner2018","accessed":{"date-parts":[[2021,2,19]]},"author":[{"family":"Turner","given":""}],"citation-key":"turner2018","DOI":"10.4324/9781351180528","edition":"1","ISBN":"978-1-351-18052-8","issued":{"date-parts":[[2018,3,9]]},"language":"en","publisher":"Routledge","source":"DOI.org (Crossref)","title":"Cognitive Science and the Social: A Primer","title-short":"Cognitive Science and the Social","type":"book","URL":"https://www.taylorfrancis.com/books/9781351180511"},
  {"id":"turner2019","accessed":{"date-parts":[[2021,12,17]]},"author":[{"family":"Turner","given":"Stephen"}],"citation-key":"turner2019","container-title":"Philosophy of the Social Sciences","container-title-short":"Philosophy of the Social Sciences","DOI":"10.1177/0048393119847102","ISSN":"0048-3931, 1552-7441","issue":"4","issued":{"date-parts":[[2019,7]]},"language":"en","page":"243-264","source":"DOI.org (Crossref)","title":"Verstehen Naturalized","type":"article-journal","URL":"http://journals.sagepub.com/doi/10.1177/0048393119847102","volume":"49"},
  {"id":"vesper2010","abstract":"What kinds of processes and representations make joint action possible? In this paper, we suggest a minimal architecture for joint action that focuses on representations, action monitoring and action prediction processes, as well as ways of simplifying coordination. The architecture spells out minimal requirements for an individual agent to engage in a joint action. We discuss existing evidence in support of the architecture as well as open questions that remain to be empirically addressed. In addition, we suggest possible interfaces between the minimal architecture and other approaches to joint action. The minimal architecture has implications for theorising about the emergence of joint action, for human–machine interaction, and for understanding how coordination can be facilitated by exploiting relations between multiple agents’ actions and between actions and the environment.","accessed":{"date-parts":[[2021,6,10]]},"author":[{"family":"Vesper","given":"Cordula"},{"family":"Butterfill","given":"Stephen"},{"family":"Knoblich","given":"Günther"},{"family":"Sebanz","given":"Natalie"}],"citation-key":"vesper2010","container-title":"Neural Networks","container-title-short":"Neural Networks","DOI":"10.1016/j.neunet.2010.06.002","ISSN":"08936080","issue":"8-9","issued":{"date-parts":[[2010,10]]},"language":"en","page":"998-1003","source":"DOI.org (Crossref)","title":"A minimal architecture for joint action","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0893608010001152","volume":"23"},
  {"id":"weber1924","abstract":"I. Methodologische Einleitung für die Erhebungen des Vereins für Sozialpolitik über Auslese und Anpassung (Berufswahl und Berufsschicksal) der Arbeiterschaft der geschlossenen Großindustrie (1908). II. Zur Psychophysik der industriellen Arbeit (1908-09). III. Die Börse (1894). IV. Agrarstatistische und sozialpolitische Betrachtungen zur Fideikommißfrage in Preußen (1904). V. Diskussionsreden auf den Tagungen des Vereins für Sozialpolitik (1905, 1907, 1909, 1911). VI. Geschäftsbericht und Diskussionsreden auf den deutschen soziologischen Tagungen (1910, 1912). VII. Der Sozialismus (1918).","author":[{"family":"Weber","given":"Max"}],"citation-key":"weber1924","event-place":"Tübingen","issued":{"date-parts":[[1924]]},"language":"de","number-of-pages":"518","publisher":"Mohr","publisher-place":"Tübingen","source":"SSOAR","title":"Gesammelte Aufsätze zur Soziologie und Sozialpolitik","type":"book"},
  {"id":"woodward2005","abstract":"In Making Things Happen, James Woodward develops a new and ambitious comprehensive theory of causation and explanation that draws on literature from a variety of disciplines and which applies to a wide variety of claims in science and everyday life. His theory is a manipulationist account, proposing that causal and explanatory relationships are relationships that are potentially exploitable for purposes of manipulation and control. This account has its roots in the commonsense idea that causes are means for bringing about effects; but it also draws on a long tradition of work inexperimental design, econometrics, and statistics. Woodward shows how these ideas may be generalized to other areas of science from the social scientific and biomedical contexts for which they were originally designed. He also provides philosophical foundations for the manipulationist approach, drawing out its implications, comparing it withalternative approaches, and defending it from common criticisms. In doing so, he shows how the manipulationist account both illuminates important features of successful causal explanation in the natural and social sciences, and avoids the counterexamples and difficulties that infect alternativeapproaches, from the deductive-nomological model onwards. Making Things Happen will interest philosophers working in the philosophy of science, the philosophy of social science, and metaphysics, and as well as anyone interested in causation, explanation, and scientific methodology.","author":[{"family":"Woodward","given":"James"}],"citation-key":"woodward2005","ISBN":"978-0-19-518953-7","issued":{"date-parts":[[2005,10,27]]},"language":"en","number-of-pages":"434","publisher":"Oxford University Press, USA","source":"Google Books","title":"Making Things Happen: A Theory of Causal Explanation","title-short":"Making Things Happen","type":"book"}
]
