[
  {"id":"lewis2008","abstract":"Convention was immediately recognized as a major contribution to the subject and its significance has remained undiminished since its first publication in 1969. Lewis analyzes social conventions as regularities in the resolution of recurring coordination problems-situations characterized by interdependent decision processes in which common interests are at stake. Conventions are contrasted with other kinds of regularity, and conventions governing systems of communication are given special attention.","author":[{"family":"Lewis","given":"David"}],"citation-key":"lewis2008","ISBN":"978-0-470-69296-7","issued":{"date-parts":[[1969,4,15]]},"language":"en","number-of-pages":"229","publisher":"John Wiley & Sons","source":"Google Books","title":"Convention: A Philosophical Study","title-short":"Convention","type":"book"},
  {"id":"paternotte2014","abstract":"There exist many competing philosophical definitions of joint action and no clear criteria to decide between them; so far the search for definitions has by and large been a semantical enterprise rather than an empirical one. This chapter describes and assesses several constraints that could help converge towards a set of necessary and sufficient conditions for joint action. The tightness constraint favours definitions that fit joint actions in which the links between agents are as relaxed as possible, so as to better pinpoint the conceptual core of jointness. The developmental constraint asks for definitions based on realistic psychological states that could be entertained by agents less cognitively developed than ideal human beings. The motor constraint holds that definitions should refer to psychological mechanisms involved in actual human coordination. These first three constraints are discussed and dismissed, mainly because they manage to establish vague limits at best (for various reasons). I then introduce a fourth one, the efficiency constraint, based on the fact that most of our joint actions are generally successful, and according to which definitions should involve conditions that help justify this success. Finally, the rational and evolutionary versions of the efficiency constraint are examined and defended against objections.","accessed":{"date-parts":[[2022,2,15]]},"author":[{"family":"Paternotte","given":"Cédric"}],"citation-key":"paternotte2014","collection-title":"Studies in the Philosophy of Sociality","container-title":"Perspectives on Social Ontology and Social Cognition","DOI":"10.1007/978-94-017-9147-2_8","editor":[{"family":"Gallotti","given":"Mattia"},{"family":"Michael","given":"John"}],"event-place":"Dordrecht","ISBN":"978-94-017-9147-2","issued":{"date-parts":[[2014]]},"language":"en","page":"103-123","publisher":"Springer Netherlands","publisher-place":"Dordrecht","source":"Springer Link","title":"Constraints on Joint Action","type":"chapter","URL":"https://doi.org/10.1007/978-94-017-9147-2_8"},
  {"id":"skyrms2010","author":[{"family":"Skyrms","given":"Brian"}],"call-number":"P99 .S549 2010","citation-key":"skyrms2010","event-place":"Oxford ; New York","ISBN":"978-0-19-958082-8 978-0-19-958294-5","issued":{"date-parts":[[2010]]},"language":"en","note":"OCLC: ocn477256653","number-of-pages":"199","publisher":"Oxford University Press","publisher-place":"Oxford ; New York","source":"Library of Congress ISBN","title":"Signals: evolution, learning, & information","title-short":"Signals","type":"book"},
  {"id":"skyrms2014","abstract":"\"In this new edition of Evolution of the Social Contract, Brian Skyrms uses evolutionary game theory to analyze the genesis of social contracts and investigates social phenomena including justice, communication, altruism, and bargaining. Featuring new material on evolution and information transfer, and including recent developments in game theory and evolution literature, his book introduces and applies appropriate concepts of equilibrium and evolutionary dynamics, showing how key issues can be modelled as games and considering the ways in which evolution sometimes supports, and sometimes does not support, rational choice. He discusses topics including how bargaining with neighbours promotes sharing of resources, the diversity of behavior in ultimatum bargaining in small societies, the Prisoner's Dilemma, and an investigation into signalling games and the spontaneous emergence of meaningful communication. His book will be of great interest to readers in philosophy of science, social science, evolutionary biology, game and decision theory, and political theory\"--","author":[{"family":"Skyrms","given":"Brian"}],"call-number":"JC336 .S49 2014","citation-key":"skyrms2014","edition":"Second edition","event-place":"Cambridge ; New York","ISBN":"978-1-107-07728-7 978-1-107-43428-8","issued":{"date-parts":[[2014]]},"language":"en","number-of-pages":"148","publisher":"Cambridge University Press","publisher-place":"Cambridge ; New York","source":"Library of Congress ISBN","title":"Evolution of the social contract","type":"book"},
  {"id":"sterelny2003","author":[{"family":"Sterelny","given":"Kim"}],"call-number":"BF698.95 .S74 2003","citation-key":"sterelny2003","event-place":"Malden, MA","ISBN":"978-0-631-18886-5 978-0-631-18887-2","issued":{"date-parts":[[2003]]},"number-of-pages":"262","publisher":"Blackwell","publisher-place":"Malden, MA","source":"Library of Congress ISBN","title":"Thought in a hostile world: the evolution of human cognition","title-short":"Thought in a hostile world","type":"book"},
  {"id":"sterelny2012Book","author":[{"family":"Sterelny","given":"Kim"}],"call-number":"BF698.95 .S735 2012","citation-key":"sterelny2012Book","collection-title":"Jean Nicod lectures","event-place":"Cambridge, Mass","ISBN":"978-0-262-01679-7","issued":{"date-parts":[[2012]]},"language":"en","number-of-pages":"242","publisher":"The MIT Press","publisher-place":"Cambridge, Mass","source":"Library of Congress ISBN","title":"The evolved apprentice: how evolution made humans unique","title-short":"The evolved apprentice","type":"book"},
  {"id":"sterelny2017","abstract":"This paper has two aims. One is to defend an incrementalist view of the evolution of language, not from those who think that syntax could not evolve incrementally, but from those who defend a fundamental distinction between Gricean communication or ostensive inferential communication (Scott-Phillips, Sperber, Tomasello, originally based on Grice) and code-based communication. The paper argues against this dichotomy, and sketches ways in which a code-based system could evolve into Gricean communication. The second is to assess the merits of the Sender–Receiver Framework, originally formulated by David Lewis, and much elaborated and set into an evolutionary context by Brian Skyrms and colleagues, as a framework for thinking about the evolution of language. Despite the great strengths of that framework, and despite the great value of a framework that is both general and formally tractable, I argue that there are critical features of language that it fails to capture .","accessed":{"date-parts":[[2021,12,9]]},"author":[{"family":"Sterelny","given":"Kim"}],"citation-key":"sterelny2017","container-title":"Biology & Philosophy","container-title-short":"Biol Philos","DOI":"10.1007/s10539-017-9597-8","ISSN":"1572-8404","issue":"6","issued":{"date-parts":[[2017,12,1]]},"language":"en","page":"819-838","source":"Springer Link","title":"From code to speaker meaning","type":"article-journal","URL":"https://doi.org/10.1007/s10539-017-9597-8","volume":"32"},
  {"id":"tomasello2010","abstract":"A leading expert on evolution and communication presents an empirically based theory of the evolutionary origins of human communication that challenges the dominant Chomskian view.Human communication is grounded in fundamentally cooperative, even shared, intentions. In this original and provocative account of the evolutionary origins of human communication, Michael Tomasello connects the fundamentally cooperative structure of human communication (initially discovered by Paul Grice) to the especially cooperative structure of human (as opposed to other primate) social interaction. Tomasello argues that human cooperative communication rests on a psychological infrastructure of shared intentionality (joint attention, common ground), evolved originally for collaboration and culture more generally. The basic motives of the infrastructure are helping and sharing: humans communicate to request help, inform others of things helpfully, and share attitudes as a way of bonding within the cultural group. These cooperative motives each created different functional pressures for conventionalizing grammatical constructions. Requesting help in the immediate you-and-me and here-and-now, for example, required very little grammar, but informing and sharing required increasingly complex grammatical devices. Drawing on empirical research into gestural and vocal communication by great apes and human infants (much of it conducted by his own research team), Tomasello argues further that humans' cooperative communication emerged first in the natural gestures of pointing and pantomiming. Conventional communication, first gestural and then vocal, evolved only after humans already possessed these natural gestures and their shared intentionality infrastructure along with skills of cultural learning for creating and passing along jointly understood communicative conventions. Challenging the Chomskian view that linguistic knowledge is innate, Tomasello proposes instead that the most fundamental aspects of uniquely human communication are biological adaptations for cooperative social interaction in general and that the purely linguistic dimensions of human communication are cultural conventions and constructions created by and passed along within particular cultural groups.","author":[{"family":"Tomasello","given":"Michael"}],"citation-key":"tomasello2010","ISBN":"978-0-262-26120-3","issued":{"date-parts":[[2010,8,13]]},"language":"en","number-of-pages":"409","publisher":"MIT Press","source":"Google Books","title":"Origins of Human Communication","type":"book"},
  {"id":"tomasello2014","abstract":"Tool-making or culture, language or religious belief: ever since Darwin, thinkers have struggled to identify what fundamentally differentiates human beings from other animals. Michael Tomasello weaves his twenty years of comparative studies of humans and great apes into a compelling argument that cooperative social interaction is the key to our cognitive uniqueness. Tomasello maintains that our prehuman ancestors, like today's great apes, were social beings who could solve problems by thinking. But they were almost entirely competitive, aiming only at their individual goals. As ecological changes forced them into more cooperative living arrangements, early humans had to coordinate their actions and communicate their thoughts with collaborative partners. Tomasello's \"shared intentionality hypothesis\" captures how these more socially complex forms of life led to more conceptually complex forms of thinking. In order to survive, humans had to learn to see the world from multiple social perspectives, to draw socially recursive inferences, and to monitor their own thinking via the normative standards of the group. Even language and culture arose from the preexisting need to work together and coordinate thoughts. A Natural History of Human Thinking is the most detailed scientific analysis to date of the connection between human sociality and cognition.","accessed":{"date-parts":[[2022,2,14]]},"author":[{"family":"Tomasello","given":"Michael"}],"citation-key":"tomasello2014","DOI":"10.4159/9780674726369","ISBN":"978-0-674-72636-9","issued":{"date-parts":[[2014,2,17]]},"language":"en","publisher":"Harvard University Press","source":"www.degruyter.com","title":"A Natural History of Human Thinking","type":"book","URL":"https://www.degruyter.com/document/doi/10.4159/9780674726369/html"},
  {"id":"turner2018","accessed":{"date-parts":[[2021,2,19]]},"author":[{"family":"Turner","given":""}],"citation-key":"turner2018","DOI":"10.4324/9781351180528","edition":"1","ISBN":"978-1-351-18052-8","issued":{"date-parts":[[2018,3,9]]},"language":"en","publisher":"Routledge","source":"DOI.org (Crossref)","title":"Cognitive Science and the Social: A Primer","title-short":"Cognitive Science and the Social","type":"book","URL":"https://www.taylorfrancis.com/books/9781351180511"},
  {"id":"zahle2014","accessed":{"date-parts":[[2021,11,18]]},"citation-key":"zahle2014","collection-title":"Synthese Library","DOI":"10.1007/978-3-319-05344-8","editor":[{"family":"Zahle","given":"Julie"},{"family":"Collin","given":"Finn"}],"event-place":"Cham","ISBN":"978-3-319-05343-1 978-3-319-05344-8","issued":{"date-parts":[[2014]]},"language":"en","publisher":"Springer International Publishing","publisher-place":"Cham","source":"DOI.org (Crossref)","title":"Rethinking the Individualism-Holism Debate: Essays in the Philosophy of Social Science","title-short":"Rethinking the Individualism-Holism Debate","type":"book","URL":"https://link.springer.com/10.1007/978-3-319-05344-8","volume":"372"}
]
