[
  {"id":"caforioHandbookSociologyMilitary2018","abstract":"This new edition of the volume is presented on the wave of the success which had its first edition (2003). It is entirely updated to the current situation of the disciplines covered, and expanded with particular regard to the new missions, that have become the main challenge for the armed forces in these first decades of the new millennium, with new insights to technological development toward so-called cyborg warriors, new forms of leadership and changes in soldier's identity and organisational culture. It is compiled of documents coming from various researchers at universities around the world as well as military officers devoted to the sector of study. Covered in this volume is a historical excursus of studies prior to contemporary research, interpretive models and theoretical approaches developed specifically for this topic, civic-military relations including issues surrounding democratic control of the armed forces, military culture, professional training, conditions and problems of minorities in the armed forces, an examination of the structural change within the military over the years including new duties and functions following the Cold War.","author":[{"family":"Caforio","given":"Giuseppe"},{"family":"Nuciari","given":"Marina"}],"citation-key":"caforioHandbookSociologyMilitary2018","ISBN":"978-3-319-71602-2","issued":{"date-parts":[[2018,5,19]]},"language":"en","number-of-pages":"639","publisher":"Springer","source":"Google Books","title":"Handbook of the Sociology of the Military","type":"book"},
  {"id":"morrisjanowitzProfessionalSoldierSocial1964","abstract":"More than 50 years after its publication, The Professional Soldier remains a path-breaking study of civil-military relations. In the Cold War era, Morris Janowitz was among the first to recognize that the military was a fruitful subject for social science to study. Asking who soldiers are, what they do, and what they believe, Janowitz’s studies of armed forces and society have guided the work of scholars and policy makers for three generations.\n\nThe Professional Soldier identifies three issues that confront civil-military relations to this day: how to judge the political consequences of military conduct, how to solve problems of international relations while using less force, and how to strengthen civilian control of the military while preserving professional military autonomy. A vital resource for students and anyone interested in understanding the past, present, and future of the armed services.","accessed":{"date-parts":[[2023,6,24]]},"author":[{"literal":"Morris Janowitz"}],"citation-key":"morrisjanowitzProfessionalSoldierSocial1964","ISBN":"978-0-02-916180-7","issued":{"date-parts":[[1964]]},"number-of-pages":"464","publisher":"The Free Press","title":"The Professional Soldier: A Social and Political Portrait","type":"book","URL":"https://lib-g52qjmltckv4ckeep7ghyk7h.1lib.ph/book/24588186/591d4c"},
  {"id":"samuelr.huntingtonSoldierStateTheory1957","author":[{"literal":"Samuel R. Huntington"}],"citation-key":"samuelr.huntingtonSoldierStateTheory1957","event-place":"Cambridge:","issued":{"date-parts":[[1957]]},"publisher":"Harvard University Press.","publisher-place":"Cambridge:","title":"The soldier and the state: The theory and practice of civil-military relations","type":"book"}
]
