[
  {"id":"andreevich2015","abstract":"This is a review of basic applications of network analysis in international political science. The genesis of this method in the context of different paradigms of international relations theory is described. Mathematical methodology of network analysis, as well as the growth models of the international networks, are explained on the basis of a concrete cases from international relations. The practical difficulty of interpreting the results of network analysis from the perspective of international political science are shown. The applications of network analysis in international relations are illustrated by a number of examples. The network analysis of G-20 is presented a network is constituted by top-5 trade partners of each member-state. Different types of networks of missile, nuclear and light weapon proliferation are examined. Finally, international business network as well as international human-rights networks are presented. The author concludes that a renaissance of network analysis is an attempt of revival of systemic-level analysis in international relations. Refs 47. Tables 3. Figs 9.","accessed":{"date-parts":[[2023,6,27]]},"author":[{"family":"Андреевич","given":"Дегтерев Денис"}],"citation-key":"andreevich2015","container-title":"Вестник Санкт-Петербургского университета. Международные отношения","event-place":"Россия, Санкт-Петербург","ISSN":"2658-6029","issue":"4","issued":{"date-parts":[[2015]]},"number":"4","page":"119-138","publisher":"Федеральное государственное бюджетное образовательное учреждение высшего образования «Санкт-Петербургский государственный университет»","publisher-place":"Россия, Санкт-Петербург","source":"cyberleninka.ru","title":"Сетевой анализ международных отношений","type":"article-journal","URL":"https://cyberleninka.ru/article/n/setevoy-analiz-mezhdunarodnyh-otnosheniy"},
  {"id":"chen2012","accessed":{"date-parts":[[2023,6,22]]},"author":[{"family":"Chen","given":"Serena H."},{"family":"Pollino","given":"Carmel A."}],"citation-key":"chen2012","container-title":"Environmental Modelling & Software","container-title-short":"Environmental Modelling & Software","DOI":"10.1016/j.envsoft.2012.03.012","ISSN":"13648152","issued":{"date-parts":[[2012,11]]},"language":"en","page":"134-145","source":"DOI.org (Crossref)","title":"Good practice in Bayesian network modelling","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S1364815212001041","volume":"37"},
  {"id":"marcot2019","abstract":"Bayesian network (BN) modeling is a rapidly advancing field. Here we explore new methods by which BN model development and application are being joined with other tools and model frameworks. Advances include improving areas of Bayesian classifiers and machine-learning algorithms for model structuring and parameterization, and development of time-dynamic models. Increasingly, BN models are being integrated with: management decision networks; structural equation modeling of causal networks; Bayesian neural networks; combined discrete and continuous variables; object-oriented and agent-based models; state-and-transition models; geographic information systems; quantum probability; and other fields. Integrated BNs (IBNs) are becoming useful tools in risk analysis, risk management, and decision science for resource planning and environmental management. In the near future, IBNs may become self-structuring, self-learning systems fed by real-time monitoring data. Such advances may make model validation difficult, and may question model credibility, particularly if based on uncertain sources of knowledge systems and big data.","accessed":{"date-parts":[[2023,6,22]]},"author":[{"family":"Marcot","given":"Bruce G."},{"family":"Penman","given":"Trent D."}],"citation-key":"marcot2019","container-title":"Environmental Modelling & Software","container-title-short":"Environmental Modelling & Software","DOI":"10.1016/j.envsoft.2018.09.016","ISSN":"1364-8152","issued":{"date-parts":[[2019,1,1]]},"language":"en","page":"386-393","source":"ScienceDirect","title":"Advances in Bayesian network modelling: Integration of modelling technologies","title-short":"Advances in Bayesian network modelling","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S1364815218302937","volume":"111"}
]
