[
  {"id":"batagelj","abstract":"Large networks, having thousands of vertices and lines, can be found in many different areas, e. g: genealogies, ﬂow graphs of programs, molecule, computer networks, transportation networks, social networks, intra/inter organisational networks ... Many standard network algorithms are very time and space consuming and therefore unsuitable for analysis of such networks. In the article we present some approaches to analysis and visualisation of large networks implemented in program Pajek. Some typical examples are also given.","author":[{"family":"Batagelj","given":"Vladimir"},{"family":"Mrvar","given":"Andrej"}],"citation-key":"batagelj","language":"en","source":"Zotero","title":"Pajek – Program for Large Network Analysis","type":"article-journal"},
  {"id":"borgatti2009","abstract":"Over the past decade, there has been an explosion of interest in network research across the physical and social sciences. For social scientists, the theory of networks has been a gold mine, yielding explanations for social phenomena in a wide variety of disciplines from psychology to economics. Here, we review the kinds of things that social scientists have tried to explain using social network analysis and provide a nutshell description of the basic assumptions, goals, and explanatory mechanisms prevalent in the field. We hope to contribute to a dialogue among researchers from across the physical and social sciences who share a common interest in understanding the antecedents and consequences of network phenomena.","accessed":{"date-parts":[[2023,6,22]]},"author":[{"family":"Borgatti","given":"Stephen P."},{"family":"Mehra","given":"Ajay"},{"family":"Brass","given":"Daniel J."},{"family":"Labianca","given":"Giuseppe"}],"citation-key":"borgatti2009","container-title":"Science","container-title-short":"Science","DOI":"10.1126/science.1165821","ISSN":"0036-8075, 1095-9203","issue":"5916","issued":{"date-parts":[[2009,2,13]]},"language":"en","page":"892-895","source":"DOI.org (Crossref)","title":"Network Analysis in the Social Sciences","type":"article-journal","URL":"https://www.science.org/doi/10.1126/science.1165821","volume":"323"},
  {"id":"serrat2017","accessed":{"date-parts":[[2023,6,22]]},"author":[{"family":"Serrat","given":"Olivier"}],"citation-key":"serrat2017","container-author":[{"family":"Serrat","given":"Olivier"}],"container-title":"Knowledge Solutions","DOI":"10.1007/978-981-10-0983-9_9","event-place":"Singapore","ISBN":"978-981-10-0982-2 978-981-10-0983-9","issued":{"date-parts":[[2017]]},"language":"en","page":"39-43","publisher":"Springer Singapore","publisher-place":"Singapore","source":"DOI.org (Crossref)","title":"Social Network Analysis","type":"chapter","URL":"http://link.springer.com/10.1007/978-981-10-0983-9_9"},
  {"id":"xu2015","accessed":{"date-parts":[[2023,6,22]]},"author":[{"family":"Xu","given":"Zenglin"},{"family":"Yan","given":"Feng"},{"family":"Qi","given":"Yuan"}],"citation-key":"xu2015","container-title":"IEEE Transactions on Pattern Analysis and Machine Intelligence","container-title-short":"IEEE Trans. Pattern Anal. Mach. Intell.","DOI":"10.1109/TPAMI.2013.201","ISSN":"0162-8828, 2160-9292","issue":"2","issued":{"date-parts":[[2015,2]]},"page":"475-487","source":"DOI.org (Crossref)","title":"Bayesian Nonparametric Models for Multiway Data Analysis","type":"article-journal","URL":"http://ieeexplore.ieee.org/document/6629993/","volume":"37"},
  {"id":"zotero-7","abstract":"Tensor decomposition is a powerful computational tool for multiway data analysis. Many popular tensor decomposition approaches—such as the Tucker decomposition and CANDECOMP/PARAFAC (CP)—amount to multi-linear factorization. They are insufficient to model (i) complex interactions between data entities, (ii) various data types (e.g., missing data and binary data), and (iii) noisy observations and outliers. To address these issues, we propose tensor-variate latent nonparametric Bayesian models for multiway data analysis. We name these models InfTucker. These new models essentially conduct Tucker decomposition in an infinite feature space. Unlike classical tensor decomposition models, our new approaches handle both continuous and binary data in a probabilistic framework. Unlike previous Bayesian models on matrices and tensors, our models are based on latent Gaussian or \n<inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$t$ </tex-math></inline-formula>\n processes with nonlinear covariance functions. Moreover, on network data, our models reduce to nonparametric stochastic blockmodels and can be used to discover latent groups and predict missing interactions. To learn the models efficiently from data, we develop a variational inference technique and explore properties of the Kronecker product for computational efficiency. Compared with a classical variational implementation, this technique reduces both time and space complexities by several orders of magnitude. On real multiway and network data, our new models achieved significantly higher prediction accuracy than state-of-art tensor decomposition methods and blockmodels.","accessed":{"date-parts":[[2023,6,22]]},"citation-key":"zotero-7","language":"en-US","title":"Bayesian Nonparametric Models for Multiway Data Analysis","type":"webpage","URL":"https://ieeexplore.ieee.org/abstract/document/6629993/"}
]
