[
  {"id":"airoldi2008","abstract":"Observations consisting of measurements on relationships for pairs of objects arise in many settings, such as protein interaction and gene regulatory networks, collections of author-recipient email, and social networks. Analyzing such data with probabilisic models can be delicate because the simple exchangeability assumptions underlying many boilerplate models no longer hold. In this paper, we describe a class of latent variable models of such data called Mixed Membership Stochastic Blockmodels. This model extends blockmodels for relational data to ones which capture mixed membership latent relational structure, thus providing an object-specific low-dimensional representation. We develop a general variational inference algorithm for fast approximate posterior inference. We explore applications to social networks and protein interaction networks.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Airoldi","given":"Edo M"},{"family":"Blei","given":"David"},{"family":"Fienberg","given":"Stephen"},{"family":"Xing","given":"Eric"}],"citation-key":"airoldi2008","container-title":"Advances in Neural Information Processing Systems","issued":{"date-parts":[[2008]]},"publisher":"Curran Associates, Inc.","source":"Neural Information Processing Systems","title":"Mixed Membership Stochastic Blockmodels","type":"paper-conference","URL":"https://proceedings.neurips.cc/paper_files/paper/2008/hash/8613985ec49eb8f757ae6439e879bb2a-Abstract.html","volume":"21"},
  {"id":"albatineh2006","abstract":"Similarity indices can be used to compare partitions (clusterings) of a data set. Many such indices were introduced in the literature over the years. We are showing that out of 28 indices we were able to track, there are 22 different ones. Even though their values differ for the same clusterings compared, after correcting for agreement attributed to chance only, their values become similar and some of them even become equivalent. Consequently, the problem of choice of the index to be used for comparing different clusterings becomes less important.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Albatineh","given":"Ahmed N."},{"family":"Niewiadomska-Bugaj","given":"Magdalena"},{"family":"Mihalko","given":"Daniel"}],"citation-key":"albatineh2006","container-title":"Journal of Classification","container-title-short":"Journal of Classification","DOI":"10.1007/s00357-006-0017-z","ISSN":"0176-4268, 1432-1343","issue":"2","issued":{"date-parts":[[2006,9]]},"language":"en","page":"301-313","source":"DOI.org (Crossref)","title":"On Similarity Indices and Correction for Chance Agreement","type":"article-journal","URL":"http://link.springer.com/10.1007/s00357-006-0017-z","volume":"23"},
  {"id":"bar-hen2022","abstract":"Generalized multipartite networks consist in the joint observation of several networks implying some common pre-specified groups of individuals. Such complex networks arise commonly in social sciences, biology, ecology, etc. We propose a flexible probabilistic model named Multipartite Block Model (MBM) able to unravel the topology of multipartite networks by identifying clusters (blocks) of nodes sharing the same patterns of connectivity across the collection of networks they are involved in. The model parameters are estimated through a variational version of the Expectation?Maximization algorithm. The numbers of blocks are chosen using an Integrated Completed Likelihood criterion specifically designed for our model. A simulation study illustrates the robustness of the inference strategy. Finally, two datasets respectively issued from ecology and ethnobiology are analyzed with the MBM in order to illustrate its flexibility and its relevance for the analysis of real datasets.The inference procedure is implemented in an R-package GREMLIN, available on Github (https://github.com/Demiperimetre/GREMLINhttps://github.com/Demiperimetre/GREMLIN).","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Bar-Hen","given":"Avner"},{"family":"Barbillon","given":"Pierre"},{"family":"Donnet","given":"Sophie"}],"citation-key":"bar-hen2022","container-title":"Statistical Modelling","DOI":"10.1177/1471082X20963254","ISSN":"1471-082X","issue":"4","issued":{"date-parts":[[2022,8,1]]},"page":"273-296","publisher":"SAGE Publications India","source":"SAGE Journals","title":"Block models for generalized multipartite networks: Applications in ecology and ethnobiology","title-short":"Block models for generalized multipartite networks","type":"article-journal","URL":"https://doi.org/10.1177/1471082X20963254","volume":"22"},
  {"id":"bartolucci2020","abstract":"An exact algorithm for estimating the dynamic stochastic block model is proposed. This model assumes a hidden Markov chain for the evolution of the social behavior of a group of individuals at repeated time occasions and may be used to assign these individuals to the latent blocks in a dynamic fashion. For the estimation of this model, the proposed exact algorithm maximizes the target function introduced by Matias and Miele [7]. This function is derived from a variational approximation of the model log-likelihood, based on the assumption that the latent variables identifying the blocks are a posteriori independent across individuals, but not across time occasions. A simulation study is performed to compare the exact algorithm with the approximate maximization algorithm proposed by Matias and Miele [7]. Results show that there is a certain advantage of the first in terms of dynamic assignment of individuals to the latent blocks in comparison to the true blocking structure, as measured by the adjusted Rand index.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Bartolucci","given":"Francesco"},{"family":"Pandolfi","given":"Silvia"}],"citation-key":"bartolucci2020","container-title":"Pattern Recognition Letters","container-title-short":"Pattern Recognition Letters","DOI":"10.1016/j.patrec.2020.07.014","ISSN":"0167-8655","issued":{"date-parts":[[2020,10,1]]},"page":"362-369","source":"ScienceDirect","title":"An exact algorithm for time-dependent variational inference for the dynamic stochastic block model","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0167865520302609","volume":"138"},
  {"id":"batagelj1992","abstract":"Procedures for establishing a partition of a network in terms of structural equivalence can be divided into direct and indirect approaches. For the former, a new criterion function is proposed that reflects directly structural equivalence concerns. This criterion function can then be (locally) optimized to create a partition. For indirect approaches, measures of dissimilarity must be compatible with the definition of structural equivalence.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Batagelj","given":"Vladimir"},{"family":"Ferligoj","given":"Anuška"},{"family":"Doreian","given":"Patrick"}],"citation-key":"batagelj1992","collection-title":"Special Issue on Blockmodels","container-title":"Social Networks","container-title-short":"Social Networks","DOI":"10.1016/0378-8733(92)90014-X","ISSN":"0378-8733","issue":"1","issued":{"date-parts":[[1992,3,1]]},"page":"63-90","source":"ScienceDirect","title":"Direct and indirect methods for structural equivalence","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/037887339290014X","volume":"14"},
  {"id":"batagelj1999","abstract":"The goal of blockmodeling is to reduce a large, potentially incoherent network to a smaller comprehensible structure that can be interpreted more readily. In the paper we present some basic ideas and developments in this area. 1 Basic Notions 1.1 Network Let E = {X 1 , X 2 , . . . , X n } be a finite set of units or units. The units are related by binary relations R t # E E, t = 1, . . . , r, r # 1 which determine a network N = (E, R 1 , R 2 , . . . , R r ) In the following we restrict our discussion to a single relation R described by a corresponding binary matrix R = [r ij ] nn where r ij = # 1 X i RX j 0 otherwise In some applications r ij can be a nonnegative real number expressing the strength of the relation R between units X i and X j . 1.1.1 Example: Student Government In Table 1 and Figure 1 the Student Government network is presented. It consists of communication interactions among twelve members and advisors of the Student Government at the Universit...","author":[{"family":"Batagelj","given":"Vladimir"},{"family":"Ferligoj","given":"Anuska"},{"family":"Doreian","given":"Patrick"}],"citation-key":"batagelj1999","issued":{"date-parts":[[1999,10,27]]},"source":"ResearchGate","title":"Generalized Blockmodeling","type":"article-journal"},
  {"id":"brusco2015","abstract":"The two-mode KL-means partitioning (TMKLMP) problem has a number of important applications in the social and physical sciences. For example, the intra-block variability measure associated with TMKLMP underscores its direct relevance to two-mode homogeneity blockmodeling of binary and real-valued social networks. We present a real-coded genetic algorithm for obtaining TMKLMP solutions. A simulation study showed that the new algorithm compares favorably to a multistart implementation of a two-mode KL-means heuristic, which is recognized as a top-performing method for TMKLMP. The merit of the proposed method is demonstrated via an application to the blockmodeling of social network data associated with signing of environmental advertisements in the New York Times as a part of the Turning Point Project.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Brusco","given":"Michael"},{"family":"Doreian","given":"Patrick"}],"citation-key":"brusco2015","container-title":"Social Networks","container-title-short":"Social Networks","DOI":"10.1016/j.socnet.2014.11.007","ISSN":"0378-8733","issued":{"date-parts":[[2015,5,1]]},"page":"26-35","source":"ScienceDirect","title":"A real-coded genetic algorithm for two-mode KL-means partitioning with application to homogeneity blockmodeling","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S037887331400077X","volume":"41"},
  {"id":"butts2008a","abstract":"Social behavior over short time scales is frequently understood in terms of actions, which can be thought of as discrete events in which one individual emits a behavior directed at one or more other entities in his or her environment (possibly including himself or herself). Here, we introduce a highly flexible framework for modeling actions within social settings, which permits likelihood-based inference for behavioral mechanisms with complex dependence. Examples are given for the parameterization of base activity levels, recency, persistence, preferential attachment, transitive/cyclic interaction, and participation shifts within the relational event framework. Parameter estimation is discussed both for data in which an exact history of events is available, and for data in which only event sequences are known. The utility of the framework is illustrated via an application to dynamic modeling of responder radio communications during the early hours of the World Trade Center disaster.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Butts","given":"Carter T."}],"citation-key":"butts2008a","container-title":"Sociological Methodology","DOI":"10.1111/j.1467-9531.2008.00203.x","ISSN":"1467-9531","issue":"1","issued":{"date-parts":[[2008]]},"language":"en","page":"155-200","source":"Wiley Online Library","title":"A Relational Event Framework for Social Action","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1467-9531.2008.00203.x","volume":"38"},
  {"id":"chabert-liddell","author":[{"family":"Chabert-Liddell","given":"Saint-Clair"}],"citation-key":"chabert-liddell","language":"fr","source":"Zotero","title":"Statistical Learning of Collections of Networks with Applications in Ecology and Sociology","type":"article-journal"},
  {"id":"chabert-liddell2021","abstract":"A multilevel network is defined as the junction of two interaction networks, one level representing the interactions between individuals and the other the interactions between organizations. The levels are linked by an affiliation relationship, each individual belonging to a unique organization. A new Stochastic Block Model is proposed as a unified probabilistic framework tailored for multilevel networks. This model contains latent blocks accounting for heterogeneity in the patterns of connection within each level and introducing dependencies between the levels. The sought connection patterns are not specified a priori which makes this approach flexible. Variational methods are used for the model inference and an Integrated Classified Likelihood criterion is developed for choosing the number of blocks and also for deciding whether the two levels are dependent or not. A comprehensive simulation study exhibits the benefit of considering this approach, illustrates the robustness of the clustering and highlights the reliability of the criterion used for model selection. This approach is applied on a sociological dataset collected during a television program trade fair, the inter-organizational level being the economic network between companies and the inter-individual level being the informal network between their representatives. It brings a synthetic representation of the two networks unraveling their intertwined structure and confirms the coopetition at stake.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Chabert-Liddell","given":"Saint-Clair"},{"family":"Barbillon","given":"Pierre"},{"family":"Donnet","given":"Sophie"},{"family":"Lazega","given":"Emmanuel"}],"citation-key":"chabert-liddell2021","container-title":"Computational Statistics & Data Analysis","container-title-short":"Computational Statistics & Data Analysis","DOI":"10.1016/j.csda.2021.107179","ISSN":"0167-9473","issued":{"date-parts":[[2021,6,1]]},"page":"107179","source":"ScienceDirect","title":"A stochastic block model approach for the analysis of multilevel networks: An application to the sociology of organizations","title-short":"A stochastic block model approach for the analysis of multilevel networks","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S016794732100013X","volume":"158"},
  {"id":"corneli2016","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Corneli","given":"Marco"},{"family":"Latouche","given":"Pierre"},{"family":"Rossi","given":"Fabrice"}],"citation-key":"corneli2016","container-title":"Social Network Analysis and Mining","container-title-short":"Soc. Netw. Anal. Min.","DOI":"10.1007/s13278-016-0368-3","ISSN":"1869-5450, 1869-5469","issue":"1","issued":{"date-parts":[[2016,12]]},"language":"en","page":"55","source":"DOI.org (Crossref)","title":"Block modelling in dynamic networks with non-homogeneous Poisson processes and exact ICL","type":"article-journal","URL":"http://link.springer.com/10.1007/s13278-016-0368-3","volume":"6"},
  {"id":"corneli2018","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Corneli","given":"Marco"},{"family":"Latouche","given":"Pierre"},{"family":"Rossi","given":"Fabrice"}],"citation-key":"corneli2018","container-title":"Statistics and Computing","container-title-short":"Stat Comput","DOI":"10.1007/s11222-017-9775-1","ISSN":"0960-3174, 1573-1375","issue":"5","issued":{"date-parts":[[2018,9]]},"language":"en","page":"989-1007","source":"DOI.org (Crossref)","title":"Multiple change points detection and clustering in dynamic networks","type":"article-journal","URL":"http://link.springer.com/10.1007/s11222-017-9775-1","volume":"28"},
  {"id":"cugmas2016","abstract":"This article examines the structure of co­authorship networks’ stability in time. The goal of the article is to analyse differences in the stability and size of groups of researchers that co­author with each other (core research groups) formed in disciplines from the natural and technical sciences on one hand and the social sciences and humanities on the other. The cores were obtained by a pre­specified blockmodeling procedure assuming a multi­core–semi­ periphery–periphery structure. The stability of the obtained cores was measured with the Modified Adjusted Rand Index. The assumed structure was confirmed in all analysed disciplines. The average size of the cores obtained is higher in the second time period and the average core size is greater in the natural and technical sciences than in the social sciences and humanities. There are no differences in average core stability between the natural and technical sciences and the social sciences and humanities. However, if the stability of cores is defined by the splitting of cores and not also by the percentage of researchers who left the cores, the average stability of the cores is higher in disciplines from the scientific fields of Engineering sciences and technologies and Medical sciences than in disciplines of the Humanities, if controlling for the networks’ and disciplines’ characteristics. The analysis was performed on disciplinary co­authorship networks of Slovenian researchers in two time periods (1991–2000 and 2001–2010).","accessed":{"date-parts":[[2020,8,11]]},"author":[{"family":"Cugmas","given":"Marjan"},{"family":"Ferligoj","given":"Anuška"},{"family":"Kronegger","given":"Luka"}],"citation-key":"cugmas2016","container-title":"Scientometrics","container-title-short":"Scientometrics","DOI":"10.1007/s11192-015-1790-4","ISSN":"0138-9130, 1588-2861","issue":"1","issued":{"date-parts":[[2016,1]]},"language":"en","page":"163-186","source":"DOI.org (Crossref)","title":"The stability of co-authorship structures","type":"article-journal","URL":"http://link.springer.com/10.1007/s11192-015-1790-4","volume":"106"},
  {"id":"cugmas2023","abstract":"Blockmodeling refers to a variety of statistical methods for reducing and simplifying large and complex networks. While methods for blockmodeling networks observed at one time point are well established, it is only recently that researchers have proposed several methods for analysing dynamic networks (i.e., networks observed at multiple time points). The considered approaches are based on k-means or stochastic blockmodeling, with different ways being used to model time dependency among time points. Their novelty means they have yet to be extensively compared and evaluated and the paper therefore aims to compare and evaluate them using Monte Carlo simulations. Different network characteristics are considered, including whether tie formation is random or governed by local network mechanisms. The results show the Dynamic Stochastic Blockmodel (Matias and Miele 2017) performs best if the blockmodel does not change; otherwise, the Stochastic Blockmodel for Multipartite Networks (Bar-Hen et al. 2020) does.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Cugmas","given":"Marjan"},{"family":"Žiberna","given":"Aleš"}],"citation-key":"cugmas2023","container-title":"Social Networks","container-title-short":"Social Networks","DOI":"10.1016/j.socnet.2022.12.003","ISSN":"0378-8733","issued":{"date-parts":[[2023,5,1]]},"page":"7-19","source":"ScienceDirect","title":"Approaches to blockmodeling dynamic networks: A Monte Carlo simulation study","title-short":"Approaches to blockmodeling dynamic networks","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0378873322001022","volume":"73"},
  {"id":"doreian1996","abstract":"The classic formulation of structural balance by Cartwright and Harary (Psychological Review, 63, 1956, 277–293) had the basic structural theorem that a balanced structure could be partitioned into two mutually antagonistic subgroups each having internal solidarity. Davis (Human Relations, 20, 1967, 181–187) extended this theorem for cases where there can be more than two such mutually antagonistic subgroups. We use these theorems to construct a criterion function for a local optimization partitioning procedure for signed digraphs. For any signed digraph, this procedure yields those partitions with the smallest number of errors, a measure of the imbalance in the graph, and an identification of those links inconsistent with both generalized and structural balance. These methods are applied to some artificial data and to the affect data from Sampson (A novitiate in a period of change: An experimental and case study of social relationships, Dissertation, Cornell University, 1968). The latter provides a positive test of a basic tenet of balance theory, that there is a tendency towards balance with signed relations in human groups. While these methods can be applied to all signed digraphs and signed graphs, the balance hypothesis is relevant only for affect ties.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Doreian","given":"Patrick"},{"family":"Mrvar","given":"Andrej"}],"citation-key":"doreian1996","container-title":"Social Networks","container-title-short":"Social Networks","DOI":"10.1016/0378-8733(95)00259-6","ISSN":"0378-8733","issue":"2","issued":{"date-parts":[[1996,4,1]]},"page":"149-168","source":"ScienceDirect","title":"A partitioning approach to structural balance","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/0378873395002596","volume":"18"},
  {"id":"doreian2011","accessed":{"date-parts":[[2020,8,11]]},"author":[{"family":"Doreian","given":"Patrick"},{"family":"Ferligoj","given":"Anuška"},{"family":"Kronegger","given":"Luka"}],"citation-key":"doreian2011","container-title":"Quality & Quantity","container-title-short":"Qual Quant","DOI":"10.1007/s11135-011-9487-0","ISSN":"0033-5177, 1573-7845","issue":"5","issued":{"date-parts":[[2011,8]]},"language":"en","page":"1025-1029","source":"DOI.org (Crossref)","title":"On the dynamics of national scientific systems: a reply","title-short":"On the dynamics of national scientific systems","type":"article-journal","URL":"http://link.springer.com/10.1007/s11135-011-9487-0","volume":"45"},
  {"id":"ferligoj2015a","abstract":"We start our presentation with a discussion of social systems composed of positions and roles. This is followed by a set of methods for identifying positions, roles and delineating social network structures. We finish by listing some important open problems requiring solutions so that we can better understand the structure and operation of role systems.","author":[{"family":"Ferligoj","given":"Anuska"},{"family":"Doreian","given":"Patrick"},{"family":"Batagelj","given":"Vladimir"}],"citation-key":"ferligoj2015a","DOI":"10.4135/9781446294413.n29","issued":{"date-parts":[[2015,1,8]]},"source":"ResearchGate","title":"Positions and Roles","type":"article-journal"},
  {"id":"funke2019","abstract":"Finding communities in complex networks is a challenging task and one promising approach is the Stochastic Block Model (SBM). But the influences from various fields led to a diversity of variants and inference methods. Therefore, a comparison of the existing techniques and an independent analysis of their capabilities and weaknesses is needed. As a first step, we review the development of different SBM variants such as the degree-corrected SBM of Karrer and Newman or Peixoto’s hierarchical SBM. Beside stating all these variants in a uniform notation, we show the reasons for their development. Knowing the variants, we discuss a variety of approaches to infer the optimal partition like the Metropolis-Hastings algorithm. We perform our analysis based on our extension of the Girvan-Newman test and the Lancichinetti-Fortunato-Radicchi benchmark as well as a selection of some real world networks. Using these results, we give some guidance to the challenging task of selecting an inference method and SBM variant. In addition, we give a simple heuristic to determine the number of steps for the Metropolis-Hastings algorithms that lack a usual stop criterion. With our comparison, we hope to guide researches in the field of SBM and highlight the problem of existing techniques to focus future research. Finally, by making our code freely available, we want to promote a faster development, integration and exchange of new ideas.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Funke","given":"Thorben"},{"family":"Becker","given":"Till"}],"citation-key":"funke2019","container-title":"PLOS ONE","container-title-short":"PLOS ONE","DOI":"10.1371/journal.pone.0215296","ISSN":"1932-6203","issue":"4","issued":{"literal":"23 апр. 2019 г."},"language":"en","page":"e0215296","publisher":"Public Library of Science","source":"PLoS Journals","title":"Stochastic block models: A comparison of variants and inference methods","title-short":"Stochastic block models","type":"article-journal","URL":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0215296","volume":"14"},
  {"id":"govaert2008","abstract":"The block or simultaneous clustering problem on a set of objects and a set of variables is embedded in the mixture model. Two algorithms have been developed: block EM as part of the maximum likelihood and fuzzy approaches, and block CEM as part of the classification maximum likelihood approach. A unified framework for obtaining different variants of block EM is proposed. These variants are studied and their performances evaluated in comparison with block CEM, two-way EM and two-way CEM, i.e EM and CEM applied separately to the two sets.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Govaert","given":"Gérard"},{"family":"Nadif","given":"Mohamed"}],"citation-key":"govaert2008","container-title":"Computational Statistics & Data Analysis","container-title-short":"Computational Statistics & Data Analysis","DOI":"10.1016/j.csda.2007.09.007","ISSN":"0167-9473","issue":"6","issued":{"date-parts":[[2008,2,20]]},"page":"3233-3245","source":"ScienceDirect","title":"Block clustering with Bernoulli mixture models: Comparison of different approaches","title-short":"Block clustering with Bernoulli mixture models","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0167947307003441","volume":"52"},
  {"id":"hartigan1979","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Hartigan","given":"J. A."},{"family":"Wong","given":"M. A."}],"citation-key":"hartigan1979","container-title":"Journal of the Royal Statistical Society. Series C (Applied Statistics)","DOI":"10.2307/2346830","ISSN":"0035-9254","issue":"1","issued":{"date-parts":[[1979]]},"page":"100-108","publisher":"[Wiley, Royal Statistical Society]","source":"JSTOR","title":"Algorithm AS 136: A K-Means Clustering Algorithm","title-short":"Algorithm AS 136","type":"article-journal","URL":"https://www.jstor.org/stable/2346830","volume":"28"},
  {"id":"haykin2001","accessed":{"date-parts":[[2023,11,27]]},"citation-key":"haykin2001","DOI":"10.1002/0471221546","edition":"1","editor":[{"family":"Haykin","given":"Simon"}],"ISBN":"978-0-471-36998-1 978-0-471-22154-8","issued":{"date-parts":[[2001,10]]},"language":"en","publisher":"Wiley","source":"DOI.org (Crossref)","title":"Kalman Filtering and Neural Networks","type":"book","URL":"https://onlinelibrary.wiley.com/doi/book/10.1002/0471221546"},
  {"id":"hedstrom1998b","abstract":"The advancement of social theory requires an analytical approach that systematically seeks to explicate the social mechanisms that generate and explain observed associations between events. These essays, written by prominent social scientists, advance criticisms of current trends in social theory and suggest alternative approaches. The mechanism approach calls attention to an intermediary level of analysis in between pure description and story-telling, on the one hand, and grand theorizing and universal social laws, on the other. For social theory to be of use for the working social scientist, it must attain a high level of precision and provide a toolbox from which middle range theories can be constructed.","accessed":{"date-parts":[[2023,11,27]]},"citation-key":"hedstrom1998b","DOI":"10.1017/CBO9780511663901","edition":"1","editor":[{"family":"Hedström","given":"Peter"},{"family":"Swedberg","given":"Richard"}],"ISBN":"978-0-521-59687-9 978-0-521-59319-9 978-0-511-66390-1","issued":{"date-parts":[[1998,1,13]]},"publisher":"Cambridge University Press","source":"DOI.org (Crossref)","title":"Social Mechanisms: An Analytical Approach to Social Theory","title-short":"Social Mechanisms","type":"book","URL":"https://www.cambridge.org/core/product/identifier/9780511663901/type/book"},
  {"id":"holme2015a","abstract":"The power of any kind of network approach lies in the ability to simplify a complex system so that one can better understand its function as a whole. Sometimes it is beneﬁcial, however, to include more information than in a simple graph of only nodes and links. Adding information about times of interactions can make predictions and mechanistic understanding more accurate. The drawback, however, is that there are not so many methods available, partly because temporal networks is a relatively young ﬁeld, partly because it is more diﬃcult to develop such methods compared to for static networks. In this colloquium, we review the methods to analyze and model temporal networks and processes taking place on them, focusing mainly on the last three years. This includes the spreading of infectious disease, opinions, rumors, in social networks; information packets in computer networks; various types of signaling in biology, and more. We also discuss future directions.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Holme","given":"Petter"}],"citation-key":"holme2015a","container-title":"The European Physical Journal B","container-title-short":"Eur. Phys. J. B","DOI":"10.1140/epjb/e2015-60657-4","ISSN":"1434-6028, 1434-6036","issue":"9","issued":{"date-parts":[[2015,9]]},"language":"en","page":"234","source":"DOI.org (Crossref)","title":"Modern temporal network theory: a colloquium","title-short":"Modern temporal network theory","type":"article-journal","URL":"http://link.springer.com/10.1140/epjb/e2015-60657-4","volume":"88"},
  {"id":"kim2018","abstract":"We present a selective review of statistical modeling of dynamic networks. We focus on models with latent variables, specifically, the latent space models and the latent class models (or stochastic blockmodels), which investigate both the observed features and the unobserved structure of networks. We begin with an overview of the static models, and then we introduce the dynamic extensions. For each dynamic model, we also discuss its applications that have been studied in the literature, with the data source listed in . Based on the review, we summarize a list of open problems and challenges in dynamic network modeling with latent variables.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Kim","given":"Bomin"},{"family":"Lee","given":"Kevin H."},{"family":"Xue","given":"Lingzhou"},{"family":"Niu","given":"Xiaoyue"}],"citation-key":"kim2018","container-title":"Statistics surveys","container-title-short":"Stat Surv","DOI":"10.1214/18-SS121","ISSN":"1935-7516","issued":{"date-parts":[[2018]]},"page":"105-135","PMCID":"PMC6699782","PMID":"31428219","source":"PubMed Central","title":"A review of dynamic network models with latent variables","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6699782/","volume":"12"},
  {"id":"lee2019a","abstract":"There have been rapid developments in model-based clustering of graphs, also known as block modelling, over the last ten years or so. We review different approaches and extensions proposed for different aspects in this area, such as the type of the graph, the clustering approach, the inference approach, and whether the number of groups is selected or estimated. We also review models that combine block modelling with topic modelling and/or longitudinal modelling, regarding how these models deal with multiple types of data. How different approaches cope with various issues will be summarised and compared, to facilitate the demand of practitioners for a concise overview of the current status of these areas of literature.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Lee","given":"Clement"},{"family":"Wilkinson","given":"Darren J."}],"citation-key":"lee2019a","container-title":"Applied Network Science","container-title-short":"Appl Netw Sci","DOI":"10.1007/s41109-019-0232-2","ISSN":"2364-8228","issue":"1","issued":{"date-parts":[[2019,12]]},"language":"en","license":"2019 The Author(s)","number":"1","page":"1-50","publisher":"SpringerOpen","source":"appliednetsci.springeropen.com","title":"A review of stochastic block models and extensions for graph clustering","type":"article-journal","URL":"https://appliednetsci.springeropen.com/articles/10.1007/s41109-019-0232-2","volume":"4"},
  {"id":"lorrainfrancois1971","accessed":{"date-parts":[[2023,11,27]]},"author":[{"literal":"Lorrain François"},{"literal":"White Harrison C."}],"citation-key":"lorrainfrancois1971","DOI":"https://doi.org/10.1080/0022250X.1971.9989788","issued":{"date-parts":[[1971]]},"title":"Structural equivalence of individuals in social networks: The Journal of Mathematical Sociology: Vol 1, No 1","type":"article-journal","URL":"https://www.tandfonline.com/doi/abs/10.1080/0022250X.1971.9989788"},
  {"id":"Mali2012","abstract":"Scientific collaboration networks have been studied systematically since 1960 by scholars belonging to various disciplinary backgrounds. As a result, the complex phenomenon of scientific collaboration networks has been investigated within different approaches. Although the term “scientific collaboration network” has different connotations in the literature, we use the term more narrowly to focus on scientific collaboration resulting in co-authored public documents. We broaden this beyond journal articles to include many types of scientific productions in addition to journal articles and books. We insist that these productions are public items available in each field. In this chapter, we focus on the main quantitative approaches dealing with the structure and dynamics of scientific collaboration networks through co-authorized publications. We provide a brief history of social network analysis that serves as a foundation. We further review earlier conceptual classifications of co-authorship networks and distinguish cross-disciplinarily, cross-sectoral and cross-national levels. We couple the newer ideas of “small world” models and “preferential attachment” to older sociological conceptions of scientific collaboration. This is followed by descriptions of deterministic and stochastic models that have been used to study dynamic scientific collaboration networks. We stress the importance of delineating the topology of collaboration networks, understanding micro-level processes and then coupling them. We conclude by outlining the strengths and limitations of various modeling strategies.","author":[{"family":"Mali","given":"Franc"},{"family":"Kronegger","given":"Luka"},{"family":"Doreian","given":"Patrick"},{"family":"Ferligoj","given":"Anuška"}],"citation-key":"Mali2012","container-title":"Models of science dynamics: Encounters between complexity theory and information sciences","DOI":"10.1007/978-3-642-23068-4_6","editor":[{"family":"Scharnhorst","given":"Andrea"},{"family":"Börner","given":"Katy"},{"family":"Besselaar","given":"Peter","non-dropping-particle":"van den"}],"event-place":"Berlin, Heidelberg","ISBN":"978-3-642-23068-4","issued":{"date-parts":[[2012]]},"page":"195–232","publisher":"Springer Berlin Heidelberg","publisher-place":"Berlin, Heidelberg","title":"Dynamic scientific co-authorship networks","type":"chapter","URL":"https://doi.org/10.1007/978-3-642-23068-4_6"},
  {"id":"matias2017","abstract":"Statistical node clustering in discrete time dynamic networks is an emerging ﬁeld that raises many challenges. Here, we explore statistical properties and frequentist inference in a model that combines a stochastic block model for its static part with independent Markov chains for the evolution of the nodes groups through time. We model binary data as well as weighted dynamic random graphs (with discrete or continuous edges values). Our approach, motivated by the importance of controlling for label switching issues across the different time steps, focuses on detecting groups characterized by a stable within-group connectivity behaviour. We study identiﬁability of the model parameters and propose an inference procedure based on a variational expectation–maximization algorithm as well as a model selection criterion to select the number of groups. We carefully discuss our initialization strategy which plays an important role in the method and we compare our procedure with existing procedures on synthetic data sets. We also illustrate our approach on dynamic contact networks: one of encounters between high school students and two others on animal interactions. An implementation of the method is available as an R package called dynsbm.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Matias","given":"Catherine"},{"family":"Miele","given":"Vincent"}],"citation-key":"matias2017","container-title":"Journal of the Royal Statistical Society Series B: Statistical Methodology","DOI":"10.1111/rssb.12200","ISSN":"1369-7412, 1467-9868","issue":"4","issued":{"date-parts":[[2017,9,1]]},"language":"en","page":"1119-1141","source":"DOI.org (Crossref)","title":"Statistical Clustering of Temporal Networks Through a Dynamic Stochastic Block Model","type":"article-journal","URL":"https://academic.oup.com/jrsssb/article/79/4/1119/7040669","volume":"79"},
  {"id":"matias2018","abstract":"We propose an extension of the stochastic block model for recurrent interaction events in continuous time, where every individual belongs to a latent group and conditional interactions between two individuals follow an inhomogeneous Poisson process with intensity driven by the individuals’ latent groups. We show that the model is identiﬁable and estimate it with a semiparametric variational expectation-maximization algorithm. We develop two versions of the method, one using a nonparametric histogram approach with an adaptive choice of the partition size, and the other using kernel intensity estimators. We select the number of latent groups by an integrated classiﬁcation likelihood criterion. We demonstrate the performance of our procedure on synthetic experiments, analyse two datasets to illustrate the utility of our approach, and comment on competing methods.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Matias","given":"C"},{"family":"Rebafka","given":"T"},{"family":"Villers","given":"F"}],"citation-key":"matias2018","container-title":"Biometrika","DOI":"10.1093/biomet/asy016","ISSN":"0006-3444, 1464-3510","issue":"3","issued":{"date-parts":[[2018,9,1]]},"language":"en","page":"665-680","source":"DOI.org (Crossref)","title":"A semiparametric extension of the stochastic block model for longitudinal networks","type":"article-journal","URL":"https://academic.oup.com/biomet/article/105/3/665/5032575","volume":"105"},
  {"id":"peixoto2017","abstract":"Abstract\n            In evolving complex systems such as air traffic and social organisations, collective effects emerge from their many components’ dynamic interactions. While the dynamic interactions can be represented by temporal networks with nodes and links that change over time, they remain highly complex. It is therefore often necessary to use methods that extract the temporal networks’ large-scale dynamic community structure. However, such methods are subject to overfitting or suffer from effects of arbitrary, a priori-imposed timescales, which should instead be extracted from data. Here we simultaneously address both problems and develop a principled data-driven method that determines relevant timescales and identifies patterns of dynamics that take place on networks, as well as shape the networks themselves. We base our method on an arbitrary-order Markov chain model with community structure, and develop a nonparametric Bayesian inference framework that identifies the simplest such model that can explain temporal interaction data.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Peixoto","given":"Tiago P."},{"family":"Rosvall","given":"Martin"}],"citation-key":"peixoto2017","container-title":"Nature Communications","container-title-short":"Nat Commun","DOI":"10.1038/s41467-017-00148-9","ISSN":"2041-1723","issue":"1","issued":{"date-parts":[[2017,9,19]]},"language":"en","page":"582","source":"DOI.org (Crossref)","title":"Modelling sequences and temporal networks with dynamic community structures","type":"article-journal","URL":"https://www.nature.com/articles/s41467-017-00148-9","volume":"8"},
  {"id":"peixoto2019","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Peixoto","given":"Tiago P."}],"citation-key":"peixoto2019","container-title":"Advances in Network Clustering and Blockmodeling","DOI":"10.1002/9781119483298.ch11","edition":"1","editor":[{"family":"Doreian","given":"Patrick"},{"family":"Batagelj","given":"Vladimir"},{"family":"Ferligoj","given":"Anuška"}],"ISBN":"978-1-119-22470-9 978-1-119-48329-8","issued":{"date-parts":[[2019,11,23]]},"language":"en","page":"289-332","publisher":"Wiley","source":"DOI.org (Crossref)","title":"Bayesian Stochastic Blockmodeling","type":"chapter","URL":"https://onlinelibrary.wiley.com/doi/10.1002/9781119483298.ch11"},
  {"id":"rand1971","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Rand","given":"William M."}],"citation-key":"rand1971","container-title":"Journal of the American Statistical Association","container-title-short":"Journal of the American Statistical Association","DOI":"10.1080/01621459.1971.10482356","ISSN":"0162-1459, 1537-274X","issue":"336","issued":{"date-parts":[[1971,12]]},"language":"en","page":"846-850","source":"DOI.org (Crossref)","title":"Objective Criteria for the Evaluation of Clustering Methods","type":"article-journal","URL":"http://www.tandfonline.com/doi/abs/10.1080/01621459.1971.10482356","volume":"66"},
  {"id":"schwartz1977","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Schwartz","given":"Joseph E."}],"citation-key":"schwartz1977","container-title":"Sociological Methodology","container-title-short":"Sociological Methodology","DOI":"10.2307/270759","ISSN":"00811750","issued":{"date-parts":[[1977]]},"page":"255","source":"DOI.org (Crossref)","title":"An Examination of Concor and Related Methods for Blocking Sociometric Data","type":"article-journal","URL":"https://www.jstor.org/stable/270759?origin=crossref","volume":"8"},
  {"id":"skulj2022","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Škulj","given":"Damjan"},{"family":"Žiberna","given":"Aleš"}],"citation-key":"skulj2022","container-title":"Social Networks","container-title-short":"Social Networks","DOI":"10.1016/j.socnet.2022.02.001","ISSN":"03788733","issued":{"date-parts":[[2022,7]]},"language":"en","page":"240-252","source":"DOI.org (Crossref)","title":"Stochastic blockmodeling of linked networks","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S037887332200017X","volume":"70"},
  {"id":"snijders1997","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Snijders","given":"Tom A.B."},{"family":"Nowicki","given":"Krzysztof"}],"citation-key":"snijders1997","container-title":"Journal of Classification","container-title-short":"Journal of Classification","DOI":"10.1007/s003579900004","ISSN":"0176-4268, 1432-1343","issue":"1","issued":{"date-parts":[[1997,1,1]]},"page":"75-100","source":"DOI.org (Crossref)","title":"Estimation and Prediction for Stochastic Blockmodels for Graphs with Latent Block Structure","type":"article-journal","URL":"http://link.springer.com/10.1007/s003579900004","volume":"14"},
  {"id":"stadtfeld2015","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Stadtfeld","given":"Christoph"},{"family":"Pentland","given":"Alex (Sandy)"}],"citation-key":"stadtfeld2015","container-title":"Social Forces","container-title-short":"Social Forces","DOI":"10.1093/sf/sov079","ISSN":"0037-7732, 1534-7605","issue":"1","issued":{"date-parts":[[2015,9]]},"language":"en","page":"453-477","source":"DOI.org (Crossref)","title":"Partnership Ties Shape Friendship Networks: A Dynamic Social Network Study","title-short":"Partnership Ties Shape Friendship Networks","type":"article-journal","URL":"https://academic.oup.com/sf/article-lookup/doi/10.1093/sf/sov079","volume":"94"},
  {"id":"stadtfeld2018","abstract":"Important questions in the social sciences are concerned with the link between micro-level behavior and aggregate macro-level outcomes. This article proposes that studies of the micro-macro link in social systems can utilize conceptual representations and analytical strategies from the field of social networks, and that micro-macro dynamics can be investigated by combining state-of-the-art statistical network models with research strategies from agent-based network modeling. An empirical case study illustrates how stochastic actor-oriented models can be applied as empirically calibrated agent-based simulations. The fruitfulness of this approach is demonstrated by a Schelling-inspired case study on the emergence of segregation in social networks. It is shown that even individuals without homophilous preferences may find themselves in segregated structures due to the complex interaction of different network mechanisms. The example thereby illustrates how social networks can serve as a conceptual and analytical framework to study the micro-macro link in dynamic, interdependent, and multi-mechanistic social systems.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Stadtfeld","given":"Christoph"}],"citation-key":"stadtfeld2018","event-place":"Rochester, NY","genre":"SSRN Scholarly Paper","issued":{"date-parts":[[2018,6,6]]},"language":"en","number":"3211795","publisher-place":"Rochester, NY","source":"Social Science Research Network","title":"The Micro-Macro Link in Social Networks","type":"article","URL":"https://papers.ssrn.com/abstract=3211795"},
  {"id":"stadtfeld2020","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Stadtfeld","given":"Christoph"},{"family":"Takács","given":"Károly"},{"family":"Vörös","given":"András"}],"citation-key":"stadtfeld2020","container-title":"Social Networks","container-title-short":"Social Networks","DOI":"10.1016/j.socnet.2019.10.008","ISSN":"03788733","issued":{"date-parts":[[2020,1]]},"language":"en","page":"129-145","source":"DOI.org (Crossref)","title":"The Emergence and Stability of Groups in Social Networks","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0378873318300170","volume":"60"},
  {"id":"wilson2019","abstract":"Abstract\n            In many applications, it is of interest to identify anomalous behavior within a dynamic interacting system. Such anomalous interactions are reflected by structural changes in the network representation of the system. We propose and investigate the use of the degree corrected stochastic block model (DCSBM) to model and monitor dynamic networks that undergo a significant structural change. We apply statistical process monitoring techniques to the estimated parameters of the DCSBM to identify significant structural changes in the network. We apply our surveillance strategy to a dynamic US Senate covoting network. We detect significant changes in the political network that reflect both times of cohesion and times of polarization among Republican and Democratic party members. Our analysis demonstrates that the DCSBM monitoring procedure effectively detects local and global structural changes in complex networks, providing useful insights into the modeled system. The DCSBM approach is an example of a general framework that combines parametric random graph models and statistical process monitoring techniques for network surveillance.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Wilson","given":"James D."},{"family":"Stevens","given":"Nathaniel T."},{"family":"Woodall","given":"William H."}],"citation-key":"wilson2019","container-title":"Quality and Reliability Engineering International","container-title-short":"Quality & Reliability Eng","DOI":"10.1002/qre.2520","ISSN":"0748-8017, 1099-1638","issue":"5","issued":{"date-parts":[[2019,7]]},"language":"en","page":"1363-1378","source":"DOI.org (Crossref)","title":"Modeling and detecting change in temporal networks via the degree corrected stochastic block model","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/10.1002/qre.2520","volume":"35"},
  {"id":"xu","abstract":"There has been great interest in recent years on statistical models for dynamic networks. In this paper, I propose a stochastic block transition model (SBTM) for dynamic networks that is inspired by the well-known stochastic block model (SBM) for static networks and previous dynamic extensions of the SBM. Unlike most existing dynamic network models, it does not make a hidden Markov assumption on the edge-level dynamics, allowing the presence or absence of edges to directly inﬂuence future edge probabilities while retaining the interpretability of the SBM. I derive an approximate inference procedure for the SBTM and demonstrate that it is signiﬁcantly better at reproducing durations of edges in real social network data.","author":[{"family":"Xu","given":"Kevin S"}],"citation-key":"xu","language":"en","source":"Zotero","title":"Stochastic Block Transition Models for Dynamic Networks","type":"article-journal"},
  {"id":"xu2014","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Xu","given":"Kevin S."},{"family":"Hero","given":"Alfred O."}],"citation-key":"xu2014","container-title":"IEEE Journal of Selected Topics in Signal Processing","container-title-short":"IEEE J. Sel. Top. Signal Process.","DOI":"10.1109/JSTSP.2014.2310294","ISSN":"1932-4553, 1941-0484","issue":"4","issued":{"date-parts":[[2014,8]]},"page":"552-562","source":"DOI.org (Crossref)","title":"Dynamic Stochastic Blockmodels for Time-Evolving Social Networks","type":"article-journal","URL":"https://ieeexplore.ieee.org/document/6758385/","volume":"8"},
  {"id":"xu2015","abstract":"There has been great interest in recent years on statistical models for dynamic networks. In this paper, I propose a stochastic block transition model (SBTM) for dynamic networks that is inspired by the well-known stochastic block model (SBM) for static networks and previous dynamic extensions of the SBM. Unlike most existing dynamic network models, it does not make a hidden Markov assumption on the edge-level dynamics, allowing the presence or absence of edges to directly influence future edge probabilities while retaining the interpretability of the SBM. I derive an approximate inference procedure for the SBTM and demonstrate that it is significantly better at reproducing durations of edges in real social network data.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Xu","given":"Kevin"}],"citation-key":"xu2015","container-title":"Proceedings of the Eighteenth International Conference on Artificial Intelligence and Statistics","event-title":"Artificial Intelligence and Statistics","ISSN":"1938-7228","issued":{"date-parts":[[2015,2,21]]},"language":"en","page":"1079-1087","publisher":"PMLR","source":"proceedings.mlr.press","title":"Stochastic Block Transition Models for Dynamic Networks","type":"paper-conference","URL":"https://proceedings.mlr.press/v38/xu15.html"},
  {"id":"ziberna2007","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Žiberna","given":"Aleš"}],"citation-key":"ziberna2007","container-title":"Social Networks","container-title-short":"Social Networks","DOI":"10.1016/j.socnet.2006.04.002","ISSN":"03788733","issue":"1","issued":{"date-parts":[[2007,1]]},"language":"en","page":"105-126","source":"DOI.org (Crossref)","title":"Generalized blockmodeling of valued networks","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S037887330600013X","volume":"29"},
  {"id":"ziberna2009","abstract":"The aim of the paper is to compare and evaluate different approaches to detecting regular equivalence classes of valued networks. The evaluated approaches include different versions of REGE (indirect approaches) and generalized blockmodeling approaches (direct approaches). In addition to the approaches designed to detect regular equivalence, some approaches designed to detect structural equivalence are also included for comparison. The evaluation is done by means of simulations. Networks of 11 and 25 units were generated based on different known (max-)regular blockmodels and partitions. The obtained partitions were compared to the original (known) partition using the Adjusted Rand Index. The results show that homogeneity blockmodeling, implicit blockmodeling and REGE are usually the best approaches for detecting regular equivalence. The most surprising result is that methods for detecting structural equivalence preformed relatively well on networks generated based on (max)-regular equivalence, better then several approaches designed to detect regular equivalence.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Žiberna","given":"Aleš"}],"citation-key":"ziberna2009","container-title":"Advances in Methodology and Statistics","container-title-short":"Adv Meth Stat","DOI":"10.51936/kshx3707","ISSN":"1854-0031, 1854-0023","issue":"2","issued":{"date-parts":[[2009,7,1]]},"source":"DOI.org (Crossref)","title":"Evaluation of direct and indirect blockmodeling of regular equivalence in valued networks by simulations","type":"article-journal","URL":"https://mz.mf.uni-lj.si/article/view/95","volume":"6"},
  {"id":"ziberna2014","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Žiberna","given":"Aleš"}],"citation-key":"ziberna2014","container-title":"Social Networks","container-title-short":"Social Networks","DOI":"10.1016/j.socnet.2014.04.002","ISSN":"03788733","issued":{"date-parts":[[2014,10]]},"language":"en","page":"46-61","source":"DOI.org (Crossref)","title":"Blockmodeling of multilevel networks","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0378873314000306","volume":"39"},
  {"id":"ziberna2019","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Žiberna","given":"Aleš"}],"citation-key":"ziberna2019","container-title":"Advances in Network Clustering and Blockmodeling","DOI":"10.1002/9781119483298.ch10","edition":"1","editor":[{"family":"Doreian","given":"Patrick"},{"family":"Batagelj","given":"Vladimir"},{"family":"Ferligoj","given":"Anuška"}],"ISBN":"978-1-119-22470-9 978-1-119-48329-8","issued":{"date-parts":[[2019,11,23]]},"language":"en","page":"267-287","publisher":"Wiley","source":"DOI.org (Crossref)","title":"Blockmodeling Linked Networks","type":"chapter","URL":"https://onlinelibrary.wiley.com/doi/10.1002/9781119483298.ch10"},
  {"id":"ziberna2020","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Žiberna","given":"Aleš"}],"citation-key":"ziberna2020","container-title":"Social Networks","container-title-short":"Social Networks","DOI":"10.1016/j.socnet.2019.10.006","ISSN":"03788733","issued":{"date-parts":[[2020,5]]},"language":"en","page":"153-169","source":"DOI.org (Crossref)","title":"k-means-based algorithm for blockmodeling linked networks","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0378873319300176","volume":"61"},
  {"id":"ziberna2021","abstract":"One-mode homogeneity blockmodeling is an approach to clustering networks that searches for partitions of units in a network so that the resulting blocks are as homogeneous as possible. Block is a part of the network that contain (possible) ties from the units of one cluster to the units of another cluster (or ties within a cluster). Typically, sum of squared deviations from the mean is taken as the measure of variability (non-homogeneity). The paper presents the results of a simulation study that applied several methods for this problem to binary networks generated according to structural equivalence. Several versions of homogeneity generalized blockmodeling (using a relocation algorithm), a k-means-based algorithm, and an indirect approach are compared. Since all of the methods being compared try to optimize the same criterion function, this and the Adjusted Rand Index are the main criteria for the comparison. All methods (except the indirect approach, which is not iterative) were given the same amount of time to find the best possible solution. The overall conclusion is that the k-means approach is advised in most cases, except when smaller networks (200 units) are being partitioned into larger number of clusters, in which case the homogeneity generalized blockmodeling is preferred.","accessed":{"date-parts":[[2023,11,27]]},"author":[{"family":"Žiberna","given":"Aleš"}],"citation-key":"ziberna2021","container-title":"Advances in Methodology and Statistics","container-title-short":"Adv Meth Stat","DOI":"10.51936/kcpy2449","ISSN":"1854-0031, 1854-0023","issue":"1","issued":{"date-parts":[[2021,7,1]]},"source":"DOI.org (Crossref)","title":"Comparing different methods for one-mode homogeneity blockmodeling according to structural equivalence on binary networks","type":"article-journal","URL":"https://mz.mf.uni-lj.si/article/view/212","volume":"18"}
]
