[
  {"id":"batagelj1999","abstract":"The goal of blockmodeling is to reduce a large, potentially incoherent network to a smaller comprehensible structure that can be interpreted more readily. In the paper we present some basic ideas and developments in this area. 1 Basic Notions 1.1 Network Let E = {X 1 , X 2 , . . . , X n } be a finite set of units or units. The units are related by binary relations R t # E E, t = 1, . . . , r, r # 1 which determine a network N = (E, R 1 , R 2 , . . . , R r ) In the following we restrict our discussion to a single relation R described by a corresponding binary matrix R = [r ij ] nn where r ij = # 1 X i RX j 0 otherwise In some applications r ij can be a nonnegative real number expressing the strength of the relation R between units X i and X j . 1.1.1 Example: Student Government In Table 1 and Figure 1 the Student Government network is presented. It consists of communication interactions among twelve members and advisors of the Student Government at the Universit...","author":[{"family":"Batagelj","given":"Vladimir"},{"family":"Ferligoj","given":"Anuska"},{"family":"Doreian","given":"Patrick"}],"citation-key":"batagelj1999","issued":{"date-parts":[[1999,10,27]]},"source":"ResearchGate","title":"Generalized Blockmodeling","type":"article-journal"},
  {"id":"marcot2019","abstract":"Bayesian network (BN) modeling is a rapidly advancing field. Here we explore new methods by which BN model development and application are being joined with other tools and model frameworks. Advances include improving areas of Bayesian classifiers and machine-learning algorithms for model structuring and parameterization, and development of time-dynamic models. Increasingly, BN models are being integrated with: management decision networks; structural equation modeling of causal networks; Bayesian neural networks; combined discrete and continuous variables; object-oriented and agent-based models; state-and-transition models; geographic information systems; quantum probability; and other fields. Integrated BNs (IBNs) are becoming useful tools in risk analysis, risk management, and decision science for resource planning and environmental management. In the near future, IBNs may become self-structuring, self-learning systems fed by real-time monitoring data. Such advances may make model validation difficult, and may question model credibility, particularly if based on uncertain sources of knowledge systems and big data.","accessed":{"date-parts":[[2023,6,22]]},"author":[{"family":"Marcot","given":"Bruce G."},{"family":"Penman","given":"Trent D."}],"citation-key":"marcot2019","container-title":"Environmental Modelling & Software","container-title-short":"Environmental Modelling & Software","DOI":"10.1016/j.envsoft.2018.09.016","ISSN":"13648152","issued":{"date-parts":[[2019,1]]},"language":"en","page":"386-393","source":"DOI.org (Crossref)","title":"Advances in Bayesian network modelling: Integration of modelling technologies","title-short":"Advances in Bayesian network modelling","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S1364815218302937","volume":"111"}
]
