[
  {"id":"bhattacharyaInternationalTradeNetwork2008a","abstract":"Tools of the theory of critical phenomena, namely the scaling analysis and universality, are argued to be applicable to large complex web-like network structures. Using a detailed analysis of the real data of the International Trade Network we argue that the scaled link weight distribution has an approximate log-normal distribution which remains robust over a period of 53 years. Another universal feature is observed in the power-law growth of the trade strength with gross domestic product, the exponent being similar for all countries. Using the ‘rich-club’ coefficient measure of the weighted networks it has been shown that the size of the rich-club controlling half of the world’s trade is actually shrinking. While the gravity law is known to describe well the social interactions in the static networks of population migration, international trade, etc, here for the first time we studied a non-conservative dynamical model based on the gravity law which excellently reproduced many empirical features of the ITN.","accessed":{"date-parts":[[2023,6,22]]},"author":[{"family":"Bhattacharya","given":"K."},{"family":"Mukherjee","given":"G."},{"family":"Saramäki","given":"J."},{"family":"Kaski","given":"K."},{"family":"Manna","given":"S. S."}],"citation-key":"bhattacharyaInternationalTradeNetwork2008a","container-title":"Journal of Statistical Mechanics: Theory and Experiment","container-title-short":"J. Stat. Mech.","DOI":"10.1088/1742-5468/2008/02/P02002","ISSN":"1742-5468","issue":"02","issued":{"date-parts":[[2008,2]]},"language":"en","page":"P02002","source":"Institute of Physics","title":"The International Trade Network: weighted network analysis and modelling","title-short":"The International Trade Network","type":"article-journal","URL":"https://dx.doi.org/10.1088/1742-5468/2008/02/P02002","volume":"2008"},
  {"id":"deandradeUseNodesAttributes2018","accessed":{"date-parts":[[2023,6,22]]},"author":[{"family":"de Andrade","given":"Ricardo Lopes"},{"family":"Rêgo","given":"Leandro Chaves"}],"citation-key":"deandradeUseNodesAttributes2018","container-title":"Physica A: Statistical Mechanics and its Applications","container-title-short":"Physica A: Statistical Mechanics and its Applications","DOI":"10.1016/j.physa.2017.08.126","ISSN":"03784371","issued":{"date-parts":[[2018,2]]},"language":"en","page":"249-270","source":"DOI.org (Crossref)","title":"The use of nodes attributes in social network analysis with an application to an international trade network","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0378437117308579","volume":"491"},
  {"id":"deandradeUseNodesAttributes2018a","abstract":"The social network analysis (SNA) studies the interactions among actors in a network formed through some relationship (friendship, cooperation, trade, among others). The SNA is constantly approached from a binary point of view, i.e., it is only observed if a link between two actors is present or not regardless of the strength of this link. It is known that different information can be obtained in weighted and unweighted networks and that the information extracted from weighted networks is more accurate and detailed. Another rarely discussed approach in the SNA is related to the individual attributes of the actors (nodes), because such analysis is usually focused on the topological structure of networks. Features of the nodes are not incorporated in the SNA what implies that there is some loss or misperception of information in those analyze. This paper aims at exploring more precisely the complexities of a social network, initially developing a method that inserts the individual attributes in the topological structure of the network and then analyzing the network in four different ways: unweighted, edge-weighted and two methods for using both edge-weights and nodes’ attributes. The international trade network was chosen in the application of this approach, where the nodes represent the countries, the links represent the cash flow in the trade transactions and countries’ GDP were chosen as nodes’ attributes. As a result, it is possible to observe which countries are most connected in the world economy and with higher cash flows, to point out the countries that are central to the intermediation of the wealth flow and those that are most benefited from being included in this network. We also made a principal component analysis to study which metrics are more influential in describing the data variability, which turn out to be mostly the weighted metrics which include the nodes’ attributes.","accessed":{"date-parts":[[2023,6,22]]},"author":[{"family":"Andrade","given":"Ricardo Lopes","non-dropping-particle":"de"},{"family":"Rêgo","given":"Leandro Chaves"}],"citation-key":"deandradeUseNodesAttributes2018a","container-title":"Physica A: Statistical Mechanics and its Applications","container-title-short":"Physica A: Statistical Mechanics and its Applications","DOI":"10.1016/j.physa.2017.08.126","ISSN":"0378-4371","issued":{"date-parts":[[2018,2,1]]},"language":"en","page":"249-270","source":"ScienceDirect","title":"The use of nodes attributes in social network analysis with an application to an international trade network","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0378437117308579","volume":"491"},
  {"id":"debenedictisWorldTradeNetwork2011","accessed":{"date-parts":[[2023,6,22]]},"author":[{"family":"De Benedictis","given":"Luca"},{"family":"Tajoli","given":"Lucia"}],"citation-key":"debenedictisWorldTradeNetwork2011","container-title":"The World Economy","DOI":"10.1111/j.1467-9701.2011.01360.x","ISSN":"03785920","issue":"8","issued":{"date-parts":[[2011,8]]},"language":"en","page":"1417-1454","source":"DOI.org (Crossref)","title":"The World Trade Network: THE WORLD TRADE NETWORK","title-short":"The World Trade Network","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/10.1111/j.1467-9701.2011.01360.x","volume":"34"}
]
