[
  {
    "id": "aoki2007",
    "abstract": "This paper proposes an analytical-cum-conceptual framework for understanding the nature of institutions as well as their changes. First, it proposes a new definition of institution based on the notion of common knowledge regarding self-sustaining features of social interactions with a hope to integrate various disciplinary approaches to institutions and their changes. Second, it specifies some generic mechanisms of institutional coherence and change – overlapping social embeddedness, Schumpeterian innovation in bundling games, and dynamic institutional complementarities – useful for understanding the dynamic interactions of economic, political, social, organizational, and cognitive factors.",
    "accessed": {
      "date-parts": [
        [
          2021,
          11,
          3
        ]
      ]
    },
    "author": [
      {
        "family": "Aoki",
        "given": "Masahiko"
      }
    ],
    "citation-key": "aoki2007",
    "container-title": "Journal of Institutional Economics",
    "DOI": "10.1017/S1744137406000531",
    "ISSN": "1744-1382, 1744-1374",
    "issue": "1",
    "issued": {
      "date-parts": [
        [
          2007,
          4
        ]
      ]
    },
    "language": "en",
    "page": "1-31",
    "publisher": "Cambridge University Press",
    "source": "Cambridge University Press",
    "title": "Endogenizing institutions and institutional changes*",
    "type": "article-journal",
    "URL": "https://www.cambridge.org/core/journals/journal-of-institutional-economics/article/abs/endogenizing-institutions-and-institutional-changes/AD5F9B9201F6AA456644417DC245B764",
    "volume": "3"
  },
  {
    "id": "aumann1974",
    "accessed": {
      "date-parts": [
        [
          2022,
          5,
          26
        ]
      ]
    },
    "author": [
      {
        "family": "Aumann",
        "given": "Robert J."
      }
    ],
    "citation-key": "aumann1974",
    "container-title": "Journal of Mathematical Economics",
    "container-title-short": "Journal of Mathematical Economics",
    "DOI": "10.1016/0304-4068(74)90037-8",
    "ISSN": "03044068",
    "issue": "1",
    "issued": {
      "date-parts": [
        [
          1974,
          3
        ]
      ]
    },
    "language": "en",
    "page": "67-96",
    "source": "DOI.org (Crossref)",
    "title": "Subjectivity and correlation in randomized strategies",
    "type": "article-journal",
    "URL": "https://linkinghub.elsevier.com/retrieve/pii/0304406874900378",
    "volume": "1"
  },
  {
    "id": "aumann1987",
    "accessed": {
      "date-parts": [
        [
          2021,
          5,
          9
        ]
      ]
    },
    "author": [
      {
        "family": "Aumann",
        "given": "Robert J."
      }
    ],
    "citation-key": "aumann1987",
    "container-title": "Econometrica",
    "container-title-short": "Econometrica",
    "DOI": "10.2307/1911154",
    "ISSN": "00129682",
    "issue": "1",
    "issued": {
      "date-parts": [
        [
          1987,
          1
        ]
      ]
    },
    "page": "1",
    "source": "DOI.org (Crossref)",
    "title": "Correlated Equilibrium as an Expression of Bayesian Rationality",
    "type": "article-journal",
    "URL": "https://www.jstor.org/stable/1911154?origin=crossref",
    "volume": "55"
  },
  {
    "id": "barsalou2013",
    "author": [
      {
        "family": "Barsalou",
        "given": "Lawrence W."
      }
    ],
    "citation-key": "barsalou2013",
    "container-title": "Cortex; a Journal Devoted to the Study of the Nervous System and Behavior",
    "container-title-short": "Cortex",
    "DOI": "10.1016/j.cortex.2013.06.010",
    "ISSN": "1973-8102",
    "issue": "10",
    "issued": {
      "literal": "2013 Nov-Dec"
    },
    "language": "eng",
    "page": "2951-2953",
    "PMID": "23911126",
    "source": "PubMed",
    "title": "Mirroring as Pattern Completion Inferences within Situated Conceptualizations",
    "type": "article-journal",
    "volume": "49"
  },
  {
    "id": "bechtel2009",
    "accessed": {
      "date-parts": [
        [
          2021,
          8,
          10
        ]
      ]
    },
    "author": [
      {
        "family": "Bechtel",
        "given": "William"
      }
    ],
    "citation-key": "bechtel2009",
    "container-title": "Philosophical Psychology",
    "container-title-short": "Philosophical Psychology",
    "DOI": "10.1080/09515080903238948",
    "ISSN": "0951-5089, 1465-394X",
    "issue": "5",
    "issued": {
      "date-parts": [
        [
          2009,
          10
        ]
      ]
    },
    "language": "en",
    "page": "543-564",
    "source": "DOI.org (Crossref)",
    "title": "Looking down, around, and up: Mechanistic explanation in psychology",
    "title-short": "Looking down, around, and up",
    "type": "article-journal",
    "URL": "http://www.tandfonline.com/doi/abs/10.1080/09515080903238948",
    "volume": "22"
  },
  {
    "id": "bicchieri2005",
    "accessed": {
      "date-parts": [
        [
          2021,
          2,
          19
        ]
      ]
    },
    "author": [
      {
        "family": "Bicchieri",
        "given": "Cristina"
      }
    ],
    "citation-key": "bicchieri2005",
    "DOI": "10.1017/CBO9780511616037",
    "event-place": "Cambridge",
    "ISBN": "978-0-511-61603-7",
    "issued": {
      "date-parts": [
        [
          2005
        ]
      ]
    },
    "language": "en",
    "publisher": "Cambridge University Press",
    "publisher-place": "Cambridge",
    "source": "DOI.org (Crossref)",
    "title": "The Grammar of Society: The Nature and Dynamics of Social Norms",
    "title-short": "The Grammar of Society",
    "type": "book",
    "URL": "http://ebooks.cambridge.org/ref/id/CBO9780511616037"
  },
  {
    "id": "bicchieri2018a",
    "abstract": "Social norms, the informal rules that govern behavior in groups andsocieties, have been extensively studied in the social sciences.Anthropologists have described how social norms function in differentcultures (Geertz 1973), sociologists have focused on their socialfunctions and how they motivate people to act (Durkheim 1895 [1982],1950 [1957]; Parsons 1937; Parsons & Shils 1951; James Coleman1990; Hechter & Opp 2001), and economists have explored howadherence to norms influences market behavior (Akerlof 1976; Young1998a). More recently, also legal scholars have touted social norms asefficient alternatives to legal rules, as they may internalizenegative externalities and provide signaling mechanisms at little orno cost (Ellickson 1991; Posner 2000)., With a few exceptions, the social science literature conceives ofnorms as exogenous variables. Since norms are mainly seen asconstraining behavior, some of the key differences between moral,social, and legal norms—as well as differences between norms andconventions—have been blurred. Much attention has instead beenpaid to the conditions under which norms will be obeyed. Because ofthat, the issue of sanctions has been paramount in the socialscience literature. Moreover, since social norms are seen as centralto the production of social order or social coordination, research onnorms has been focused on the functions they perform. Yeteven if a norm may fulfill important social functions (such as welfaremaximization or the elimination of externalities), it cannot beexplained solely on the basis of the functions it performs. Thesimplistic functionalist perspective has been rejected on severalaccounts; in fact, even though a given norm can be conceived as ameans to achieve some goal, this is usually not the reason why itemerged in the first place (Elster 1989a, 1989b). Moreover, although aparticular norm may persist (as opposed to emerge) because of somepositive social function it fulfills, there are many others that areinefficient and even widely unpopular., Philosophers have taken a different approach to norms. In theliterature on norms and conventions, both social constructs are seenas the endogenous product of individuals’ interactions (Lewis1969; Ullmann-Margalit 1977; Vandershraaf 1995; Bicchieri 2006). Normsare represented as equilibria of games of strategy, and as such theyare supported by a cluster of self-fulfilling expectations. Beliefs,expectations, group knowledge and common knowledge have thus becomecentral concepts in the development of a philosophical view of socialnorms. Paying attention to the role played by expectations insupporting social norms has helped differentiate between social norms,conventions, and descriptive norms: an important distinction oftenoverlooked in the social science accounts, but crucial when we need todiagnose the nature of a pattern of behavior in order to intervene onit.",
    "accessed": {
      "date-parts": [
        [
          2021,
          11,
          6
        ]
      ]
    },
    "author": [
      {
        "family": "Bicchieri",
        "given": "Cristina"
      },
      {
        "family": "Muldoon",
        "given": "Ryan"
      },
      {
        "family": "Sontuoso",
        "given": "Alessandro"
      }
    ],
    "citation-key": "bicchieri2018a",
    "container-title": "The Stanford Encyclopedia of Philosophy",
    "edition": "Winter 2018",
    "editor": [
      {
        "family": "Zalta",
        "given": "Edward N."
      }
    ],
    "issued": {
      "date-parts": [
        [
          2018
        ]
      ]
    },
    "publisher": "Metaphysics Research Lab, Stanford University",
    "source": "Stanford Encyclopedia of Philosophy",
    "title": "Social Norms",
    "type": "chapter",
    "URL": "https://plato.stanford.edu/archives/win2018/entries/social-norms/"
  },
  {
    "id": "craver2013",
    "abstract": "Neuroscientists investigate the mechanisms of spatial memory. Molecular biologists study the mechanisms of protein synthesis and the myriad mechanisms of gene regulation. Ecologists study nutrient cycling mechanisms and their devastating imbalances in estuaries such as the Chesapeake Bay. In fact, much of biology and its history involves biologists constructing, evaluating, and revising their understanding of mechanisms. With In Search of Mechanisms, Carl F. Craver and Lindley Darden offer both a descriptive and an instructional account of how biologists discover mechanisms. Drawing on examples from across the life sciences and through the centuries, Craver and Darden compile an impressive toolbox of strategies that biologists have used and will use again to reveal the mechanisms that produce, underlie, or maintain the phenomena characteristic of living things. They discuss the questions that figure in the search for mechanisms, characterizing the experimental, observational, and conceptual considerations used to answer them, all the while providing examples from the history of biology to highlight the kinds of evidence and reasoning strategies employed to assess mechanisms. At a deeper level, Craver and Darden pose a systematic view of what biology is, of how biology makes progress, of how biological discoveries are and might be made, and of why knowledge of biological mechanisms is important for the future of the human species.",
    "author": [
      {
        "family": "Craver",
        "given": "Carl F."
      },
      {
        "family": "Darden",
        "given": "Lindley"
      }
    ],
    "citation-key": "craver2013",
    "ISBN": "978-0-226-03982-4",
    "issued": {
      "date-parts": [
        [
          2013,
          10,
          3
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "251",
    "publisher": "University of Chicago Press",
    "source": "Google Books",
    "title": "In Search of Mechanisms: Discoveries across the Life Sciences",
    "title-short": "In Search of Mechanisms",
    "type": "book"
  },
  {
    "id": "epstein2015",
    "author": [
      {
        "family": "Epstein",
        "given": "Brian"
      }
    ],
    "call-number": "H61.15 .E67 2015",
    "citation-key": "epstein2015",
    "collection-title": "Oxford studies in philosophy of science",
    "event-place": "New York, NY",
    "ISBN": "978-0-19-938110-4",
    "issued": {
      "date-parts": [
        [
          2015
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "298",
    "publisher": "Oxford University Press",
    "publisher-place": "New York, NY",
    "source": "Library of Congress ISBN",
    "title": "The ant trap: rebuilding the foundations of the social sciences",
    "title-short": "The ant trap",
    "type": "book"
  },
  {
    "id": "epstein2018",
    "abstract": "Social ontology is the study of the nature and properties of thesocial world. It is concerned with analyzing the various entities inthe world that arise from social interaction., A prominent topic in social ontology is the analysis of social groups.Do social groups exist at all? If so, what sorts of entities are they,and how are they created? Is a social group distinct from thecollection of people who are its members, and if so, how is itdifferent? What sorts of properties do social groups have? Can theyhave beliefs or intentions? Can they perform actions? And if so, whatdoes it take for a group to believe, intend, or act?, Other entities investigated in social ontology include money,corporations, institutions, property, social classes, races, genders,artifacts, artworks, language, and law. It is difficult to delineate aprecise scope for the field (see section 2.1). In general, though, the entities explored in social ontology largelyoverlap with those that social scientists work on. A good deal of thework in social ontology takes place within the social sciences (see sections 5.1–5.8)., Social ontology also addresses more basic questions about the natureof the social world. One set of questions pertains to theconstituents, or building blocks, of social things in general. Forinstance, some theories argue that social entities are built out ofthe psychological states of individual people, while others argue thatthey are built out of actions, and yet others that they are built outof practices. Still other theories deny that a distinction can even bemade between the social and the non-social., A different set of questions pertains to how social categories areconstructed or set up. Are social categories and kinds produced by ourattitudes? By our language? Are they produced by causal patterns? Andis there just one way social categories are set up, or are there manyvarieties of social construction?, The term ‘social ontology’ has only come into widecurrency in recent years, but the nature of the social has been atopic of inquiry since ancient Greece. As a whole, the field can beunderstood as a branch of metaphysics, the general inquiry into thenature of entities.",
    "accessed": {
      "date-parts": [
        [
          2021,
          11,
          2
        ]
      ]
    },
    "author": [
      {
        "family": "Epstein",
        "given": "Brian"
      }
    ],
    "citation-key": "epstein2018",
    "container-title": "The Stanford Encyclopedia of Philosophy",
    "edition": "Summer 2018",
    "editor": [
      {
        "family": "Zalta",
        "given": "Edward N."
      }
    ],
    "issued": {
      "date-parts": [
        [
          2018
        ]
      ]
    },
    "publisher": "Metaphysics Research Lab, Stanford University",
    "source": "Stanford Encyclopedia of Philosophy",
    "title": "Social Ontology",
    "type": "chapter",
    "URL": "https://plato.stanford.edu/archives/sum2018/entries/social-ontology/"
  },
  {
    "id": "ferguson1980",
    "abstract": "A subtle critique of declining communal virtues, arguing instead for active citizenship. Copyright Â© Libri GmbH. All rights reserved.",
    "author": [
      {
        "family": "Ferguson",
        "given": "Adam"
      }
    ],
    "citation-key": "ferguson1980",
    "ISBN": "978-1-4128-1717-2",
    "issued": {
      "date-parts": [
        [
          1980,
          1,
          1
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "370",
    "publisher": "Transaction Publishers",
    "source": "Google Books",
    "title": "An Essay on the History of Civil Society, 1767",
    "type": "book"
  },
  {
    "id": "french2010",
    "abstract": "According to ‘Ontic Structural Realism’ (OSR), physical objects—qua metaphysical entities—should be reconceptualised, or, more strongly, eliminated in favour of the relevant structures. In this paper I shall attempt to articulate the relationship between these putative objects and structures in terms of certain accounts of metaphysical dependence currently available. This will allow me to articulate the differences between the different forms of OSR and to argue in favour of the ‘eliminativist’ version. A useful context is provided by Floridi’s account of the relationship between ‘ontic’ and ‘epistemic’ structural realisms and I shall conclude with some brief remarks on possible extensions of OSR into other scientiﬁc domains.",
    "accessed": {
      "date-parts": [
        [
          2021,
          2,
          20
        ]
      ]
    },
    "author": [
      {
        "family": "French",
        "given": "Steven"
      }
    ],
    "citation-key": "french2010",
    "container-title": "Synthese",
    "container-title-short": "Synthese",
    "DOI": "10.1007/s11229-010-9734-2",
    "ISSN": "0039-7857, 1573-0964",
    "issue": "S1",
    "issued": {
      "date-parts": [
        [
          2010,
          8
        ]
      ]
    },
    "language": "en",
    "page": "89-109",
    "source": "DOI.org (Crossref)",
    "title": "The interdependence of structure, objects and dependence",
    "type": "article-journal",
    "URL": "http://link.springer.com/10.1007/s11229-010-9734-2",
    "volume": "175"
  },
  {
    "id": "gilbert1992",
    "abstract": "Are social groups real in any sense that is independent of the thoughts, actions, and beliefs of the individuals making up the group? Using methods of philosophy to examine such longstanding sociological questions, Margaret Gilbert gives a general characterization of the core phenomena at issue in the domain of human social life. After developing detailed analyses of a number of central everyday concepts of social phenomena--including shared action, a social convention, a group's belief, and a group itself--she proposes that the core social phenomena among human beings are \"plural subject\" phenomena. In her analyses Gilbert discusses the work of such thinkers as Emile Durkheim, Georg Simmel, Max Weber, and David Lewis. \"Gilbert's book aims to ... exhibit some general and structural features of the conceptual scheme in terms of which we think about social groups, collective action, social convention, and shared belief.... [It] offers an important corrective to individualistic thinking in the social sciences....\"--Michael Root, Philosophical Review \"In this rich and rewarding work, Margaret Gilbert provides a novel and detailed account of our everyday concepts of social collectivity. In so doing she makes a seminal contribution to ... some vexed issues in the philosophy of social science.... [An] intellectually pioneering work.\"--John D. Greenwood, Social Epistemology",
    "author": [
      {
        "family": "Gilbert",
        "given": "Margaret"
      }
    ],
    "citation-key": "gilbert1992",
    "ISBN": "978-0-691-02080-8",
    "issued": {
      "date-parts": [
        [
          1992,
          4,
          12
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "532",
    "publisher": "Princeton University Press",
    "source": "Google Books",
    "title": "On Social Facts",
    "type": "book"
  },
  {
    "id": "gintis2007",
    "abstract": "The various behavioral disciplines model human behavior in distinct and incompatible ways. Yet, recent theoretical and empirical developments have created the conditions for rendering coherent the areas of overlap of the various behavioral disciplines. The analytical tools deployed in this task incorporate core principles from several behavioral disciplines. The proposed framework recognizes evolutionary theory, covering both genetic and cultural evolution, as the integrating principle of behavioral science. Moreover, if decision theory and game theory are broadened to encompass other-regarding preferences, they become capable of modeling all aspects of decision making, including those normally considered “psychological,” “sociological,” or “anthropological.” The mind as a decision-making organ then becomes the organizing principle of psychology.",
    "accessed": {
      "date-parts": [
        [
          2021,
          8,
          6
        ]
      ]
    },
    "author": [
      {
        "family": "Gintis",
        "given": "Herbert"
      }
    ],
    "citation-key": "gintis2007",
    "container-title": "Behavioral and Brain Sciences",
    "DOI": "10.1017/S0140525X07000581",
    "ISSN": "1469-1825, 0140-525X",
    "issue": "1",
    "issued": {
      "date-parts": [
        [
          2007,
          2
        ]
      ]
    },
    "language": "en",
    "page": "1-16",
    "publisher": "Cambridge University Press",
    "source": "Cambridge University Press",
    "title": "A framework for the unification of the behavioral sciences",
    "type": "article-journal",
    "URL": "https://www.cambridge.org/core/journals/behavioral-and-brain-sciences/article/abs/framework-for-the-unification-of-the-behavioral-sciences/BD567D3230E34716C8AFFF2ED65180B5",
    "volume": "30"
  },
  {
    "id": "gintis2013",
    "accessed": {
      "date-parts": [
        [
          2021,
          10,
          16
        ]
      ]
    },
    "author": [
      {
        "family": "Gintis",
        "given": "Herbert"
      },
      {
        "family": "Helbing",
        "given": "Dirk"
      }
    ],
    "citation-key": "gintis2013",
    "container-title": "SSRN Electronic Journal",
    "container-title-short": "SSRN Journal",
    "DOI": "10.2139/ssrn.2362262",
    "ISSN": "1556-5068",
    "issued": {
      "date-parts": [
        [
          2013
        ]
      ]
    },
    "language": "en",
    "source": "DOI.org (Crossref)",
    "title": "Homo Socialis: An Analytical Core for Sociological Theory",
    "title-short": "Homo Socialis",
    "type": "article-journal",
    "URL": "http://www.ssrn.com/abstract=2362262"
  },
  {
    "id": "glennan2017",
    "abstract": "This book argues for a new image of nature and of science—one that understands both natural and social phenomena to be the product of mechanisms, and that suggests that much of the work of natural and social scientists involves discovering, describing, and explaining how these mechanisms work. The book explores the interplay between ontological questions about mechanisms as things in the world and methodological questions about how these mechanisms can be characterized. Ontologically, mechanisms are understood to be collections of entities whose organized activities and interactions give rise to phenomena. This minimal conception of mechanism is abstract enough to encompass most of the wide variety of things that scientists have called mechanisms. While mechanisms are particular things, localized in space and time, the models that scientists use to describe them must be abstract and idealized. The mechanistic approach provides new ways of thinking about traditional metaphysical questions—for instance, about the nature of objects, part-whole and cause-effect relations, properties and universals, natural kinds, and laws of nature. It also suggests novel approaches for thinking about methodological questions concerning scientific representation, causal inference, reduction, and scientific explanation. The New Mechanical Philosophy offers the promise of a better understanding of the sources of both the unity and diversity of science.",
    "accessed": {
      "date-parts": [
        [
          2023,
          3,
          6
        ]
      ]
    },
    "author": [
      {
        "family": "Glennan",
        "given": "Stuart"
      }
    ],
    "citation-key": "glennan2017",
    "DOI": "10.1093/oso/9780198779711.001.0001",
    "ISBN": "978-0-19-877971-1",
    "issued": {
      "date-parts": [
        [
          2017,
          9,
          21
        ]
      ]
    },
    "language": "en",
    "publisher": "Oxford University Press",
    "source": "DOI.org (Crossref)",
    "title": "The New Mechanical Philosophy",
    "type": "book",
    "URL": "https://academic.oup.com/book/9835",
    "volume": "1"
  },
  {
    "id": "guala2007",
    "abstract": "Ontological debates have always been prominent in the philosophy of social science. Philosophers have typically conceived of such debates as pre-scientific attempts to reform social scientific practice, rather than as post-scientific reflections on a firm body of scientific knowledge. Two celebrated contemporary research programs in social ontology – collective intentionality and evolutionary game theory – also follow this approach. In this paper I illustrate their central elements and criticize their weak empirical foundations. I finish by reviewing some work that combines empirical evidence with theoretical reflection, and suggest that it constitutes the way forward in the philosophy of social science.",
    "accessed": {
      "date-parts": [
        [
          2021,
          10,
          6
        ]
      ]
    },
    "author": [
      {
        "family": "Guala",
        "given": "Francesco"
      }
    ],
    "citation-key": "guala2007",
    "container-title": "Philosophy Compass",
    "DOI": "10.1111/j.1747-9991.2007.00095.x",
    "ISSN": "1747-9991",
    "issue": "6",
    "issued": {
      "date-parts": [
        [
          2007
        ]
      ]
    },
    "language": "en",
    "page": "954-980",
    "source": "Wiley Online Library",
    "title": "The Philosophy of Social Science: Metaphysical and Empirical",
    "title-short": "The Philosophy of Social Science",
    "type": "article-journal",
    "URL": "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1747-9991.2007.00095.x",
    "volume": "2"
  },
  {
    "id": "guala2015",
    "abstract": "Current debates in social ontology are dominated by approaches that view institutions either as rules or as equilibria of strategic games. We argue that these two approaches can be unified within an encompassing theory based on the notion of correlated equilibrium. We show that in a correlated equilibrium each player follows a regulative rule of the form ‘if X then do Y’. We then criticize Searle's claim that constitutive rules of the form ‘X counts as Y in C’ are fundamental building blocks for institutions, showing that such rules can be derived from regulative rules by introducing new institutional terms. Institutional terms are introduced for economy of thought, but are not necessary for the creation of social reality.",
    "accessed": {
      "date-parts": [
        [
          2021,
          11,
          3
        ]
      ]
    },
    "author": [
      {
        "family": "Guala",
        "given": "Francesco"
      },
      {
        "family": "Hindriks",
        "given": "Frank"
      }
    ],
    "citation-key": "guala2015",
    "container-title": "The Philosophical Quarterly",
    "container-title-short": "The Philosophical Quarterly",
    "DOI": "10.1093/pq/pqu072",
    "ISSN": "0031-8094",
    "issue": "259",
    "issued": {
      "date-parts": [
        [
          2015,
          4,
          1
        ]
      ]
    },
    "page": "177-201",
    "source": "Silverchair",
    "title": "A UNIFIED SOCIAL ONTOLOGY",
    "type": "article-journal",
    "URL": "https://doi.org/10.1093/pq/pqu072",
    "volume": "65"
  },
  {
    "id": "guala2016",
    "author": [
      {
        "family": "Guala",
        "given": "Francesco"
      }
    ],
    "call-number": "HM826 .G815 2016",
    "citation-key": "guala2016",
    "event-place": "Princeton",
    "ISBN": "978-0-691-17178-4",
    "issued": {
      "date-parts": [
        [
          2016
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "222",
    "publisher": "Princeton University Press",
    "publisher-place": "Princeton",
    "source": "Library of Congress ISBN",
    "title": "Understanding institutions: the science and philosophy of living together",
    "title-short": "Understanding institutions",
    "type": "book"
  },
  {
    "id": "guala2020",
    "accessed": {
      "date-parts": [
        [
          2021,
          6,
          10
        ]
      ]
    },
    "author": [
      {
        "family": "Guala",
        "given": "Francesco"
      }
    ],
    "citation-key": "guala2020",
    "container-title": "Minimal Cooperation and Shared Agency",
    "DOI": "10.1007/978-3-030-29783-1_9",
    "editor": [
      {
        "family": "Fiebich",
        "given": "Anika"
      }
    ],
    "event-place": "Cham",
    "ISBN": "978-3-030-29782-4 978-3-030-29783-1",
    "issued": {
      "date-parts": [
        [
          2020
        ]
      ]
    },
    "language": "en",
    "page": "149-168",
    "publisher": "Springer International Publishing",
    "publisher-place": "Cham",
    "source": "DOI.org (Crossref)",
    "title": "Solving the Hi-lo Paradox: Equilibria, Beliefs, and Coordination",
    "title-short": "Solving the Hi-lo Paradox",
    "type": "chapter",
    "URL": "http://link.springer.com/10.1007/978-3-030-29783-1_9",
    "volume": "11"
  },
  {
    "id": "harms2004",
    "abstract": "This book is intended to help transform epistemology - the traditional study of knowledge - into a rigorous discipline by removing conceptual roadblocks and developing formal tools required for a fully naturalized epistemology. The evolutionary approach which Harms favours begins with the common observation that if our senses and reasoning were not reliable, then natural selection would have eliminated them long ago. The challenge for some time has been how to transform these informal musings about evolutionary epistemology into a rigorous theoretical discipline capable of complementing current scientific studies of the evolution of cognition with a philosophically defensible account of meaning and justification.",
    "author": [
      {
        "family": "Harms",
        "given": "William F."
      }
    ],
    "citation-key": "harms2004",
    "ISBN": "978-1-139-45162-8",
    "issued": {
      "date-parts": [
        [
          2004,
          4,
          26
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "282",
    "publisher": "Cambridge University Press",
    "source": "Google Books",
    "title": "Information and Meaning in Evolutionary Processes",
    "type": "book"
  },
  {
    "id": "hawley2018",
    "abstract": "If we are sympathetic to the project of naturalising metaphysics, how should we approach the metaphysics of the social world? What role can the social sciences play in metaphysical investigation? In the light of these questions, this paper examines three possible approaches to social metaphysics: inference to the best explanation from current social science, conceptual analysis, and Haslanger-inspired ameliorative projects.",
    "accessed": {
      "date-parts": [
        [
          2021,
          2,
          19
        ]
      ]
    },
    "author": [
      {
        "family": "Hawley",
        "given": "Katherine"
      }
    ],
    "citation-key": "hawley2018",
    "container-title": "Journal for General Philosophy of Science",
    "container-title-short": "J Gen Philos Sci",
    "DOI": "10.1007/s10838-017-9389-5",
    "ISSN": "0925-4560, 1572-8587",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          2018,
          6
        ]
      ]
    },
    "language": "en",
    "page": "187-198",
    "source": "DOI.org (Crossref)",
    "title": "Social Science as a Guide to Social Metaphysics?",
    "type": "article-journal",
    "URL": "http://link.springer.com/10.1007/s10838-017-9389-5",
    "volume": "49"
  },
  {
    "id": "hindriks2005",
    "author": [
      {
        "family": "Hindriks",
        "given": "Frank"
      }
    ],
    "citation-key": "hindriks2005",
    "event-place": "Alblasserdam",
    "ISBN": "978-90-90-19461-5",
    "issued": {
      "date-parts": [
        [
          2005
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "183",
    "publisher": "Haveka BV",
    "publisher-place": "Alblasserdam",
    "source": "K10plus ISBN",
    "title": "Rules & institutions: essays on meaning, speech acts and social ontology: essays over betekenis, taalhandelingen en sociale ontologie = Regels & instituties",
    "title-short": "Rules & institutions",
    "type": "book"
  },
  {
    "id": "hindriks2015",
    "abstract": "We propose a new framework to unify three conceptions of institutions that play a prominent role in the philosophical and scientific literature: the equilibria account, the regulative rules account, and the constitutive rules account. We argue that equilibrium-based and rule-based accounts are individually inadequate, but that jointly they provide a satisfactory conception of institutions as rules-in-equilibrium. In the second part of the paper we show that constitutive rules can be derived from regulative rules via the introduction of theoretical terms. We argue that the constitutive rules theory is reducible to the rules-in equilibrium theory, and that it accounts for the way in which we assign names to social institutions.",
    "accessed": {
      "date-parts": [
        [
          2021,
          10,
          28
        ]
      ]
    },
    "author": [
      {
        "family": "Hindriks",
        "given": "Frank"
      },
      {
        "family": "Guala",
        "given": "Francesco"
      }
    ],
    "citation-key": "hindriks2015",
    "container-title": "Journal of Institutional Economics",
    "DOI": "10.1017/S1744137414000496",
    "ISSN": "1744-1374, 1744-1382",
    "issue": "3",
    "issued": {
      "date-parts": [
        [
          2015,
          9
        ]
      ]
    },
    "language": "en",
    "page": "459-480",
    "publisher": "Cambridge University Press",
    "source": "Cambridge University Press",
    "title": "Institutions, rules, and equilibria: a unified theory*",
    "title-short": "Institutions, rules, and equilibria",
    "type": "article-journal",
    "URL": "https://www.cambridge.org/core/journals/journal-of-institutional-economics/article/institutions-rules-and-equilibria-a-unified-theory/CD04E89BC01304500EFF2B7845E17BD7",
    "volume": "11"
  },
  {
    "id": "hobbes2016",
    "accessed": {
      "date-parts": [
        [
          2021,
          7,
          23
        ]
      ]
    },
    "author": [
      {
        "family": "Hobbes",
        "given": "Thomas"
      }
    ],
    "citation-key": "hobbes2016",
    "DOI": "10.4324/9781315507613",
    "edition": "0",
    "editor": [
      {
        "family": "Missner",
        "given": "Marshall"
      }
    ],
    "ISBN": "978-1-315-50760-6",
    "issued": {
      "date-parts": [
        [
          2016,
          5,
          23
        ]
      ]
    },
    "language": "en",
    "publisher": "Routledge",
    "source": "DOI.org (Crossref)",
    "title": "Thomas Hobbes: Leviathan (Longman Library of Primary Sources in Philosophy)",
    "title-short": "Thomas Hobbes",
    "type": "book",
    "URL": "https://www.taylorfrancis.com/books/9781315507606"
  },
  {
    "id": "hume2003",
    "abstract": "Unpopular in its day, David Hume's sprawling, three-volume 'A Treatise of Human Nature' (1739-40) has withstood the test of time and had enormous impact on subsequent philosophical thought. Hume's comprehensive effort to form an observationally grounded study of human nature employs John Locke's empiric principles to construct a theory of knowledge from which to evaluate metaphysical ideas. A key to modern studies of eighteenth-century Western philosophy, the Treatise considers numerous classic philosophical issues, including causation, existence, freedom and necessity, and morality. Unabridged republication of the edition originally published by Oxford at the Clarendon Press, London, 1888.",
    "author": [
      {
        "family": "Hume",
        "given": "David"
      }
    ],
    "citation-key": "hume2003",
    "ISBN": "978-0-486-43250-2",
    "issued": {
      "date-parts": [
        [
          2003,
          1,
          1
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "484",
    "publisher": "Courier Corporation",
    "source": "Google Books",
    "title": "A Treatise of Human Nature",
    "type": "book"
  },
  {
    "id": "huneman2018",
    "abstract": "This paper argues that in some explanations mathematics are playing an explanatory rather than a representational role, and that this feature unifies many types of non-causal or non-mechanistic explanations that some philosophers of science have been recently exploring under various names (mathematical, topological, etc.). After showing how mathematics can play either a representational or an explanatory role by considering two alternative explanations of a same biological pattern—“Bergmann’s rule”—I offer an example of an explanation where the bulk of the explanatory job is done by a mathematical theorem, and where mechanisms involved in the target systems are not explanatorily relevant. Then I account for the way mathematical properties may function in an explanatory way within an explanation by arguing that some mathematical propositions involving variables non directly referring to the target system features constitute constraints to which a whole class of systems should comply, provided they are describable by a mathematical object concerned by those propositions. According to such “constraint account”, those mathematical facts are directly entailing the explanandum (often a limit regime, a robustness property or a steady state), as a consequence of such constraints. I call those explanations “structural”, because here properties of mathematical structures are accounting for the explanandum; various kinds of mathematical structures (algebraic, graph-theoretical, etc.) thereby define various types of structural explanations.",
    "accessed": {
      "date-parts": [
        [
          2021,
          11,
          21
        ]
      ]
    },
    "author": [
      {
        "family": "Huneman",
        "given": "Philippe"
      }
    ],
    "citation-key": "huneman2018",
    "container-title": "Philosophical Studies",
    "container-title-short": "Philos Stud",
    "DOI": "10.1007/s11098-017-0887-4",
    "ISSN": "1573-0883",
    "issue": "3",
    "issued": {
      "date-parts": [
        [
          2018,
          3,
          1
        ]
      ]
    },
    "language": "en",
    "page": "665-702",
    "source": "Springer Link",
    "title": "Outlines of a theory of structural explanations",
    "type": "article-journal",
    "URL": "https://doi.org/10.1007/s11098-017-0887-4",
    "volume": "175"
  },
  {
    "id": "huttegger2007",
    "abstract": "Recently there has been some interest in studying the explanation of meaning by using signaling games. I shall argue that the meaning of signals in signaling games remains suﬃciently unclear to motivate further investigation. In particular, the possibility of distinguishing imperatives and indicatives at a fundamental level will be explored. Thereby I am trying to preserve the generality of the signaling games framework while bringing it closer to human languages. A number of convergence results for the evolutionary dynamics of our models will be proved.",
    "accessed": {
      "date-parts": [
        [
          2021,
          2,
          19
        ]
      ]
    },
    "author": [
      {
        "family": "Huttegger",
        "given": "Simon M."
      }
    ],
    "citation-key": "huttegger2007",
    "container-title": "Erkenntnis",
    "container-title-short": "Erkenntnis",
    "DOI": "10.1007/s10670-006-9022-1",
    "ISSN": "0165-0106, 1572-8420",
    "issue": "3",
    "issued": {
      "date-parts": [
        [
          2007,
          4,
          17
        ]
      ]
    },
    "language": "en",
    "page": "409-436",
    "source": "DOI.org (Crossref)",
    "title": "Evolutionary Explanations of Indicatives and Imperatives",
    "type": "article-journal",
    "URL": "http://link.springer.com/10.1007/s10670-006-9022-1",
    "volume": "66"
  },
  {
    "id": "kaidesoja2019",
    "accessed": {
      "date-parts": [
        [
          2021,
          7,
          27
        ]
      ]
    },
    "author": [
      {
        "family": "Kaidesoja",
        "given": "Tuukka"
      },
      {
        "family": "Sarkia",
        "given": "Matti"
      },
      {
        "family": "Hyyryläinen",
        "given": "Mikko"
      }
    ],
    "citation-key": "kaidesoja2019",
    "container-title": "Journal for the Theory of Social Behaviour",
    "container-title-short": "J Theory Soc Behav",
    "DOI": "10.1111/jtsb.12226",
    "ISSN": "0021-8308, 1468-5914",
    "issue": "4",
    "issued": {
      "date-parts": [
        [
          2019,
          12
        ]
      ]
    },
    "language": "en",
    "page": "480-498",
    "source": "DOI.org (Crossref)",
    "title": "Arguments for the cognitive social sciences",
    "type": "article-journal",
    "URL": "https://onlinelibrary.wiley.com/doi/10.1111/jtsb.12226",
    "volume": "49"
  },
  {
    "id": "kincaid2008",
    "abstract": "After sorting different structuralist claims, I argue that structural realist ideas are instantiated in the social sciences, providing both clarification of social science research and support for some components of structural realism. My main focus is on three distinct ways that the social sciences can be about structural relations—exemplified by claims about social structure, reduced form structures in causal modeling, and equilibrium explanations—and on the implication of structuralist ideas for thinking about issues concerning causal explanation and nonreductive pictures of the unity of the science.",
    "accessed": {
      "date-parts": [
        [
          2022,
          2,
          21
        ]
      ]
    },
    "author": [
      {
        "family": "Kincaid",
        "given": "Harold"
      }
    ],
    "citation-key": "kincaid2008",
    "container-title": "Philosophy of Science",
    "DOI": "10.1086/594517",
    "ISSN": "0031-8248, 1539-767X",
    "issue": "5",
    "issued": {
      "date-parts": [
        [
          2008,
          12
        ]
      ]
    },
    "language": "en",
    "page": "720-731",
    "publisher": "Cambridge University Press",
    "source": "Cambridge University Press",
    "title": "Structural Realism and the Social Sciences",
    "type": "article-journal",
    "URL": "https://www.cambridge.org/core/journals/philosophy-of-science/article/abs/structural-realism-and-the-social-sciences/CB2B4C02C343A114181B7E8862E800D3",
    "volume": "75"
  },
  {
    "id": "knoblich2011",
    "accessed": {
      "date-parts": [
        [
          2021,
          10,
          25
        ]
      ]
    },
    "author": [
      {
        "family": "Knoblich",
        "given": "Günther"
      },
      {
        "family": "Butterfill",
        "given": "Stephen"
      },
      {
        "family": "Sebanz",
        "given": "Natalie"
      }
    ],
    "citation-key": "knoblich2011",
    "container-title": "Psychology of Learning and Motivation",
    "DOI": "10.1016/B978-0-12-385527-5.00003-6",
    "ISBN": "978-0-12-385527-5",
    "issued": {
      "date-parts": [
        [
          2011
        ]
      ]
    },
    "language": "en",
    "page": "59-101",
    "publisher": "Elsevier",
    "source": "DOI.org (Crossref)",
    "title": "Psychological Research on Joint Action",
    "type": "chapter",
    "URL": "https://linkinghub.elsevier.com/retrieve/pii/B9780123855275000036",
    "volume": "54"
  },
  {
    "id": "kuhn2009",
    "author": [
      {
        "family": "Kuhn",
        "given": "Thomas S."
      }
    ],
    "citation-key": "kuhn2009",
    "edition": "3. ed., [Nachdr.]",
    "event-place": "Chicago",
    "ISBN": "978-0-226-45807-6 978-0-226-45808-3",
    "issued": {
      "date-parts": [
        [
          2009
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "212",
    "publisher": "Univ. of Chicago Press",
    "publisher-place": "Chicago",
    "source": "K10plus ISBN",
    "title": "The structure of scientific revolutions",
    "type": "book"
  },
  {
    "id": "lewis2008",
    "abstract": "Convention was immediately recognized as a major contribution to the subject and its significance has remained undiminished since its first publication in 1969. Lewis analyzes social conventions as regularities in the resolution of recurring coordination problems-situations characterized by interdependent decision processes in which common interests are at stake. Conventions are contrasted with other kinds of regularity, and conventions governing systems of communication are given special attention.",
    "author": [
      {
        "family": "Lewis",
        "given": "David"
      }
    ],
    "citation-key": "lewis2008",
    "ISBN": "978-0-470-69296-7",
    "issued": {
      "date-parts": [
        [
          1969,
          4,
          15
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "229",
    "publisher": "John Wiley & Sons",
    "source": "Google Books",
    "title": "Convention: A Philosophical Study",
    "title-short": "Convention",
    "type": "book"
  },
  {
    "id": "north1990",
    "author": [
      {
        "family": "North",
        "given": "Douglas"
      }
    ],
    "citation-key": "north1990",
    "issued": {
      "date-parts": [
        [
          1990
        ]
      ]
    },
    "publisher": "Cambridge: Cambridge University Press.",
    "title": "Institutions, Institutional Change and Economic Performance",
    "type": "book"
  },
  {
    "id": "oconnor2019",
    "author": [
      {
        "family": "O'Connor",
        "given": "Cailin"
      }
    ],
    "call-number": "HM821 .O654 2019",
    "citation-key": "oconnor2019",
    "edition": "First edition",
    "event-place": "Oxford ; New York, NY",
    "ISBN": "978-0-19-878997-0",
    "issued": {
      "date-parts": [
        [
          2019
        ]
      ]
    },
    "language": "en",
    "note": "OCLC: on1082315381",
    "number-of-pages": "240",
    "publisher": "Oxford University Press",
    "publisher-place": "Oxford ; New York, NY",
    "source": "Library of Congress ISBN",
    "title": "The Origins of Unfairness: Social Categories and Cultural Evolution",
    "title-short": "The Origins of Unfairness",
    "type": "book"
  },
  {
    "id": "parsons1937",
    "author": [
      {
        "family": "Parsons",
        "given": "Talcott"
      }
    ],
    "citation-key": "parsons1937",
    "event-place": "Glencoe, Illinois",
    "issued": {
      "date-parts": [
        [
          1937
        ]
      ]
    },
    "publisher": "The Free Press",
    "publisher-place": "Glencoe, Illinois",
    "title": "The Structure of Social Action",
    "type": "book"
  },
  {
    "id": "parsons2015",
    "accessed": {
      "date-parts": [
        [
          2021,
          11,
          3
        ]
      ]
    },
    "archive_location": "world",
    "author": [
      {
        "family": "Parsons",
        "given": "Talcott"
      }
    ],
    "citation-key": "parsons2015",
    "container-title": "The International Journal of Ethics",
    "DOI": "10.1086/intejethi.45.3.2378271",
    "ISSN": "1526-422X",
    "issued": {
      "date-parts": [
        [
          2015,
          9,
          29
        ]
      ]
    },
    "language": "en",
    "publisher": "University of Chicago Press",
    "source": "www.journals.uchicago.edu",
    "title": "The Place of Ultimate Values in Sociological Theory",
    "type": "article-journal",
    "URL": "https://www.journals.uchicago.edu/doi/abs/10.1086/intejethi.45.3.2378271"
  },
  {
    "id": "pufendorf1673",
    "abstract": "Vol. I. A Phographic Reproduction of the Ed. of 1682 . Vol.II. A Translation of the Text, by Frank Gardner Moore",
    "accessed": {
      "date-parts": [
        [
          2022,
          5,
          25
        ]
      ]
    },
    "author": [
      {
        "family": "Pufendorf",
        "given": "Samuel"
      }
    ],
    "citation-key": "pufendorf1673",
    "issued": {
      "date-parts": [
        [
          1673
        ]
      ]
    },
    "language": "fr",
    "publisher": "Lund: Junghans",
    "title": "De Officio Hominis et civis juxta legem naturalem libri duo",
    "type": "book",
    "URL": "https://catalogue-bu.u-bourgogne.fr/discovery/fulldisplay/alma991001697579706659/33UB_INST:33UB_INST"
  },
  {
    "id": "sarkia2020",
    "abstract": "Discussions of the relations between the social sciences and the cognitive sciences have proliferated in recent years. Our article contributes to the philosophical and methodological foundations of the cognitive social sciences by proposing a framework based on contemporary mechanistic approaches to the philosophy of science to analyze the epistemological, ontological and methodological aspects of research programs at the intersection of the social sciences and the cognitive sciences. We apply this framework to three case studies which address the phenomena of social coordination, transactive memory, and ethnicity. We also assess how successful these research programs have been in providing mechanistic explanations for these phenomena, and where more work remains to be done.",
    "accessed": {
      "date-parts": [
        [
          2021,
          8,
          10
        ]
      ]
    },
    "author": [
      {
        "family": "Sarkia",
        "given": "Matti"
      },
      {
        "family": "Kaidesoja",
        "given": "Tuukka"
      },
      {
        "family": "Hyyryläinen",
        "given": "Mikko"
      }
    ],
    "citation-key": "sarkia2020",
    "container-title": "Social Science Information",
    "container-title-short": "Social Science Information",
    "DOI": "10.1177/0539018420968742",
    "ISSN": "0539-0184",
    "issue": "4",
    "issued": {
      "date-parts": [
        [
          2020,
          12,
          1
        ]
      ]
    },
    "language": "en",
    "page": "580-603",
    "publisher": "SAGE Publications Ltd",
    "source": "SAGE Journals",
    "title": "Mechanistic explanations in the cognitive social sciences: Lessons from three case studies",
    "title-short": "Mechanistic explanations in the cognitive social sciences",
    "type": "article-journal",
    "URL": "https://doi.org/10.1177/0539018420968742",
    "volume": "59"
  },
  {
    "id": "searle1995",
    "abstract": "'John Searle has a distinctive intellectual style. It combines razor-sharp analysis with a swaggering chip-on-the-shoulder impudence that many of his opponents might find intolerably abrasive were it not for the good humour that pervades all he writes. This is a man who likes a good philosophical brawl.'New Scientist",
    "author": [
      {
        "family": "Searle",
        "given": "John"
      }
    ],
    "citation-key": "searle1995",
    "ISBN": "978-0-02-928045-4",
    "issued": {
      "date-parts": [
        [
          1995
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "266",
    "publisher": "Simon and Schuster",
    "source": "Google Books",
    "title": "The Construction of Social Reality",
    "type": "book"
  },
  {
    "id": "searle2010",
    "abstract": "There are few more important philosophers at work today than John Searle, a creative and contentious thinker who has shaped the way we think about mind and language. Now he offers a profound understanding of how we create a social reality--a reality of money, property, governments, marriages, stock markets and cocktail parties. The paradox he addresses in Making the Social World is that these facts only exist because we think they exist and yet they have an objective existence. Continuing a line of investigation begun in his earlier book The Construction of Social Reality, Searle identifies the precise role of language in the creation of all \"institutional facts.\" His aim is to show how mind, language and civilization are natural products of the basic facts of the physical world described by physics, chemistry and biology. Searle explains how a single linguistic operation, repeated over and over, is used to create and maintain the elaborate structures of human social institutions. These institutions serve to create and distribute power relations that are pervasive and often invisible. These power relations motivate human actions in a way that provides the glue that holds human civilization together. Searle then applies the account to show how it relates to human rationality, the freedom of the will, the nature of political power and the existence of universal human rights. In the course of his explication, he asks whether robots can have institutions, why the threat of force so often lies behind institutions, and he denies that there can be such a thing as a \"state of nature\" for language-using human beings.",
    "author": [
      {
        "family": "Searle",
        "given": "John"
      }
    ],
    "citation-key": "searle2010",
    "ISBN": "978-0-19-974586-9",
    "issued": {
      "date-parts": [
        [
          2010,
          1,
          12
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "358",
    "publisher": "Oxford University Press",
    "source": "Google Books",
    "title": "Making the Social World: The Structure of Human Civilization",
    "title-short": "Making the Social World",
    "type": "book"
  },
  {
    "id": "sebanz2021",
    "abstract": "Humans have a striking ability to coordinate their actions with each other to achieve joint goals. The tight interpersonal coordination that characterizes joint actions is achieved through processes that help with preparing for joint action as well as processes that are active while joint actions are being performed. To prepare for joint action, partners form representations of each other’s actions and tasks and the relation between them. This enables them to predict each other’s upcoming actions, which, in turn, facilitates coordination. While performing joint actions, partners’ coordination is maintained by (a) monitoring whether individual and joint outcomes correspond to what was planned, (b) predicting partners’ action parameters on the basis of familiarity with their individual actions, (c) communicating task-relevant information unknown to partners in an action-based fashion, and (d) relying on coupling of predictions through dense perceptual-information flow between coactors. The next challenge for the field of joint action is to generate an integrated perspective that links coordination mechanisms to normative, evolutionary, and communicative frameworks.",
    "accessed": {
      "date-parts": [
        [
          2021,
          9,
          25
        ]
      ]
    },
    "author": [
      {
        "family": "Sebanz",
        "given": "Natalie"
      },
      {
        "family": "Knoblich",
        "given": "Günther"
      }
    ],
    "citation-key": "sebanz2021",
    "container-title": "Current Directions in Psychological Science",
    "container-title-short": "Curr Dir Psychol Sci",
    "DOI": "10.1177/0963721420984425",
    "ISSN": "0963-7214",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          2021,
          4,
          1
        ]
      ]
    },
    "language": "en",
    "page": "138-143",
    "publisher": "SAGE Publications Inc",
    "source": "SAGE Journals",
    "title": "Progress in Joint-Action Research",
    "type": "article-journal",
    "URL": "https://doi.org/10.1177/0963721420984425",
    "volume": "30"
  },
  {
    "id": "skyrms2010",
    "author": [
      {
        "family": "Skyrms",
        "given": "Brian"
      }
    ],
    "call-number": "P99 .S549 2010",
    "citation-key": "skyrms2010",
    "event-place": "Oxford ; New York",
    "ISBN": "978-0-19-958082-8 978-0-19-958294-5",
    "issued": {
      "date-parts": [
        [
          2010
        ]
      ]
    },
    "language": "en",
    "note": "OCLC: ocn477256653",
    "number-of-pages": "199",
    "publisher": "Oxford University Press",
    "publisher-place": "Oxford ; New York",
    "source": "Library of Congress ISBN",
    "title": "Signals: evolution, learning, & information",
    "title-short": "Signals",
    "type": "book"
  },
  {
    "id": "sober1983",
    "accessed": {
      "date-parts": [
        [
          2021,
          10,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Sober",
        "given": "Elliott"
      }
    ],
    "citation-key": "sober1983",
    "container-title": "Philosophical Studies",
    "container-title-short": "Philos Stud",
    "DOI": "10.1007/BF00372383",
    "ISSN": "1573-0883",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          1983,
          3,
          1
        ]
      ]
    },
    "language": "en",
    "page": "201-210",
    "source": "Springer Link",
    "title": "Equilibrium explanation",
    "type": "article-journal",
    "URL": "https://doi.org/10.1007/BF00372383",
    "volume": "43"
  },
  {
    "id": "sperber2011",
    "accessed": {
      "date-parts": [
        [
          2021,
          7,
          27
        ]
      ]
    },
    "author": [
      {
        "family": "Sperber",
        "given": "Dan"
      }
    ],
    "citation-key": "sperber2011",
    "container-title": "Analytical Sociology and Social Mechanisms",
    "DOI": "10.1017/CBO9780511921315.004",
    "editor": [
      {
        "family": "Demeulenaere",
        "given": "Pierre"
      }
    ],
    "event-place": "Cambridge",
    "ISBN": "978-0-511-92131-5",
    "issued": {
      "date-parts": [
        [
          2011
        ]
      ]
    },
    "language": "en",
    "page": "64-77",
    "publisher": "Cambridge University Press",
    "publisher-place": "Cambridge",
    "source": "DOI.org (Crossref)",
    "title": "A naturalistic ontology for mechanistic explanations in the social sciences",
    "type": "chapter",
    "URL": "https://www.cambridge.org/core/product/identifier/CBO9780511921315A012/type/book_part"
  },
  {
    "id": "sperry-taylor2021",
    "abstract": "Equilibrium explanations use an equilibrium to represent and explain a system’s dynamic behavior. They provide a system with the property of global stability: a system will converge towards and remain in equilibrium regardless of its initial conditions and dynamic process. Thus, equilibrium explanations are generally treated as non-causal explanations. There are two claims subsumed under that comprehensive thesis. The first claim is that equilibrium explanations do not identify any causes because a system with global stability resists manipulation. The second claim is that even if equilibrium explanations do identify causes by manipulation, those causes are embedded in a system’s deeper, underlying structural relationships, and those causes are irrelevant to explaining a system’s behavior. Only the system’s structural relationships are relevant. But equilibrium explanations are not monolithic. I compare dynamic systems with multiple, competing equilibria to systems with a globally stable equilibrium. Equilibrium explanations of the former use intervention on a system’s initial conditions and dynamic process to manipulate equilibria, which identifies causes. Furthermore, a system’s initial conditions and dynamic process are relevant to explaining why one equilibrium is selected instead of another. I then apply these lessons to systems with a globally stable equilibrium and discuss when their corresponding equilibrium explanations have a proper role in the parent sciences.",
    "accessed": {
      "date-parts": [
        [
          2022,
          5,
          26
        ]
      ]
    },
    "author": [
      {
        "family": "Sperry-Taylor",
        "given": "Ashton T."
      }
    ],
    "citation-key": "sperry-taylor2021",
    "container-title": "Synthese",
    "container-title-short": "Synthese",
    "DOI": "10.1007/s11229-019-02423-2",
    "ISSN": "1573-0964",
    "issue": "6",
    "issued": {
      "date-parts": [
        [
          2021,
          6,
          1
        ]
      ]
    },
    "language": "en",
    "page": "5577-5598",
    "source": "Springer Link",
    "title": "Reassessing equilibrium explanations: When are they causal explanations?",
    "title-short": "Reassessing equilibrium explanations",
    "type": "article-journal",
    "URL": "https://doi.org/10.1007/s11229-019-02423-2",
    "volume": "198"
  },
  {
    "id": "sterelny2003",
    "author": [
      {
        "family": "Sterelny",
        "given": "Kim"
      }
    ],
    "call-number": "BF698.95 .S74 2003",
    "citation-key": "sterelny2003",
    "event-place": "Malden, MA",
    "ISBN": "978-0-631-18886-5 978-0-631-18887-2",
    "issued": {
      "date-parts": [
        [
          2003
        ]
      ]
    },
    "number-of-pages": "262",
    "publisher": "Blackwell",
    "publisher-place": "Malden, MA",
    "source": "Library of Congress ISBN",
    "title": "Thought in a hostile world: the evolution of human cognition",
    "title-short": "Thought in a hostile world",
    "type": "book"
  },
  {
    "id": "suarez2019",
    "abstract": "Philippe Huneman ha cuestionado recientemente los límites en la aplicación de los modelos mecanicistas de la explicación científica en base a la existencia de lo que denomina \"explicaciones estructurales\", en las que el fenómeno se explica en virtud de las propiedades matemáticas del sistema en que el fenómeno ocurre. Las explicaciones estructurales pueden darse en formas muy diversas: en virtud de la forma de pajarita (bowtie) de la estructura, de las propiedades topológicas del sistema, de los equilibrios alcanzados, etc. El papel que juegan las matemáticas en las explicaciones que apelan a la estructura de pajarita o a las propiedades topológicas del sistema ha sido recientemente examinado en varios trabajos. Sin embargo, el papel exacto que juegan las matemáticas en el caso de las explicaciones en términos de equilibrio aún no ha sido totalmente clarificado, y diferentes autores defienden interpretaciones contradictorias, algunas de las cuales las asemejarían más al modelo defendido por algunos filósofos mecanicistas que al modelo estructural de Huneman. En este trabajo, tratamos de cubrir ese déficit estudiando el papel que juegan las matemáticas en el modelo de equilibrio anidado (nested equilibrium) elaborado por Blaser y Kirchner para explicar la estabilidad de las asociaciones ontogenética y filogenéticamente persistentes entre humanos y microorganismos. De nuestro análisis se desprende que su modelo es explicativo porque i) se identifica una estructura matemática del sistema que viene dada por un conjunto de ecuaciones diferenciales que satisfacen una estrategia evolutivamente estable; ii) la estructura anidada del modelo hace que la estrategia evolutivamente estable sea robusta ante posibles perturbaciones; iii) esto es así porque las propiedades del sistema empírico son isomorfas a, pero no causalmente responsables de, las propiedades de la estrategia evolutivamente estable. La combinación de estas tres tesis hace que las explicaciones en términos de equilibrios se asemejen más al modelo estructural de explicación que al modelo mecanístico. Philippe Huneman has recently questioned the widespread application of mechanistic models of scientific explanation based on the existence of structural explanations, i.e. explanations that account for the phenomenon to be explained in virtue of the mathematical properties of the system where the phenomenon obtains, rather than in terms of the mechanisms that causally produce the phenomenon. Structural explanations are very diverse, including cases like explanations in terms of bowtie structures, in terms of the topological properties of the system, or in terms of equilibrium. The role of mathematics in bowtie structured systems and in topologically constrained systems has recently been examined in different papers. However, the specific role that mathematical properties play in equilibrium explanations requires further examination, as different authors defend different interpretations, some of them closer to the new-mechanistic approach than to the structural model advocated by Huneman. In this paper, we cover this gap by investigating the explanatory role that mathematics play in Blaser and Kirschner's nested equilibrium model of the stability of persistent long-term human-microbe associations. We argue that their model is explanatory because: i) it provides a mathematical structure in the form of a set of differential equations that together satisfy an ESS; ii) that the nested nature of the ESSs makes the explanation of host-microbe persistent associations robust to any perturbation; iii) that this is so because the properties of the ESS directly mirror the properties of the biological system in a non-causal way. The combination of these three theses make equilibrium explanations look more similar to structural explanations than to causal-mechanistic explanation.",
    "accessed": {
      "date-parts": [
        [
          2022,
          5,
          29
        ]
      ]
    },
    "author": [
      {
        "family": "Suárez",
        "given": "Javier"
      },
      {
        "family": "Deulofeu",
        "given": "Roger"
      }
    ],
    "citation-key": "suarez2019",
    "container-title": "Teorema: Revista Internacional de Filosofía",
    "ISSN": "0210-1602",
    "issue": "3",
    "issued": {
      "date-parts": [
        [
          2019
        ]
      ]
    },
    "page": "95-120",
    "publisher": "[KRK Ediciones, SL, Luis Manuel Valdés-Villanueva]",
    "source": "JSTOR",
    "title": "Equilibrium Explanation as Structural Non-Mechanistic Explanations: The Case of Long-Term Bacterial Persistence in Human Hosts",
    "title-short": "Equilibrium Explanation as Structural Non-Mechanistic Explanations",
    "type": "article-journal",
    "URL": "https://www.jstor.org/stable/26874514",
    "volume": "38"
  },
  {
    "id": "torok2019",
    "abstract": "When people perform simple actions, they often behave efficiently, minimizing the costs of movement for the expected benefit. The present study addressed the question of whether this efficiency scales up to dyads working together to achieve a shared goal: Do people act efficiently as a group (i.e., coefficiently), or do they minimize their own or their partner’s individual costs even if this increases the overall cost for the group? We devised a novel, touch-screen-based, sequential object-transfer task to measure how people choose between different paths to coordinate with a partner. Across multiple experiments, we found that participants did not simply minimize their own or their partner’s movement costs but made coefficient decisions about paths, which ensured that the aggregate costs of movement for the dyad were minimized. These results suggest that people are able and motivated to make coefficient, collectively rational decisions when acting together.",
    "accessed": {
      "date-parts": [
        [
          2021,
          10,
          27
        ]
      ]
    },
    "author": [
      {
        "family": "Török",
        "given": "Georgina"
      },
      {
        "family": "Pomiechowska",
        "given": "Barbara"
      },
      {
        "family": "Csibra",
        "given": "Gergely"
      },
      {
        "family": "Sebanz",
        "given": "Natalie"
      }
    ],
    "citation-key": "torok2019",
    "container-title": "Psychological Science",
    "container-title-short": "Psychol Sci",
    "DOI": "10.1177/0956797619842550",
    "ISSN": "0956-7976",
    "issue": "6",
    "issued": {
      "date-parts": [
        [
          2019,
          6,
          1
        ]
      ]
    },
    "language": "en",
    "page": "930-941",
    "publisher": "SAGE Publications Inc",
    "source": "SAGE Journals",
    "title": "Rationality in Joint Action: Maximizing Coefficiency in Coordination",
    "title-short": "Rationality in Joint Action",
    "type": "article-journal",
    "URL": "https://doi.org/10.1177/0956797619842550",
    "volume": "30"
  },
  {
    "id": "tuomela2013",
    "abstract": "Social ontology, in its broadest sense, is the study of the nature of social reality, including collective intentions and agency. The starting point of Tuomela's account of collective intentionality is the distinction between thinking and acting as a private person (\"I-mode\") versus as a \"we-thinking\" group member (\"we-mode\"). The we-mode approach is based on social groups consisting of persons, which may range from simple task groups consisting of a few persons to corporations and even to political states. Tuomela extends the we-mode notion to cover groups controlled by external authority. Thus, for instance, cooperation and attitude formation are studied in cases where the participants are governed \"from above\" as in many corporations. The volume goes on to present a systematic philosophical theory related to the collectivism-versus-individualism debate in the social sciences. A weak version of collectivism (the \"we-mode\" approach) depends on group-based collective intentionality. We-mode collective intentionality is not individualistically reducible and is needed to complement individualistic accounts in social scientific theorizing. The we-mode approach is used in the book to account for collective intention and action, cooperation, group attitudes, and social practices and institutions, as well as group solidarity. Tuomela establishes the first complete theory of group reasons (in the sense of members' reasons for participation in group activities). The book argues in terms of game-theoretical group-reasoning that the kind of weak collectivism that the we-mode approach involves is both conceptually and rational-functionally different from what an individualistic approach (\"pro-group I-mode\" approach) entails.",
    "author": [
      {
        "family": "Tuomela",
        "given": "Raimo"
      }
    ],
    "citation-key": "tuomela2013",
    "ISBN": "978-0-19-997827-4",
    "issued": {
      "date-parts": [
        [
          2013,
          8,
          23
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "327",
    "publisher": "Oxford University Press",
    "source": "Google Books",
    "title": "Social Ontology: Collective Intentionality and Group Agents",
    "title-short": "Social Ontology",
    "type": "book"
  },
  {
    "id": "turner2007",
    "abstract": "In the nineteenth century, there was substantial and sophisticated interest in neuroscience on the part of social theorists, including Comte and Spencer, and later Simon Patten and Charles Ellwood. This body of thinking faced a dead end: it could do little more than identify highly general mechanisms, and could not provide accounts of such questions as `why was there no proletarian revolution?' Psychologically dubious explanations, relying on neo-Kantian views of the mind, replaced them. With the rise of neuroscience, however, some of the problems of concern to earlier thinkers, such as imitation, have revived because of the discovery of neuronal mechanisms, or through fMRI studies. The article reviews the history and discusses the implications of current work for the reconsideration of traditional social theory concepts. It is suggested that certain kinds of bridging work with neuroscience would enable us to answer many questions in social theory that empirical sociology has failed to answer.",
    "accessed": {
      "date-parts": [
        [
          2021,
          10,
          6
        ]
      ]
    },
    "author": [
      {
        "family": "Turner",
        "given": "Stephen"
      }
    ],
    "citation-key": "turner2007",
    "container-title": "European Journal of Social Theory",
    "container-title-short": "European Journal of Social Theory",
    "DOI": "10.1177/1368431007080700",
    "ISSN": "1368-4310",
    "issue": "3",
    "issued": {
      "date-parts": [
        [
          2007,
          8,
          1
        ]
      ]
    },
    "language": "en",
    "page": "357-374",
    "publisher": "SAGE Publications Ltd",
    "source": "SAGE Journals",
    "title": "Social Theory as a Cognitive Neuroscience",
    "type": "article-journal",
    "URL": "https://doi.org/10.1177/1368431007080700",
    "volume": "10"
  },
  {
    "id": "turner2018",
    "accessed": {
      "date-parts": [
        [
          2021,
          2,
          19
        ]
      ]
    },
    "author": [
      {
        "family": "Turner",
        "given": ""
      }
    ],
    "citation-key": "turner2018",
    "DOI": "10.4324/9781351180528",
    "edition": "1",
    "ISBN": "978-1-351-18052-8",
    "issued": {
      "date-parts": [
        [
          2018,
          3,
          9
        ]
      ]
    },
    "language": "en",
    "publisher": "Routledge",
    "source": "DOI.org (Crossref)",
    "title": "Cognitive Science and the Social: A Primer",
    "title-short": "Cognitive Science and the Social",
    "type": "book",
    "URL": "https://www.taylorfrancis.com/books/9781351180511"
  },
  {
    "id": "turner2019",
    "accessed": {
      "date-parts": [
        [
          2021,
          12,
          17
        ]
      ]
    },
    "author": [
      {
        "family": "Turner",
        "given": "Stephen"
      }
    ],
    "citation-key": "turner2019",
    "container-title": "Philosophy of the Social Sciences",
    "container-title-short": "Philosophy of the Social Sciences",
    "DOI": "10.1177/0048393119847102",
    "ISSN": "0048-3931, 1552-7441",
    "issue": "4",
    "issued": {
      "date-parts": [
        [
          2019,
          7
        ]
      ]
    },
    "language": "en",
    "page": "243-264",
    "source": "DOI.org (Crossref)",
    "title": "Verstehen Naturalized",
    "type": "article-journal",
    "URL": "http://journals.sagepub.com/doi/10.1177/0048393119847102",
    "volume": "49"
  },
  {
    "id": "vesper2010",
    "abstract": "What kinds of processes and representations make joint action possible? In this paper, we suggest a minimal architecture for joint action that focuses on representations, action monitoring and action prediction processes, as well as ways of simplifying coordination. The architecture spells out minimal requirements for an individual agent to engage in a joint action. We discuss existing evidence in support of the architecture as well as open questions that remain to be empirically addressed. In addition, we suggest possible interfaces between the minimal architecture and other approaches to joint action. The minimal architecture has implications for theorising about the emergence of joint action, for human–machine interaction, and for understanding how coordination can be facilitated by exploiting relations between multiple agents’ actions and between actions and the environment.",
    "accessed": {
      "date-parts": [
        [
          2021,
          6,
          10
        ]
      ]
    },
    "author": [
      {
        "family": "Vesper",
        "given": "Cordula"
      },
      {
        "family": "Butterfill",
        "given": "Stephen"
      },
      {
        "family": "Knoblich",
        "given": "Günther"
      },
      {
        "family": "Sebanz",
        "given": "Natalie"
      }
    ],
    "citation-key": "vesper2010",
    "container-title": "Neural Networks",
    "container-title-short": "Neural Networks",
    "DOI": "10.1016/j.neunet.2010.06.002",
    "ISSN": "08936080",
    "issue": "8-9",
    "issued": {
      "date-parts": [
        [
          2010,
          10
        ]
      ]
    },
    "language": "en",
    "page": "998-1003",
    "source": "DOI.org (Crossref)",
    "title": "A minimal architecture for joint action",
    "type": "article-journal",
    "URL": "https://linkinghub.elsevier.com/retrieve/pii/S0893608010001152",
    "volume": "23"
  },
  {
    "id": "weber1924",
    "abstract": "I. Methodologische Einleitung für die Erhebungen des Vereins für Sozialpolitik über Auslese und Anpassung (Berufswahl und Berufsschicksal) der Arbeiterschaft der geschlossenen Großindustrie (1908). II. Zur Psychophysik der industriellen Arbeit (1908-09). III. Die Börse (1894). IV. Agrarstatistische und sozialpolitische Betrachtungen zur Fideikommißfrage in Preußen (1904). V. Diskussionsreden auf den Tagungen des Vereins für Sozialpolitik (1905, 1907, 1909, 1911). VI. Geschäftsbericht und Diskussionsreden auf den deutschen soziologischen Tagungen (1910, 1912). VII. Der Sozialismus (1918).",
    "author": [
      {
        "family": "Weber",
        "given": "Max"
      }
    ],
    "citation-key": "weber1924",
    "event-place": "Tübingen",
    "issued": {
      "date-parts": [
        [
          1924
        ]
      ]
    },
    "language": "de",
    "number-of-pages": "518",
    "publisher": "Mohr",
    "publisher-place": "Tübingen",
    "source": "SSOAR",
    "title": "Gesammelte Aufsätze zur Soziologie und Sozialpolitik",
    "type": "book"
  },
  {
    "id": "woodward2005",
    "abstract": "In Making Things Happen, James Woodward develops a new and ambitious comprehensive theory of causation and explanation that draws on literature from a variety of disciplines and which applies to a wide variety of claims in science and everyday life. His theory is a manipulationist account, proposing that causal and explanatory relationships are relationships that are potentially exploitable for purposes of manipulation and control. This account has its roots in the commonsense idea that causes are means for bringing about effects; but it also draws on a long tradition of work inexperimental design, econometrics, and statistics. Woodward shows how these ideas may be generalized to other areas of science from the social scientific and biomedical contexts for which they were originally designed. He also provides philosophical foundations for the manipulationist approach, drawing out its implications, comparing it withalternative approaches, and defending it from common criticisms. In doing so, he shows how the manipulationist account both illuminates important features of successful causal explanation in the natural and social sciences, and avoids the counterexamples and difficulties that infect alternativeapproaches, from the deductive-nomological model onwards. Making Things Happen will interest philosophers working in the philosophy of science, the philosophy of social science, and metaphysics, and as well as anyone interested in causation, explanation, and scientific methodology.",
    "author": [
      {
        "family": "Woodward",
        "given": "James"
      }
    ],
    "citation-key": "woodward2005",
    "ISBN": "978-0-19-518953-7",
    "issued": {
      "date-parts": [
        [
          2005,
          10,
          27
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "434",
    "publisher": "Oxford University Press, USA",
    "source": "Google Books",
    "title": "Making Things Happen: A Theory of Causal Explanation",
    "title-short": "Making Things Happen",
    "type": "book"
  },
  {
    "id": "bhattacharya2008",
    "abstract": "Tools of the theory of critical phenomena, namely the scaling analysis and universality, are argued to be applicable to large complex web-like network structures. Using a detailed analysis of the real data of the International Trade Network we argue that the scaled link weight distribution has an approximate log-normal distribution which remains robust over a period of 53 years. Another universal feature is observed in the power-law growth of the trade strength with gross domestic product, the exponent being similar for all countries. Using the ‘rich-club’ coefficient measure of the weighted networks it has been shown that the size of the rich-club controlling half of the world’s trade is actually shrinking. While the gravity law is known to describe well the social interactions in the static networks of population migration, international trade, etc, here for the first time we studied a non-conservative dynamical model based on the gravity law which excellently reproduced many empirical features of the ITN.",
    "accessed": {
      "date-parts": [
        [
          2023,
          6,
          22
        ]
      ]
    },
    "author": [
      {
        "family": "Bhattacharya",
        "given": "K."
      },
      {
        "family": "Mukherjee",
        "given": "G."
      },
      {
        "family": "Saramäki",
        "given": "J."
      },
      {
        "family": "Kaski",
        "given": "K."
      },
      {
        "family": "Manna",
        "given": "S. S."
      }
    ],
    "citation-key": "bhattacharya2008",
    "container-title": "Journal of Statistical Mechanics: Theory and Experiment",
    "container-title-short": "J. Stat. Mech.",
    "DOI": "10.1088/1742-5468/2008/02/P02002",
    "ISSN": "1742-5468",
    "issue": "02",
    "issued": {
      "date-parts": [
        [
          2008,
          2
        ]
      ]
    },
    "language": "en",
    "page": "P02002",
    "source": "Institute of Physics",
    "title": "The International Trade Network: weighted network analysis and modelling",
    "title-short": "The International Trade Network",
    "type": "article-journal",
    "URL": "https://dx.doi.org/10.1088/1742-5468/2008/02/P02002",
    "volume": "2008"
  },
  {
    "id": "deandrade2018",
    "accessed": {
      "date-parts": [
        [
          2023,
          6,
          22
        ]
      ]
    },
    "author": [
      {
        "family": "de Andrade",
        "given": "Ricardo Lopes"
      },
      {
        "family": "Rêgo",
        "given": "Leandro Chaves"
      }
    ],
    "citation-key": "deandrade2018",
    "container-title": "Physica A: Statistical Mechanics and its Applications",
    "container-title-short": "Physica A: Statistical Mechanics and its Applications",
    "DOI": "10.1016/j.physa.2017.08.126",
    "ISSN": "03784371",
    "issued": {
      "date-parts": [
        [
          2018,
          2
        ]
      ]
    },
    "language": "en",
    "page": "249-270",
    "source": "DOI.org (Crossref)",
    "title": "The use of nodes attributes in social network analysis with an application to an international trade network",
    "type": "article-journal",
    "URL": "https://linkinghub.elsevier.com/retrieve/pii/S0378437117308579",
    "volume": "491"
  },
  {
    "id": "deandrade2018a",
    "abstract": "The social network analysis (SNA) studies the interactions among actors in a network formed through some relationship (friendship, cooperation, trade, among others). The SNA is constantly approached from a binary point of view, i.e., it is only observed if a link between two actors is present or not regardless of the strength of this link. It is known that different information can be obtained in weighted and unweighted networks and that the information extracted from weighted networks is more accurate and detailed. Another rarely discussed approach in the SNA is related to the individual attributes of the actors (nodes), because such analysis is usually focused on the topological structure of networks. Features of the nodes are not incorporated in the SNA what implies that there is some loss or misperception of information in those analyze. This paper aims at exploring more precisely the complexities of a social network, initially developing a method that inserts the individual attributes in the topological structure of the network and then analyzing the network in four different ways: unweighted, edge-weighted and two methods for using both edge-weights and nodes’ attributes. The international trade network was chosen in the application of this approach, where the nodes represent the countries, the links represent the cash flow in the trade transactions and countries’ GDP were chosen as nodes’ attributes. As a result, it is possible to observe which countries are most connected in the world economy and with higher cash flows, to point out the countries that are central to the intermediation of the wealth flow and those that are most benefited from being included in this network. We also made a principal component analysis to study which metrics are more influential in describing the data variability, which turn out to be mostly the weighted metrics which include the nodes’ attributes.",
    "accessed": {
      "date-parts": [
        [
          2023,
          6,
          22
        ]
      ]
    },
    "author": [
      {
        "family": "Andrade",
        "given": "Ricardo Lopes",
        "non-dropping-particle": "de"
      },
      {
        "family": "Rêgo",
        "given": "Leandro Chaves"
      }
    ],
    "citation-key": "deandrade2018a",
    "container-title": "Physica A: Statistical Mechanics and its Applications",
    "container-title-short": "Physica A: Statistical Mechanics and its Applications",
    "DOI": "10.1016/j.physa.2017.08.126",
    "ISSN": "0378-4371",
    "issued": {
      "date-parts": [
        [
          2018,
          2,
          1
        ]
      ]
    },
    "language": "en",
    "page": "249-270",
    "source": "ScienceDirect",
    "title": "The use of nodes attributes in social network analysis with an application to an international trade network",
    "type": "article-journal",
    "URL": "https://www.sciencedirect.com/science/article/pii/S0378437117308579",
    "volume": "491"
  },
  {
    "id": "debenedictis2011",
    "accessed": {
      "date-parts": [
        [
          2023,
          6,
          22
        ]
      ]
    },
    "author": [
      {
        "family": "De Benedictis",
        "given": "Luca"
      },
      {
        "family": "Tajoli",
        "given": "Lucia"
      }
    ],
    "citation-key": "debenedictis2011",
    "container-title": "The World Economy",
    "DOI": "10.1111/j.1467-9701.2011.01360.x",
    "ISSN": "03785920",
    "issue": "8",
    "issued": {
      "date-parts": [
        [
          2011,
          8
        ]
      ]
    },
    "language": "en",
    "page": "1417-1454",
    "source": "DOI.org (Crossref)",
    "title": "The World Trade Network: THE WORLD TRADE NETWORK",
    "title-short": "The World Trade Network",
    "type": "article-journal",
    "URL": "https://onlinelibrary.wiley.com/doi/10.1111/j.1467-9701.2011.01360.x",
    "volume": "34"
  },
  {
    "id": "bhattacharya2008",
    "abstract": "Tools of the theory of critical phenomena, namely the scaling analysis and universality, are argued to be applicable to large complex web-like network structures. Using a detailed analysis of the real data of the International Trade Network we argue that the scaled link weight distribution has an approximate log-normal distribution which remains robust over a period of 53 years. Another universal feature is observed in the power-law growth of the trade strength with gross domestic product, the exponent being similar for all countries. Using the ‘rich-club’ coefficient measure of the weighted networks it has been shown that the size of the rich-club controlling half of the world’s trade is actually shrinking. While the gravity law is known to describe well the social interactions in the static networks of population migration, international trade, etc, here for the first time we studied a non-conservative dynamical model based on the gravity law which excellently reproduced many empirical features of the ITN.",
    "accessed": {
      "date-parts": [
        [
          2023,
          6,
          22
        ]
      ]
    },
    "author": [
      {
        "family": "Bhattacharya",
        "given": "K."
      },
      {
        "family": "Mukherjee",
        "given": "G."
      },
      {
        "family": "Saramäki",
        "given": "J."
      },
      {
        "family": "Kaski",
        "given": "K."
      },
      {
        "family": "Manna",
        "given": "S. S."
      }
    ],
    "citation-key": "bhattacharya2008",
    "container-title": "Journal of Statistical Mechanics: Theory and Experiment",
    "container-title-short": "J. Stat. Mech.",
    "DOI": "10.1088/1742-5468/2008/02/P02002",
    "ISSN": "1742-5468",
    "issue": "02",
    "issued": {
      "date-parts": [
        [
          2008,
          2
        ]
      ]
    },
    "language": "en",
    "page": "P02002",
    "source": "Institute of Physics",
    "title": "The International Trade Network: weighted network analysis and modelling",
    "title-short": "The International Trade Network",
    "type": "article-journal",
    "URL": "https://dx.doi.org/10.1088/1742-5468/2008/02/P02002",
    "volume": "2008"
  },
  {
    "id": "deandrade2018",
    "accessed": {
      "date-parts": [
        [
          2023,
          6,
          22
        ]
      ]
    },
    "author": [
      {
        "family": "de Andrade",
        "given": "Ricardo Lopes"
      },
      {
        "family": "Rêgo",
        "given": "Leandro Chaves"
      }
    ],
    "citation-key": "deandrade2018",
    "container-title": "Physica A: Statistical Mechanics and its Applications",
    "container-title-short": "Physica A: Statistical Mechanics and its Applications",
    "DOI": "10.1016/j.physa.2017.08.126",
    "ISSN": "03784371",
    "issued": {
      "date-parts": [
        [
          2018,
          2
        ]
      ]
    },
    "language": "en",
    "page": "249-270",
    "source": "DOI.org (Crossref)",
    "title": "The use of nodes attributes in social network analysis with an application to an international trade network",
    "type": "article-journal",
    "URL": "https://linkinghub.elsevier.com/retrieve/pii/S0378437117308579",
    "volume": "491"
  },
  {
    "id": "deandrade2018a",
    "abstract": "The social network analysis (SNA) studies the interactions among actors in a network formed through some relationship (friendship, cooperation, trade, among others). The SNA is constantly approached from a binary point of view, i.e., it is only observed if a link between two actors is present or not regardless of the strength of this link. It is known that different information can be obtained in weighted and unweighted networks and that the information extracted from weighted networks is more accurate and detailed. Another rarely discussed approach in the SNA is related to the individual attributes of the actors (nodes), because such analysis is usually focused on the topological structure of networks. Features of the nodes are not incorporated in the SNA what implies that there is some loss or misperception of information in those analyze. This paper aims at exploring more precisely the complexities of a social network, initially developing a method that inserts the individual attributes in the topological structure of the network and then analyzing the network in four different ways: unweighted, edge-weighted and two methods for using both edge-weights and nodes’ attributes. The international trade network was chosen in the application of this approach, where the nodes represent the countries, the links represent the cash flow in the trade transactions and countries’ GDP were chosen as nodes’ attributes. As a result, it is possible to observe which countries are most connected in the world economy and with higher cash flows, to point out the countries that are central to the intermediation of the wealth flow and those that are most benefited from being included in this network. We also made a principal component analysis to study which metrics are more influential in describing the data variability, which turn out to be mostly the weighted metrics which include the nodes’ attributes.",
    "accessed": {
      "date-parts": [
        [
          2023,
          6,
          22
        ]
      ]
    },
    "author": [
      {
        "family": "Andrade",
        "given": "Ricardo Lopes",
        "non-dropping-particle": "de"
      },
      {
        "family": "Rêgo",
        "given": "Leandro Chaves"
      }
    ],
    "citation-key": "deandrade2018a",
    "container-title": "Physica A: Statistical Mechanics and its Applications",
    "container-title-short": "Physica A: Statistical Mechanics and its Applications",
    "DOI": "10.1016/j.physa.2017.08.126",
    "ISSN": "0378-4371",
    "issued": {
      "date-parts": [
        [
          2018,
          2,
          1
        ]
      ]
    },
    "language": "en",
    "page": "249-270",
    "source": "ScienceDirect",
    "title": "The use of nodes attributes in social network analysis with an application to an international trade network",
    "type": "article-journal",
    "URL": "https://www.sciencedirect.com/science/article/pii/S0378437117308579",
    "volume": "491"
  },
  {
    "id": "debenedictis2011",
    "accessed": {
      "date-parts": [
        [
          2023,
          6,
          22
        ]
      ]
    },
    "author": [
      {
        "family": "De Benedictis",
        "given": "Luca"
      },
      {
        "family": "Tajoli",
        "given": "Lucia"
      }
    ],
    "citation-key": "debenedictis2011",
    "container-title": "The World Economy",
    "DOI": "10.1111/j.1467-9701.2011.01360.x",
    "ISSN": "03785920",
    "issue": "8",
    "issued": {
      "date-parts": [
        [
          2011,
          8
        ]
      ]
    },
    "language": "en",
    "page": "1417-1454",
    "source": "DOI.org (Crossref)",
    "title": "The World Trade Network: THE WORLD TRADE NETWORK",
    "title-short": "The World Trade Network",
    "type": "article-journal",
    "URL": "https://onlinelibrary.wiley.com/doi/10.1111/j.1467-9701.2011.01360.x",
    "volume": "34"
  },
  {
    "id": "caforioHandbookSociologyMilitary2018",
    "abstract": "This new edition of the volume is presented on the wave of the success which had its first edition (2003). It is entirely updated to the current situation of the disciplines covered, and expanded with particular regard to the new missions, that have become the main challenge for the armed forces in these first decades of the new millennium, with new insights to technological development toward so-called cyborg warriors, new forms of leadership and changes in soldier's identity and organisational culture. It is compiled of documents coming from various researchers at universities around the world as well as military officers devoted to the sector of study. Covered in this volume is a historical excursus of studies prior to contemporary research, interpretive models and theoretical approaches developed specifically for this topic, civic-military relations including issues surrounding democratic control of the armed forces, military culture, professional training, conditions and problems of minorities in the armed forces, an examination of the structural change within the military over the years including new duties and functions following the Cold War.",
    "author": [
      {
        "family": "Caforio",
        "given": "Giuseppe"
      },
      {
        "family": "Nuciari",
        "given": "Marina"
      }
    ],
    "citation-key": "caforioHandbookSociologyMilitary2018",
    "ISBN": "978-3-319-71602-2",
    "issued": {
      "date-parts": [
        [
          2018,
          5,
          19
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "639",
    "publisher": "Springer",
    "source": "Google Books",
    "title": "Handbook of the Sociology of the Military",
    "type": "book"
  },
  {
    "id": "morrisjanowitzProfessionalSoldierSocial1964",
    "abstract": "More than 50 years after its publication, The Professional Soldier remains a path-breaking study of civil-military relations. In the Cold War era, Morris Janowitz was among the first to recognize that the military was a fruitful subject for social science to study. Asking who soldiers are, what they do, and what they believe, Janowitz’s studies of armed forces and society have guided the work of scholars and policy makers for three generations.\n\nThe Professional Soldier identifies three issues that confront civil-military relations to this day: how to judge the political consequences of military conduct, how to solve problems of international relations while using less force, and how to strengthen civilian control of the military while preserving professional military autonomy. A vital resource for students and anyone interested in understanding the past, present, and future of the armed services.",
    "accessed": {
      "date-parts": [
        [
          2023,
          6,
          24
        ]
      ]
    },
    "author": [
      {
        "literal": "Morris Janowitz"
      }
    ],
    "citation-key": "morrisjanowitzProfessionalSoldierSocial1964",
    "ISBN": "978-0-02-916180-7",
    "issued": {
      "date-parts": [
        [
          1964
        ]
      ]
    },
    "number-of-pages": "464",
    "publisher": "The Free Press",
    "title": "The Professional Soldier: A Social and Political Portrait",
    "type": "book",
    "URL": "https://lib-g52qjmltckv4ckeep7ghyk7h.1lib.ph/book/24588186/591d4c"
  },
  {
    "id": "samuelr.huntingtonSoldierStateTheory1957",
    "author": [
      {
        "literal": "Samuel R. Huntington"
      }
    ],
    "citation-key": "samuelr.huntingtonSoldierStateTheory1957",
    "event-place": "Cambridge:",
    "issued": {
      "date-parts": [
        [
          1957
        ]
      ]
    },
    "publisher": "Harvard University Press.",
    "publisher-place": "Cambridge:",
    "title": "The soldier and the state: The theory and practice of civil-military relations",
    "type": "book"
  },
  {
    "id": "snijdersStatisticalEvaluationSocial2001",
    "type": "article-journal",
    "abstract": "A class of statistical models is proposed for longitudinal network data. The dependent variable is the changing (or evolving) relation network, represented by two or more observations of a directed graph with a fixed set of actors. The network evolution is modeled as the consequence of the actors making new choices, or withdrawing existing choices, on the basis of functions, with fixed and random components, that the actors try to maximize. Individual and dyadic exogenous variables can be used as covariates. The change in the network is modeled as the stochastic result of network effects (reciprocity, transitivity, etc.) and these covariates. The existing network structure is a dynamic constraint for the evolution of the structure itself. The models are continuous-time Markov chain models that can be implemented as simulation models. The model parameters are estimated from observed data. For estimating and testing these models, statistical procedures are proposed that are based on the method of moments. The statistical procedures are implemented using a stochastic approximation algorithm based on computer simulations of the network evolution process.",
    "container-title": "Sociological Methodology",
    "DOI": "10.1111/0081-1750.00099",
    "ISSN": "1467-9531",
    "issue": "1",
    "language": "en",
    "license": "American Sociological Association 2001",
    "note": "_eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/0081-1750.00099",
    "page": "361-395",
    "source": "Wiley Online Library",
    "title": "The Statistical Evaluation of Social Network Dynamics",
    "URL": "https://onlinelibrary.wiley.com/doi/abs/10.1111/0081-1750.00099",
    "volume": "31",
    "author": [
      {
        "family": "Snijders",
        "given": "Tom A. B."
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          11,
          23
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2001"
        ]
      ]
    }
  },
  {
    "id": "amati",
    "type": "article-journal",
    "abstract": "The stochastic actor-oriented model (Snijders, Sociological Methodology, 2001) models the evolution of networks over time, given panel data in a ﬁxed group of actors, where at each panel wave the network between these actors (a digraph structure) as well as attribute variables for these actors are observed. The parameters of this model usually are estimated by a stochastic approximation version of the method of moments. Statistics that correspond to the parameters in a natural way are used for ﬁtting the model. Here we present an estimator based on the generalized method of moments, i.e., using more statistics than parameters, for minimizing the distance between observed statistics and their expected values. Again, the resulting equation is solved by stochastic approximation. Several algorithmic issues arise that have to be solved in order to obtain a stable procedure. For some examples we study the resulting gain in statistical efﬁciency.",
    "language": "en",
    "source": "Zotero",
    "title": "Estimation of Stochastic actor-oriented models for the evolution of networksby generalized method of moments",
    "author": [
      {
        "family": "Amati",
        "given": "Viviana"
      },
      {
        "family": "Schönenberger",
        "given": "Felix"
      },
      {
        "family": "Snijders",
        "given": "Tom A B"
      }
    ]
  },
  {
    "id": "besag1986",
    "type": "article-journal",
    "abstract": "SUMMARY\n            \n              A continuous two‐dimensional region is partitioned into a fine rectangular array of sites or “pixels”, each pixel having a particular “colour” belonging to a prescribed finite set. The true colouring of the region is unknown but, associated with each pixel, there is a possibly multivariate record which conveys imperfect information about its colour according to a known statistical model. The aim is to reconstruct the true scene, with the additional knowledge that pixels close together tend to have the same or similar colours. In this paper, it is assumed that the\n              local\n              characteristics of the true scene can be represented by a non‐degenerate Markov random field. Such information can be combined with the records by Bayes' theorem and the true scene can be estimated according to standard criteria. However, the computational burden is enormous and the reconstruction may reflect undesirable large‐scale properties of the random field. Thus, a simple, iterative method of reconstruction is proposed, which does not depend on these large‐scale characteristics. The method is illustrated by computer simulations in which the original scene is\n              not\n              directly related to the assumed random field. Some complications, including parameter estimation, are discussed. Potential applications are mentioned briefly.",
    "container-title": "Journal of the Royal Statistical Society: Series B (Methodological)",
    "DOI": "10.1111/j.2517-6161.1986.tb01412.x",
    "ISSN": "0035-9246, 2517-6161",
    "issue": "3",
    "journalAbbreviation": "Journal of the Royal Statistical Society: Series B (Methodological)",
    "language": "en",
    "page": "259-279",
    "source": "Semantic Scholar",
    "title": "On the Statistical Analysis of Dirty Pictures",
    "URL": "https://rss.onlinelibrary.wiley.com/doi/10.1111/j.2517-6161.1986.tb01412.x",
    "volume": "48",
    "author": [
      {
        "family": "Besag",
        "given": "Julian"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          11,
          23
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "1986",
          7
        ]
      ]
    }
  },
  {
    "id": "snijders",
    "type": "article-journal",
    "abstract": "This paper is about estimating the parameters of the exponential random graph model, also known as the p∗ model, using frequentist Markov chain Monte Carlo (MCMC) methods. The exponential random graph model is simulated using Gibbs or MetropolisHastings sampling. The estimation procedures considered are based on the Robbins-Monro algorithm for approximating a solution to the likelihood equation.",
    "language": "en",
    "source": "Zotero",
    "title": "Markov Chain Monte Carlo Estimation of Exponential Random Graph Models",
    "author": [
      {
        "family": "Snijders",
        "given": "Tom A B"
      }
    ]
  },
  {
    "id": "nowicki2001",
    "type": "article-journal",
    "container-title": "Journal of the American Statistical Association",
    "DOI": "10.1198/016214501753208735",
    "ISSN": "0162-1459, 1537-274X",
    "issue": "455",
    "journalAbbreviation": "Journal of the American Statistical Association",
    "language": "en",
    "page": "1077-1087",
    "source": "DOI.org (Crossref)",
    "title": "Estimation and Prediction for Stochastic Blockstructures",
    "URL": "http://www.tandfonline.com/doi/abs/10.1198/016214501753208735",
    "volume": "96",
    "author": [
      {
        "family": "Nowicki",
        "given": "Krzysztof"
      },
      {
        "family": "Snijders",
        "given": "Tom A. B"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          11,
          23
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2001",
          9
        ]
      ]
    }
  },
  {
    "id": "hoff2002",
    "type": "article-journal",
    "container-title": "Journal of the American Statistical Association",
    "DOI": "10.1198/016214502388618906",
    "ISSN": "0162-1459, 1537-274X",
    "issue": "460",
    "journalAbbreviation": "Journal of the American Statistical Association",
    "language": "en",
    "page": "1090-1098",
    "source": "DOI.org (Crossref)",
    "title": "Latent Space Approaches to Social Network Analysis",
    "URL": "http://www.tandfonline.com/doi/abs/10.1198/016214502388618906",
    "volume": "97",
    "author": [
      {
        "family": "Hoff",
        "given": "Peter D"
      },
      {
        "family": "Raftery",
        "given": "Adrian E"
      },
      {
        "family": "Handcock",
        "given": "Mark S"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          11,
          23
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2002",
          12
        ]
      ]
    }
  },
  {
    "id": "schweinberger2003",
    "type": "article-journal",
    "abstract": "A class of statistical models is proposed that aims to recover latent settings structures in social networks. Settings may be regarded as clusters of vertices. The measurement model is based on two assumptions. (1) The observed network is generated by hierarchically nested latent transitive structures, expressed by ultrametrics, and (2) the expected tie strength decreases with ultrametric distance. The approach could be described as model-based clustering with an ultrametric space as the underlying metric to capture the dependence in the observations. Bayesian methods as well as maximum-likelihood methods are applied for statistical inference. Both approaches are implemented using Markov chain Monte Carlo methods.",
    "container-title": "Sociological Methodology",
    "DOI": "10.1111/j.0081-1750.2003.00134.x",
    "ISSN": "1467-9531",
    "issue": "1",
    "page": "307-341",
    "source": "the University of Groningen research portal",
    "title": "Settings in Social Networks: A Measurement Model",
    "title-short": "Settings in Social Networks",
    "volume": "33",
    "author": [
      {
        "family": "Schweinberger",
        "given": "Michael"
      },
      {
        "family": "Snijders",
        "given": "Tom A.B."
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2003"
        ]
      ]
    }
  },
  {
    "id": "lospinoso2019",
    "type": "article-journal",
    "abstract": "We propose a Mahalanobis distance–based Monte Carlo goodness of fit testing procedure for the family of stochastic actororiented models for social network evolution. A modified model distance estimator is proposed to help the researcher identify model extensions that will remediate poor fit. A limited simulation study is provided to establish baseline legitimacy for the Mahalanobis distance–based Monte Carlo test and modified model distance estimator. A forward model selection workflow is proposed, and this procedure is demonstrated on a real data set.",
    "container-title": "Methodological Innovations",
    "DOI": "10.1177/2059799119884282",
    "ISSN": "2059-7991, 2059-7991",
    "issue": "3",
    "journalAbbreviation": "Methodological Innovations",
    "language": "en",
    "page": "205979911988428",
    "source": "DOI.org (Crossref)",
    "title": "Goodness of fit for stochastic actor-oriented models",
    "URL": "http://journals.sagepub.com/doi/10.1177/2059799119884282",
    "volume": "12",
    "author": [
      {
        "family": "Lospinoso",
        "given": "Josh"
      },
      {
        "family": "Snijders",
        "given": "Tom Ab"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          11,
          23
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2019",
          9
        ]
      ]
    }
  },
  {
    "id": "strauss1986",
    "type": "article-journal",
    "abstract": "This paper develops a class of probability models for configurations of interacting points in a domain. The distributions depend on a function which may be viewed as giving the potential energy of the configurations. Examples include models for interaction in a spatial region and on lattices and graphs. New models in the general class arise naturally, an example being a spatial model for points of different categories. Some general methods, including series expansions and a simulation method known from statistical mechanics, can be useful for many of these models. Several applications of this kind are considered, and some connections between the models and with the statistical mechanics are explored.",
    "container-title": "SIAM Review",
    "ISSN": "0036-1445",
    "issue": "4",
    "note": "publisher: Society for Industrial and Applied Mathematics",
    "page": "513-527",
    "source": "JSTOR",
    "title": "On a General Class of Models for Interaction",
    "URL": "https://www.jstor.org/stable/2031102",
    "volume": "28",
    "author": [
      {
        "family": "Strauss",
        "given": "David"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          11,
          23
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "1986"
        ]
      ]
    }
  },
  {
    "id": "handcock",
    "type": "article-journal",
    "language": "en",
    "source": "Zotero",
    "title": "Assessing Degeneracy in Statistical Models of Social Networks",
    "author": [
      {
        "family": "Handcock",
        "given": "Mark S"
      }
    ]
  },
  {
    "id": "pattison2002",
    "type": "article-journal",
    "abstract": "We argue that social networks can be modeled as the outcome of processes that occur in overlapping local regions of the network, termed local social neighborhoods. Each neighborhood is conceived as a possible site of interaction and corresponds to a subset of possible network ties. In this paper, we discuss hypotheses about the form of these neighborhoods, and we present two new and theoretically plausible ways in which neighborhood-based models for networks can be constructed. In the first, we introduce the notion of a setting structure, a directly hypothesized (or observed) set of exogenous constraints on possible neighborhood forms. In the second, we propose higher-order neighborhoods that are generated, in part, by the outcome of interactive network processes themselves. Applications of both approaches to model construction are presented, and the developments are considered within a general conceptual framework of locale for social networks. We show how assumptions about neighborhoods can be cast within a hierarchy of increasingly complex models; these models represent a progressively greater capacity for network processes to ?reach? across a network through long cycles or semipaths. We argue that this class of models holds new promise for the development of empirically plausible models for networks and network-based processes.",
    "container-title": "Sociological Methodology",
    "DOI": "10.1111/1467-9531.00119",
    "ISSN": "0081-1750",
    "issue": "1",
    "note": "publisher: SAGE Publications Inc",
    "page": "301-337",
    "source": "SAGE Journals",
    "title": "9. Neighborhood-Based Models for Social Networks",
    "URL": "https://doi.org/10.1111/1467-9531.00119",
    "volume": "32",
    "author": [
      {
        "family": "Pattison",
        "given": "Philippa"
      },
      {
        "family": "Robins",
        "given": "Garry"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          11,
          23
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2002",
          8,
          1
        ]
      ]
    }
  },
  {
    "id": "snijdersStochasticActororientedModels2017",
    "type": "article-journal",
    "container-title": "Annual review of statistics and its application",
    "note": "publisher: Annual Reviews",
    "page": "343–363",
    "source": "Google Scholar",
    "title": "Stochastic actor-oriented models for network dynamics",
    "volume": "4",
    "author": [
      {
        "family": "Snijders",
        "given": "Tom AB"
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2017"
        ]
      ]
    }
  },
  {
    "id": "stadtfeldInteractionsActorsTime2017",
    "type": "article-journal",
    "container-title": "Sociological Science",
    "page": "318–352",
    "source": "Google Scholar",
    "title": "Interactions, actors, and time: Dynamic network actor models for relational events",
    "title-short": "Interactions, actors, and time",
    "volume": "4",
    "author": [
      {
        "family": "Stadtfeld",
        "given": "Christoph"
      },
      {
        "family": "Block",
        "given": "Per"
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2017"
        ]
      ]
    }
  },
  {
    "id": "buttsRelationalEventFramework2008",
    "type": "article-journal",
    "container-title": "Sociological Methodology",
    "issue": "1",
    "note": "publisher: Wiley Online Library",
    "page": "155–200",
    "source": "Google Scholar",
    "title": "A relational event framework for social action",
    "volume": "38",
    "author": [
      {
        "family": "Butts",
        "given": "Carter T."
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2008"
        ]
      ]
    }
  },
  {
    "id": "snijdersStatisticalEvaluationSocial2001",
    "type": "article-journal",
    "container-title": "Sociological methodology",
    "issue": "1",
    "note": "publisher: Wiley Online Library",
    "page": "361–395",
    "source": "Google Scholar",
    "title": "The statistical evaluation of social network dynamics",
    "volume": "31",
    "author": [
      {
        "family": "Snijders",
        "given": "Tom AB"
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2001"
        ]
      ]
    }
  },
  {
    "id": "snijdersStochasticActororientedModels1996",
    "type": "article-journal",
    "container-title": "Journal of mathematical sociology",
    "issue": "1-2",
    "note": "publisher: Taylor & Francis",
    "page": "149–172",
    "source": "Google Scholar",
    "title": "Stochastic actor-oriented models for network change",
    "volume": "21",
    "author": [
      {
        "family": "Snijders",
        "given": "Tom AB"
      }
    ],
    "issued": {
      "date-parts": [
        [
          "1996"
        ]
      ]
    }
  },
  {
    "id": "kalishStochasticActorOrientedModels2020",
    "type": "article-journal",
    "abstract": "Stochastic actor-oriented (SAO) models are a family of models for network dynamics that enable researchers to test multiple, often competing explanations for network change and estimate the extent and relative power of various influences on network evolution. SAO models for the co-evolution of network ties and actor behavior, the most comprehensive category of SAO models, examine how networks and actor attributes—their behavior, performance, or attitudes—influence each other over time. While these models have been widely used in the social sciences, and particularly in educational settings, their use in organizational scholarship has been extremely limited. This paper provides a layperson introduction to SAO models for the co-evolution of networks and behavior and the types of research questions they can address. The models and their underpinnings are explained in nonmathematical terms, and theoretical explanations are supported by a concrete, detailed example that includes step-by-step model building and hypothesis testing, alongside an R script.",
    "container-title": "Organizational Research Methods",
    "DOI": "10.1177/1094428118825300",
    "ISSN": "1094-4281",
    "issue": "3",
    "language": "en",
    "note": "publisher: SAGE Publications Inc",
    "page": "511-534",
    "source": "SAGE Journals",
    "title": "Stochastic Actor-Oriented Models for the Co-Evolution of Networks and Behavior: An Introduction and Tutorial",
    "title-short": "Stochastic Actor-Oriented Models for the Co-Evolution of Networks and Behavior",
    "URL": "https://doi.org/10.1177/1094428118825300",
    "volume": "23",
    "author": [
      {
        "family": "Kalish",
        "given": "Yuval"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          13
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2020",
          7,
          1
        ]
      ]
    }
  },
  {
    "id": "blockFormsDependenceComparing2019",
    "type": "article-journal",
    "container-title": "Sociological Methods & Research",
    "issue": "1",
    "note": "publisher: Sage Publications Sage CA: Los Angeles, CA",
    "page": "202–239",
    "source": "Google Scholar",
    "title": "Forms of dependence: Comparing SAOMs and ERGMs from basic principles",
    "title-short": "Forms of dependence",
    "volume": "48",
    "author": [
      {
        "family": "Block",
        "given": "Per"
      },
      {
        "family": "Stadtfeld",
        "given": "Christoph"
      },
      {
        "family": "Snijders",
        "given": "Tom AB"
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2019"
        ]
      ]
    }
  },
  {
    "id": "karlinFirstCourseStochastic1975",
    "type": "article-journal",
    "container-title": "Cited on",
    "page": "64",
    "source": "Google Scholar",
    "title": "A first course in stochastic processes, New York: Academic",
    "title-short": "A first course in stochastic processes, New York",
    "author": [
      {
        "family": "Karlin",
        "given": "S."
      },
      {
        "family": "Taylor",
        "given": "H. M."
      }
    ],
    "issued": {
      "date-parts": [
        [
          "1975"
        ]
      ]
    }
  },
  {
    "id": "norrisMarkovChains1998",
    "type": "book",
    "collection-number": "2",
    "publisher": "Cambridge university press",
    "source": "Google Scholar",
    "title": "Markov chains",
    "author": [
      {
        "family": "Norris",
        "given": "James R."
      }
    ],
    "issued": {
      "date-parts": [
        [
          "1998"
        ]
      ]
    }
  },
  {
    "id": "hollandLocalStructureSocial1976",
    "type": "article-journal",
    "container-title": "Sociological methodology",
    "note": "publisher: JSTOR",
    "page": "1–45",
    "source": "Google Scholar",
    "title": "Local structure in social networks",
    "volume": "7",
    "author": [
      {
        "family": "Holland",
        "given": "Paul W."
      },
      {
        "family": "Leinhardt",
        "given": "Samuel"
      }
    ],
    "issued": {
      "date-parts": [
        [
          "1976"
        ]
      ]
    }
  },
  {
    "id": "snijdersIntroductionStochasticActorbased2010",
    "type": "article-journal",
    "container-title": "Social networks",
    "issue": "1",
    "note": "publisher: Elsevier",
    "page": "44–60",
    "source": "Google Scholar",
    "title": "Introduction to stochastic actor-based models for network dynamics",
    "volume": "32",
    "author": [
      {
        "family": "Snijders",
        "given": "Tom AB"
      },
      {
        "family": "Van de Bunt",
        "given": "Gerhard G."
      },
      {
        "family": "Steglich",
        "given": "Christian EG"
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2010"
        ]
      ]
    }
  },
  {
    "id": "ceoldoStochasticActorOriented2023",
    "type": "article-journal",
    "abstract": "The stochastic actor oriented model (SAOM) is a method for modelling social interactions and social behaviour over time. It can be used to model network effects using both exogenous covariates and endogenous network configurations, but also the co-evolution of behaviour and social interactions. The estimation method mostly used is the Method of Moments (MoM). The model assumption that all individuals have the same evaluation function, however, is one of its limitations. The aim of this paper is to generalize the MoM estimation method for the SAOM to include random effects, so that the heterogeneity of individuals can be modelled more accurately. The linear evaluation function that models the probability of forming or removing a tie from the network, is decomposed in a fixed part, which is the current evaluation function of the SAOM, and a random part, with parameters that are individual-specific and random. The Robbins-Monro algorithm that is commonly used for MoM estimation in the SAOM, is extended to allow the estimation of the variance of the random parameters. We illustrate how for the model with random out-degree we can estimate the parameter of the random components, and how to test its significance. An application is made to Kapferer's Tailor shop dataset. It is shown that including a random out-degree constitutes a serious alternative to including various transitivity effects.",
    "DOI": "10.48550/ARXIV.2304.07312",
    "license": "Creative Commons Attribution 4.0 International",
    "note": "publisher: arXiv\nversion: 1",
    "source": "DOI.org (Datacite)",
    "title": "Stochastic Actor Oriented Model with Random Effects",
    "URL": "https://arxiv.org/abs/2304.07312",
    "author": [
      {
        "family": "Ceoldo",
        "given": "Giacomo"
      },
      {
        "family": "Snijders",
        "given": "Tom A. B."
      },
      {
        "family": "Wit",
        "given": "Ernst C."
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2023"
        ]
      ]
    }
  },
  {
    "id": "ripleyManualSIENAVersion2011",
    "type": "article-journal",
    "container-title": "University of Oxford",
    "note": "publisher: Citeseer",
    "source": "Google Scholar",
    "title": "Manual for SIENA version 4.0",
    "author": [
      {
        "family": "Ripley",
        "given": "Ruth M."
      },
      {
        "family": "Snijders",
        "given": "Tom AB"
      },
      {
        "family": "Boda",
        "given": "Zsófia"
      },
      {
        "family": "Vörös",
        "given": "András"
      },
      {
        "family": "Preciado",
        "given": "Paulina"
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2011"
        ]
      ]
    }
  },
  {
    "id": "snijdersSienaStatisticalModeling2017",
    "type": "chapter",
    "container-title": "Encyclopedia of Social Network Analysis and Mining",
    "event-place": "New York, NY",
    "ISBN": "978-1-4614-7163-9",
    "language": "en",
    "note": "DOI: 10.1007/978-1-4614-7163-9_312-1",
    "page": "1-9",
    "publisher": "Springer New York",
    "publisher-place": "New York, NY",
    "source": "DOI.org (Crossref)",
    "title": "Siena: Statistical Modeling of Longitudinal Network Data",
    "title-short": "Siena",
    "URL": "http://link.springer.com/10.1007/978-1-4614-7163-9_312-1",
    "editor": [
      {
        "family": "Alhajj",
        "given": "Reda"
      },
      {
        "family": "Rokne",
        "given": "Jon"
      }
    ],
    "author": [
      {
        "family": "Snijders",
        "given": "Tom A. B."
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2017"
        ]
      ]
    }
  },
  {
    "id": "BerardoSelfOrganizing",
    "type": "webpage",
    "title": "Berardo: Self‐organizing policy networks: Risk,... - Академия Google",
    "URL": "https://scholar.google.com/scholar_lookup?&title=Self-organizing%20policy%20networks%3A%20risk%2C%20partner%20selection%20and%20cooperation%20in%20estuaries&journal=Am%20J%20Polit%20Sci&volume=54&pages=632-649&publication_year=2010&author=Berardo%2CR&author=Scholz%2CJT",
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    }
  },
  {
    "id": "steglichDynamicNetworksBehavior2010",
    "type": "article-journal",
    "container-title": "Sociological methodology",
    "issue": "1",
    "note": "publisher: Wiley Online Library",
    "page": "329–393",
    "source": "Google Scholar",
    "title": "Dynamic networks and behavior: Separating selection from influence",
    "title-short": "Dynamic networks and behavior",
    "volume": "40",
    "author": [
      {
        "family": "Steglich",
        "given": "Christian"
      },
      {
        "family": "Snijders",
        "given": "Tom AB"
      },
      {
        "family": "Pearson",
        "given": "Michael"
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2010"
        ]
      ]
    }
  },
  {
    "id": "vandebuntFriendshipNetworksTime1999",
    "type": "article-journal",
    "abstract": "We propose a class of actor-oriented statistical models for closed social networks in general, and friendship networks in particular. The models are random utility models developed within a rational choice framework. Based on social psychological and sociological theories about friendship, mathematical functions capturing expected utility of individual actors with respect to friendship are constructed. Expected utility also contains a random (unexplained) component. We assume that, given their restrictions and contact opportunities, individuals evaluate their utility functions and behave such that they maximize the expected amount of utility. The behavior under consideration is the expression of like and dislike (choice of friends). Theoretical mechanisms that are modelled are, e.g., the principle of diminishing returns, the tendency towards reciprocated choices, and the preference for friendship relations with similar others. Constraints imposed on individuals are, e.g., the structure of the existing network, and the distribution of personal characteristics over the respondents. The models are illustrated by means of a data-set collected among university freshmen at 7 points in time during 1994 and 1995.",
    "container-title": "Computational & Mathematical Organization Theory",
    "DOI": "10.1023/A:1009683123448",
    "ISSN": "1572-9346",
    "issue": "2",
    "journalAbbreviation": "Computational &amp; Mathematical Organization Theory",
    "language": "en",
    "page": "167-192",
    "source": "Springer Link",
    "title": "Friendship Networks Through Time: An Actor-Oriented Dynamic Statistical Network Model",
    "title-short": "Friendship Networks Through Time",
    "URL": "https://doi.org/10.1023/A:1009683123448",
    "volume": "5",
    "author": [
      {
        "family": "Van De Bunt",
        "given": "Gerhard G."
      },
      {
        "family": "Van Duijn",
        "given": "Marijtje A.J."
      },
      {
        "family": "Snijders",
        "given": "Tom A.B."
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "1999",
          7,
          1
        ]
      ]
    }
  },
  {
    "id": "selfhoutEmergingLateAdolescent2010",
    "type": "article-journal",
    "container-title": "Journal of Personality",
    "DOI": "10.1111/j.1467-6494.2010.00625.x",
    "ISSN": "00223506, 14676494",
    "issue": "2",
    "language": "en",
    "page": "509-538",
    "source": "DOI.org (Crossref)",
    "title": "Emerging Late Adolescent Friendship Networks and Big Five Personality Traits: A Social Network Approach",
    "title-short": "Emerging Late Adolescent Friendship Networks and Big Five Personality Traits",
    "URL": "https://onlinelibrary.wiley.com/doi/10.1111/j.1467-6494.2010.00625.x",
    "volume": "78",
    "author": [
      {
        "family": "Selfhout",
        "given": "Maarten"
      },
      {
        "family": "Burk",
        "given": "William"
      },
      {
        "family": "Branje",
        "given": "Susan"
      },
      {
        "family": "Denissen",
        "given": "Jaap"
      },
      {
        "family": "Van Aken",
        "given": "Marcel"
      },
      {
        "family": "Meeus",
        "given": "Wim"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2010",
          4
        ]
      ]
    }
  },
  {
    "id": "merckenDynamicsAdolescentFriendship2009",
    "type": "article-journal",
    "container-title": "Social science & medicine",
    "issue": "10",
    "note": "publisher: Elsevier",
    "page": "1506–1514",
    "source": "Google Scholar",
    "title": "Dynamics of adolescent friendship networks and smoking behavior: Social network analyses in six European countries",
    "title-short": "Dynamics of adolescent friendship networks and smoking behavior",
    "volume": "69",
    "author": [
      {
        "family": "Mercken",
        "given": "Liesbeth"
      },
      {
        "family": "Snijders",
        "given": "Tom AB"
      },
      {
        "family": "Steglich",
        "given": "Christian"
      },
      {
        "family": "Vries",
        "given": "Hein",
        "non-dropping-particle": "de"
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2009"
        ]
      ]
    }
  },
  {
    "id": "delahayeHomophilyContagionExplanations2011",
    "type": "article-journal",
    "container-title": "Journal of Adolescent Health",
    "issue": "4",
    "note": "publisher: Elsevier",
    "page": "421–427",
    "source": "Google Scholar",
    "title": "Homophily and contagion as explanations for weight similarities among adolescent friends",
    "volume": "49",
    "author": [
      {
        "family": "De La Haye",
        "given": "Kayla"
      },
      {
        "family": "Robins",
        "given": "Garry"
      },
      {
        "family": "Mohr",
        "given": "Philip"
      },
      {
        "family": "Wilson",
        "given": "Carlene"
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2011"
        ]
      ]
    }
  },
  {
    "id": "aronsonPeerInfluencePotential2016",
    "type": "article-journal",
    "container-title": "Social Science & Medicine",
    "DOI": "10.1016/j.socscimed.2016.09.010",
    "ISSN": "02779536",
    "journalAbbreviation": "Social Science & Medicine",
    "language": "en",
    "page": "111-119",
    "source": "DOI.org (Crossref)",
    "title": "Peer influence as a potential magnifier of ADHD diagnosis",
    "URL": "https://linkinghub.elsevier.com/retrieve/pii/S0277953616305093",
    "volume": "168",
    "author": [
      {
        "family": "Aronson",
        "given": "Brian"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2016",
          11
        ]
      ]
    }
  },
  {
    "id": "schaeferDynamicModelUS2012",
    "type": "article-journal",
    "container-title": "American journal of public health",
    "issue": "6",
    "note": "publisher: American Public Health Association",
    "page": "e12–e18",
    "source": "Google Scholar",
    "title": "A dynamic model of US adolescents’ smoking and friendship networks",
    "volume": "102",
    "author": [
      {
        "family": "Schaefer",
        "given": "David R."
      },
      {
        "family": "Haas",
        "given": "Steven A."
      },
      {
        "family": "Bishop",
        "given": "Nicholas J."
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2012"
        ]
      ]
    }
  },
  {
    "id": "delahayeSmokingDiffusionNetworks2019",
    "type": "article-journal",
    "abstract": "This study uses recent data to investigate if smoking initiation diffuses through friendship networks over the high school period and explores if diffusion processes differ across schools. One thousand four hundred and twenty-five racially and ethnically diverse youth from four high schools in Los Angeles were surveyed four times over the high school period from 2010 to 2013. Probit regression models and stochastic actor-based models for network dynamics tested for peer effects on smoking initiation. Friend smoking was found to predict adolescent smoking, and smoking initiation diffused through friendship networks in some but not all of the schools. School differences in smoking rates and the popularity of smokers may be linked to differences in the diffusion of smoking through peer networks. We conclude that there are differences in peer effects on smoking initiation across schools that will be important to account for in network-based smoking interventions.",
    "container-title": "Journal of Health and Social Behavior",
    "DOI": "10.1177/0022146519870521",
    "ISSN": "0022-1465, 2150-6000",
    "issue": "3",
    "journalAbbreviation": "J Health Soc Behav",
    "language": "en",
    "page": "362-376",
    "source": "DOI.org (Crossref)",
    "title": "Smoking Diffusion through Networks of Diverse, Urban American Adolescents over the High School Period",
    "URL": "http://journals.sagepub.com/doi/10.1177/0022146519870521",
    "volume": "60",
    "author": [
      {
        "family": "De La Haye",
        "given": "Kayla"
      },
      {
        "family": "Shin",
        "given": "Heesung"
      },
      {
        "family": "Vega Yon",
        "given": "George G."
      },
      {
        "family": "Valente",
        "given": "Thomas W."
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2019",
          9
        ]
      ]
    }
  },
  {
    "id": "huangInterplayFriendshipNetworks2014",
    "type": "article-journal",
    "abstract": "Objectives. We examined the coevolution of adolescent friendships and peer influences with respect to their risk behaviors and social networking site use.\n            Methods. Investigators of the Social Network Study collected longitudinal data during fall 2010 and spring 2011 from 10th-grade students in 5 Southern California high schools (n = 1434). We used meta-analyses of stochastic actor-based models to estimate changes in friendship ties and risk behaviors and the effects of Facebook and MySpace use.\n            Results. Significant shifts in adolescent smoking and drinking occurred despite little change in overall prevalence rates. Students with higher levels of alcohol use were more likely to send and receive friendship nominations and become friends with other drinkers. They were also more likely to increase alcohol use if their friends drank more. Adolescents selected friends with similar Facebook and MySpace use habits. Exposure to friends’ risky online pictures increased smoking behaviors but had no significant effects on alcohol use.\n            Conclusions. Our findings support a greater focus on friendship selection mechanisms in school-based alcohol use interventions. Social media platforms may help identify at-risk adolescent groups and foster positive norms about risk behaviors.",
    "container-title": "American Journal of Public Health",
    "DOI": "10.2105/AJPH.2014.302038",
    "ISSN": "0090-0036, 1541-0048",
    "issue": "8",
    "journalAbbreviation": "Am J Public Health",
    "language": "en",
    "page": "e51-e59",
    "source": "DOI.org (Crossref)",
    "title": "The Interplay of Friendship Networks and Social Networking Sites: Longitudinal Analysis of Selection and Influence Effects on Adolescent Smoking and Alcohol Use",
    "title-short": "The Interplay of Friendship Networks and Social Networking Sites",
    "URL": "https://ajph.aphapublications.org/doi/full/10.2105/AJPH.2014.302038",
    "volume": "104",
    "author": [
      {
        "family": "Huang",
        "given": "Grace C."
      },
      {
        "family": "Soto",
        "given": "Daniel"
      },
      {
        "family": "Fujimoto",
        "given": "Kayo"
      },
      {
        "family": "Valente",
        "given": "Thomas W."
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2014",
          8
        ]
      ]
    }
  },
  {
    "id": "kiuruPressureDrinkNot2010",
    "type": "article-journal",
    "abstract": "ABSTRACT\n            \n              This paper examined the relative influence of selection and socialization on alcohol and tobacco use in adolescent peer networks and peer groups. The sample included 1419 Finnish secondary education students (690 males and 729 females, mean age 16 years at the outset) from nine schools. Participants identified three school friends and described their alcohol and tobacco use on two occasions one year apart. Actor‐based models simultaneously examined changes in peer network ties and changes in individual behaviors for all participants within each school. Multi‐level analyses examined changes in individual behaviors for adolescents entering new peer groups and adolescents in stable peer groups, both of which were embedded within the school‐based peer networks. Similar results emerged from both analytic methods:\n              Selection\n              and\n              socialization\n              contributed to similarity of alcohol use, but only\n              selection\n              was a factor in tobacco use.",
    "container-title": "Journal of Adolescence",
    "DOI": "10.1016/j.adolescence.2010.07.006",
    "ISSN": "0140-1971, 1095-9254",
    "issue": "6",
    "journalAbbreviation": "Journal of Adolescence",
    "language": "en",
    "page": "801-812",
    "source": "DOI.org (Crossref)",
    "title": "Pressure to drink but not to smoke: Disentangling selection and socialization in adolescent peer networks and peer groups",
    "title-short": "Pressure to drink but not to smoke",
    "URL": "https://onlinelibrary.wiley.com/doi/10.1016/j.adolescence.2010.07.006",
    "volume": "33",
    "author": [
      {
        "family": "Kiuru",
        "given": "Noona"
      },
      {
        "family": "Burk",
        "given": "William J."
      },
      {
        "family": "Laursen",
        "given": "Brett"
      },
      {
        "family": "Salmela‐Aro",
        "given": "Katariina"
      },
      {
        "family": "Nurmi",
        "given": "Jari‐Erik"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2010",
          12
        ]
      ]
    }
  },
  {
    "id": "merckenChoosingAdolescentSmokers2013",
    "type": "article-journal",
    "abstract": "ABSTRACT\n            The present study examined whether parenting and parental smoking can prevent children from selecting smoking friends during adolescence. 254 Adolescents of one Belgian secondary school participated. Self‐administered questionnaires were distributed among 2nd–4th graders (mean ages = 14.2–16.2 years) during spring 2006. Follow‐up was conducted 12 months later. Data was analyzed conducting longitudinal social network analyses. Results showed adolescents perceiving high parental psychological control had a significant higher tendency to select smoking friends. Perceived behavioral control and perceived parental support did not affect the selection of smoking friends. Furthermore, maternal smoking behavior affected the selection of smoking friends, although no effect of paternal smoking behavior on the selection of smoking friends was found. Adolescent smoking prevention efforts should focus on the influence of parents through their smoking behavior and their psychological control to decrease adolescents' tendency to select smoking friends resulting in fewer opportunities for negative peer influences to occur.",
    "container-title": "Journal of Adolescence",
    "DOI": "10.1016/j.adolescence.2012.12.004",
    "ISSN": "0140-1971, 1095-9254",
    "issue": "2",
    "journalAbbreviation": "Journal of Adolescence",
    "language": "en",
    "page": "383-392",
    "source": "DOI.org (Crossref)",
    "title": "Choosing adolescent smokers as friends: The role of parenting and parental smoking",
    "title-short": "Choosing adolescent smokers as friends",
    "URL": "https://onlinelibrary.wiley.com/doi/10.1016/j.adolescence.2012.12.004",
    "volume": "36",
    "author": [
      {
        "family": "Mercken",
        "given": "L."
      },
      {
        "family": "Sleddens",
        "given": "E.F.C."
      },
      {
        "family": "De Vries",
        "given": "H."
      },
      {
        "family": "Steglich",
        "given": "C.E.G."
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2013",
          4
        ]
      ]
    }
  },
  {
    "id": "zalkPeerContagionAdolescent2010",
    "type": "article-journal",
    "container-title": "Journal of Clinical Child & Adolescent Psychology",
    "DOI": "10.1080/15374416.2010.517164",
    "ISSN": "1537-4416, 1537-4424",
    "issue": "6",
    "journalAbbreviation": "Journal of Clinical Child & Adolescent Psychology",
    "language": "en",
    "page": "837-848",
    "source": "DOI.org (Crossref)",
    "title": "Peer Contagion and Adolescent Depression: The Role of Failure Anticipation",
    "title-short": "Peer Contagion and Adolescent Depression",
    "URL": "http://www.tandfonline.com/doi/abs/10.1080/15374416.2010.517164",
    "volume": "39",
    "author": [
      {
        "family": "Zalk",
        "given": "Maarten Herman Walter Van"
      },
      {
        "family": "Kerr",
        "given": "Margaret"
      },
      {
        "family": "Branje",
        "given": "Susan J. T."
      },
      {
        "family": "Stattin",
        "given": "Håkan"
      },
      {
        "family": "Meeus",
        "given": "Wim H. J."
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2010",
          11,
          11
        ]
      ]
    }
  },
  {
    "id": "delahayeHowPhysicalActivity2011",
    "type": "article-journal",
    "container-title": "Social Science & Medicine",
    "DOI": "10.1016/j.socscimed.2011.06.023",
    "ISSN": "02779536",
    "issue": "5",
    "journalAbbreviation": "Social Science & Medicine",
    "language": "en",
    "page": "719-728",
    "source": "DOI.org (Crossref)",
    "title": "How physical activity shapes, and is shaped by, adolescent friendships",
    "URL": "https://linkinghub.elsevier.com/retrieve/pii/S0277953611003790",
    "volume": "73",
    "author": [
      {
        "family": "De La Haye",
        "given": "Kayla"
      },
      {
        "family": "Robins",
        "given": "Garry"
      },
      {
        "family": "Mohr",
        "given": "Philip"
      },
      {
        "family": "Wilson",
        "given": "Carlene"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2011",
          9
        ]
      ]
    }
  },
  {
    "id": "jugertEffectsEthnicMinority2018",
    "type": "article-journal",
    "container-title": "Journal of Research on Adolescence",
    "DOI": "10.1111/jora.12337",
    "ISSN": "10508392",
    "issue": "2",
    "journalAbbreviation": "J Res Adolesc",
    "language": "en",
    "page": "379-395",
    "source": "DOI.org (Crossref)",
    "title": "The Effects of Ethnic Minority Adolescents' Ethnic Self-Identification on Friendship Selection",
    "URL": "https://onlinelibrary.wiley.com/doi/10.1111/jora.12337",
    "volume": "28",
    "author": [
      {
        "family": "Jugert",
        "given": "Philipp"
      },
      {
        "family": "Leszczensky",
        "given": "Lars"
      },
      {
        "family": "Pink",
        "given": "Sebastian"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2018",
          6
        ]
      ]
    }
  },
  {
    "id": "mehraCoevolutionFriendshipLeadership2009",
    "type": "article-journal",
    "container-title": "Predator's game-changing designs: Research-based tools",
    "page": "145–162",
    "source": "Google Scholar",
    "title": "The coevolution of friendship and leadership networks in small groups",
    "author": [
      {
        "family": "Mehra",
        "given": "Ajay"
      },
      {
        "family": "Marineau",
        "given": "Josh"
      },
      {
        "family": "Lopes",
        "given": "A."
      },
      {
        "family": "Dass",
        "given": "T."
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2009"
        ]
      ]
    }
  },
  {
    "id": "kretschmerInGroupBiasOutGroup2022",
    "type": "article-journal",
    "abstract": "Abstract\n            Even in diverse schools that provide opportunities for interreligious friendships, Muslim youth disproportionally tend to be friends with Muslims rather than non-Muslims. Echoing broader debates about minorities’ self-segregation versus exclusion by majority group members, a key question is whether religious friendship segregation arises because of Muslims’ in-group bias or because of non-Muslims’ reluctance to befriend them. We suggest that the answer differs for Muslim boys and girls. Building on research on interreligious romantic relations and accounts of the lives of young Muslims and other ethno-religious minorities in Western societies, we propose that religious in-group bias is stronger for Muslim girls than for Muslim boys. Conversely, we expect non-Muslim youth to be more open to befriend Muslim girls than Muslim boys. Applying stochastic actor-oriented models of network dynamics to large-scale longitudinal data of friendship networks in German schools, we find that Muslim girls indeed have a strong in-group bias, whereas non-Muslim youth are not reluctant to be friends with them. Muslim boys, by contrast, have a much weaker in-group bias, but non-Muslim youth are less willing to be friends with them rather than with non-Muslims. A simulation analysis demonstrates that these gendered individual-level processes result in comparable aggregate patterns of friendship segregation among Muslim boys and girls. Religious friendship segregation thus arises because Muslim girls tend to self-segregate and non-Muslim youth are less willing to befriend Muslim boys although the latter are open to interreligious friendships. This gendered friendship-making behavior has implications for the larger question of minority social integration.",
    "container-title": "Social Forces",
    "DOI": "10.1093/sf/soab029",
    "ISSN": "0037-7732, 1534-7605",
    "issue": "3",
    "language": "en",
    "page": "1307-1332",
    "source": "DOI.org (Crossref)",
    "title": "In-Group Bias or Out-Group Reluctance? The Interplay of Gender and Religion in Creating Religious Friendship Segregation among Muslim Youth",
    "title-short": "In-Group Bias or Out-Group Reluctance?",
    "URL": "https://academic.oup.com/sf/article/100/3/1307/6225741",
    "volume": "100",
    "author": [
      {
        "family": "Kretschmer",
        "given": "David"
      },
      {
        "family": "Leszczensky",
        "given": "Lars"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2022",
          1,
          10
        ]
      ]
    }
  },
  {
    "id": "dijkstraTestingThreeExplanations2012",
    "type": "article-journal",
    "container-title": "Journal of Adolescent Health",
    "DOI": "10.1016/j.jadohealth.2011.08.010",
    "ISSN": "1054139X",
    "issue": "4",
    "journalAbbreviation": "Journal of Adolescent Health",
    "language": "en",
    "page": "371-376",
    "source": "DOI.org (Crossref)",
    "title": "Testing Three Explanations of the Emergence of Weapon Carrying in Peer Context: The Roles of Aggression, Victimization, and the Social Network",
    "title-short": "Testing Three Explanations of the Emergence of Weapon Carrying in Peer Context",
    "URL": "https://linkinghub.elsevier.com/retrieve/pii/S1054139X11002850",
    "volume": "50",
    "author": [
      {
        "family": "Dijkstra",
        "given": "Jan Kornelis"
      },
      {
        "family": "Gest",
        "given": "Scott D."
      },
      {
        "family": "Lindenberg",
        "given": "Siegwart"
      },
      {
        "family": "Veenstra",
        "given": "René"
      },
      {
        "family": "Cillessen",
        "given": "Antonius H.N."
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2012",
          4
        ]
      ]
    }
  },
  {
    "id": "ferligojScientificCollaborationDynamics2015",
    "type": "article-journal",
    "abstract": "This paper examines the collaboration structures and dynamics of the co-authorship network of all Slovenian researchers. Its goal is to identify the key factors driving collaboration and the main differences in collaboration behavior across scientific fields and disciplines. Two approaches to modelling network dynamics are combined in this paper: the small-world model and the mechanism of preferential attachment, also known as the process of cumulative advantage. Stochastic-actor-based modelling of co-authorship network dynamics uses data for the complete longitudinal co-authorship networks for the entire Slovenian scientific community from 1996 to 2010. We confirmed the presence of clustering in all fields and disciplines. Preferential attachment is far more complex than a single global mechanism. There were two clear distinctions regarding collaboration within scientific fields and disciplines. One was that some fields had an internal national saturation inhibiting further collaboration. The second concerned the differential impact of collaboration with scientists from abroad on domestic collaboration. In the natural, technical, medical, and biotechnical sciences, this promotes collaboration within the Slovenian scientific community while in the social sciences and humanities this inhibits internal collaboration.",
    "container-title": "Scientometrics",
    "DOI": "10.1007/s11192-015-1585-7",
    "ISSN": "1588-2861",
    "issue": "3",
    "journalAbbreviation": "Scientometrics",
    "language": "en",
    "page": "985-1012",
    "source": "Springer Link",
    "title": "Scientific collaboration dynamics in a national scientific system",
    "URL": "https://doi.org/10.1007/s11192-015-1585-7",
    "volume": "104",
    "author": [
      {
        "family": "Ferligoj",
        "given": "Anuška"
      },
      {
        "family": "Kronegger",
        "given": "Luka"
      },
      {
        "family": "Mali",
        "given": "Franc"
      },
      {
        "family": "Snijders",
        "given": "Tom A. B."
      },
      {
        "family": "Doreian",
        "given": "Patrick"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2015",
          9,
          1
        ]
      ]
    }
  },
  {
    "id": "kroneggerCollaborationStructuresSlovenian2012",
    "type": "article-journal",
    "container-title": "Scientometrics",
    "DOI": "10.1007/s11192-011-0493-8",
    "ISSN": "0138-9130, 1588-2861",
    "issue": "2",
    "journalAbbreviation": "Scientometrics",
    "language": "en",
    "page": "631-647",
    "source": "DOI.org (Crossref)",
    "title": "Collaboration structures in Slovenian scientific communities",
    "URL": "http://link.springer.com/10.1007/s11192-011-0493-8",
    "volume": "90",
    "author": [
      {
        "family": "Kronegger",
        "given": "Luka"
      },
      {
        "family": "Mali",
        "given": "Franc"
      },
      {
        "family": "Ferligoj",
        "given": "Anuška"
      },
      {
        "family": "Doreian",
        "given": "Patrick"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2012",
          2
        ]
      ]
    }
  },
  {
    "id": "vermondEvolutionCoevolutionPrimary2022",
    "type": "article-journal",
    "abstract": "Academic networks are expected to enhance scientific collaboration and thereby increase research outputs. However, little is known about whether and how the initial steps of getting to know other researchers translates into effective collaborations. In this paper, we investigate the evolution and co-evolution of an academic social network and a collaborative research network (using co-authorship as a proxy measure of the latter), and simultaneously examine the effect of individual researcher characteristics (e.g. gender, seniority or workplace) on their evolving relationships. We used longitudinal data from an international network in primary care cancer research: the CanTest Collaborative (CanTest). Surveys were distributed amongst CanTest researchers to map who knows who (the ‘academic social network’). Co-authorship relations were derived from Scopus (the ‘collaborative network’). Stochastic actor-oriented models were employed to investigate the evolution and co-evolution of both networks. Visualizing the development of the CanTest network revealed that researchers within CanTest get to know each other quickly and also start collaborating over time (evolution of the academic social network and collaborative network respectively). Results point to a stable and solid academic social network that is particularly encouraging towards more junior researchers; yet differing for male and female researchers (the effect of individual researcher characteristics). Moreover, although the academic social network and the research collaborations do not grow at the same pace, the benefit of creating academic social relationships to stimulate effective research collaboration is clearly demonstrated (co-evolution of both networks).",
    "container-title": "PLOS ONE",
    "DOI": "10.1371/journal.pone.0272255",
    "ISSN": "1932-6203",
    "issue": "7",
    "journalAbbreviation": "PLoS ONE",
    "language": "en",
    "page": "e0272255",
    "source": "DOI.org (Crossref)",
    "title": "The evolution and co-evolution of a primary care cancer research network: From academic social connection to research collaboration",
    "title-short": "The evolution and co-evolution of a primary care cancer research network",
    "URL": "https://dx.plos.org/10.1371/journal.pone.0272255",
    "volume": "17",
    "author": [
      {
        "family": "Vermond",
        "given": "Debbie"
      },
      {
        "family": "De Groot",
        "given": "Esther"
      },
      {
        "family": "Sills",
        "given": "Valerie A."
      },
      {
        "family": "Lyratzopoulos",
        "given": "Georgios"
      },
      {
        "family": "Walter",
        "given": "Fiona M."
      },
      {
        "family": "De Wit",
        "given": "Niek J."
      },
      {
        "family": "Rubin",
        "given": "Greg"
      }
    ],
    "editor": [
      {
        "family": "Vousden",
        "given": "George"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2022",
          7,
          29
        ]
      ]
    }
  },
  {
    "id": "roeslerRoleUniversitiesNetwork2017",
    "type": "article-journal",
    "abstract": "This paper contributes to the growing literature on knowledge network evolution. It provides an analysis of the role universities play in a network emerging from the joint participation of organizations in R&D projects subsidized by public authorities. In addition to theorizing universities’ effect on network formation processes, the paper includes an empirical study identifying the main drivers behind the formation of the subsidized network of R&D collaboration in the German biotechnology industry.",
    "container-title": "Review of Regional Research",
    "DOI": "10.1007/s10037-017-0118-7",
    "ISSN": "1613-9836",
    "issue": "2",
    "journalAbbreviation": "Rev Reg Res",
    "language": "en",
    "page": "135-160",
    "source": "Springer Link",
    "title": "The role of universities in a network of subsidized R&D collaboration: The case of the biotechnology-industry in Germany",
    "title-short": "The role of universities in a network of subsidized R&D collaboration",
    "URL": "https://doi.org/10.1007/s10037-017-0118-7",
    "volume": "37",
    "author": [
      {
        "family": "Roesler",
        "given": "Christoph"
      },
      {
        "family": "Broekel",
        "given": "Tom"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2017",
          10,
          1
        ]
      ]
    }
  },
  {
    "id": "chenNetworkDynamicsUniversityindustry2022",
    "type": "article-journal",
    "container-title": "Scientometrics",
    "DOI": "10.1007/s11192-022-04330-9",
    "ISSN": "0138-9130, 1588-2861",
    "issue": "11",
    "journalAbbreviation": "Scientometrics",
    "language": "en",
    "page": "6637-6660",
    "source": "DOI.org (Crossref)",
    "title": "Network dynamics in university-industry collaboration: a collaboration-knowledge dual-layer network perspective",
    "title-short": "Network dynamics in university-industry collaboration",
    "URL": "https://link.springer.com/10.1007/s11192-022-04330-9",
    "volume": "127",
    "author": [
      {
        "family": "Chen",
        "given": "Hongshu"
      },
      {
        "family": "Song",
        "given": "Xinna"
      },
      {
        "family": "Jin",
        "given": "Qianqian"
      },
      {
        "family": "Wang",
        "given": "Ximeng"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2022",
          11
        ]
      ]
    }
  },
  {
    "id": "matveevaScientificCollaborationRussian2020",
    "type": "article-journal",
    "abstract": "Changes in patterns of collaboration between Russian universities after the commencement of the Russian university excellence initiative (Project 5-100) are studied in this paper. While this project aimed to make leading Russian universities more globally competitive and improve their research productivity, it also happened to increase their cooperation. An analysis of affiliations and the co-authorship networks was conducted to explore scientific collaborations between and within the participating universities. Such analysis facilitates the investigation of the number of collaborations with other organizations, both domestic and international cooperation, and disciplinary differences. By analyzing the co-authorship networks, the position of universities in the academic network and the structure of collaborations among the participants were examined. A sample of 30 Russian universities, including participants in Project 5-100 and a control group of institutions with similar characteristics, was used. After joining the project, the participating universities increased both their cooperation with each other as well as with foreign universities and research institutions of the Russian Academy of Sciences, especially in the high-quality segment. At the same time, the collaboration patterns of non-participating universities did not change significantly. The centrality of Project 5-100 universities in the global academic network has increased, along with their visibility and coupling in the national network. The historical division between university and academic sectors has diminished, while the participating universities have started to play a more important role in knowledge production within the country.",
    "container-title": "Scientometrics",
    "DOI": "10.1007/s11192-020-03602-6",
    "ISSN": "1588-2861",
    "issue": "3",
    "journalAbbreviation": "Scientometrics",
    "language": "en",
    "page": "2383-2407",
    "source": "Springer Link",
    "title": "Scientific collaboration in Russian universities before and after the excellence initiative Project 5-100",
    "URL": "https://doi.org/10.1007/s11192-020-03602-6",
    "volume": "124",
    "author": [
      {
        "family": "Matveeva",
        "given": "Nataliya"
      },
      {
        "family": "Ferligoj",
        "given": "Anuška"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2020",
          9,
          1
        ]
      ]
    }
  },
  {
    "id": "destefanoNETWORKEFFECTINDIVIDUAL",
    "type": "article-journal",
    "container-title": "Book of Short Papers",
    "page": "162",
    "source": "Google Scholar",
    "title": "NETWORK EFFECT ON INDIVIDUAL SCIENTIFIC PERFORMANCE: A LONGITUDINAL STUDY ON AN ITALIAN SCIENTIFIC COMMUNITY",
    "title-short": "NETWORK EFFECT ON INDIVIDUAL SCIENTIFIC PERFORMANCE",
    "author": [
      {
        "family": "De Stefano",
        "given": "Domenico"
      },
      {
        "family": "Giordano",
        "given": "Giuseppe"
      },
      {
        "family": "Zaccarin",
        "given": "Susanna"
      }
    ]
  },
  {
    "id": "leeAnalysisCollaborativeNetwork2017",
    "type": "article-journal",
    "container-title": "HUSO 2017",
    "page": "37",
    "source": "Google Scholar",
    "title": "An Analysis of the Collaborative Network Mechanism Based on the Dynamic Network",
    "author": [
      {
        "family": "Lee",
        "given": "Hyejin"
      },
      {
        "family": "Lee",
        "given": "Seok-Hyoung"
      },
      {
        "family": "Kim",
        "given": "Kwang-Young"
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2017"
        ]
      ]
    }
  },
  {
    "id": "lungeanuEffectsDiversityNetwork2015",
    "type": "article-journal",
    "abstract": "This study examines the influence of different types of diversity, both observable and unobservable, on the creation of innovative ideas. Our framework draws on theory and research on information processing, social categorization, coordination, and homophily to posit the influence of cognitive, gender, and country diversity on innovation. Our longitudinal model is based on a unique data set of 1,354 researchers who helped create the new scientific field of oncofertility, by collaborating on 469 publications over a 4-year period. We capture the differences among researchers along cognitive, country, and gender dimensions, as well as examine how the resulting diversity or homophily influences the formation of collaborative innovation networks. We find that innovation, operationalized as publishing in a new scientific discipline, benefits from both homophily and diversity. Homophily in country of residence and working with prior collaborators help reduce uncertainty in the interactions associated with innovation, while diversity in knowledge enables the recombinant knowledge required for innovation.",
    "container-title": "American Behavioral Scientist",
    "DOI": "10.1177/0002764214556804",
    "ISSN": "0002-7642, 1552-3381",
    "issue": "5",
    "journalAbbreviation": "American Behavioral Scientist",
    "language": "en",
    "page": "548-564",
    "source": "DOI.org (Crossref)",
    "title": "The Effects of Diversity and Network Ties on Innovations: The Emergence of a New Scientific Field",
    "title-short": "The Effects of Diversity and Network Ties on Innovations",
    "URL": "http://journals.sagepub.com/doi/10.1177/0002764214556804",
    "volume": "59",
    "author": [
      {
        "family": "Lungeanu",
        "given": "Alina"
      },
      {
        "family": "Contractor",
        "given": "Noshir S."
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2015",
          5
        ]
      ]
    }
  },
  {
    "id": "liangEvolutionGovernmentSponsored2018",
    "type": "article-journal",
    "container-title": "Research Policy",
    "DOI": "10.1016/j.respol.2018.04.012",
    "ISSN": "00487333",
    "issue": "7",
    "journalAbbreviation": "Research Policy",
    "language": "en",
    "page": "1295-1308",
    "source": "DOI.org (Crossref)",
    "title": "The evolution of government sponsored collaboration network and its impact on innovation: A bibliometric analysis in the Chinese solar PV sector",
    "title-short": "The evolution of government sponsored collaboration network and its impact on innovation",
    "URL": "https://linkinghub.elsevier.com/retrieve/pii/S0048733318300933",
    "volume": "47",
    "author": [
      {
        "family": "Liang",
        "given": "Xinning"
      },
      {
        "family": "Liu",
        "given": "Anita M.M."
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2018",
          9
        ]
      ]
    }
  },
  {
    "id": "ingoldDriversCollaborationMitigate2014",
    "type": "article-journal",
    "container-title": "Global Environmental Change",
    "DOI": "10.1016/j.gloenvcha.2013.11.021",
    "ISSN": "09593780",
    "journalAbbreviation": "Global Environmental Change",
    "language": "en",
    "page": "88-98",
    "source": "DOI.org (Crossref)",
    "title": "Drivers of collaboration to mitigate climate change: An illustration of Swiss climate policy over 15 years",
    "title-short": "Drivers of collaboration to mitigate climate change",
    "URL": "https://linkinghub.elsevier.com/retrieve/pii/S095937801300229X",
    "volume": "24",
    "author": [
      {
        "family": "Ingold",
        "given": "Karin"
      },
      {
        "family": "Fischer",
        "given": "Manuel"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2014",
          1
        ]
      ]
    }
  },
  {
    "id": "kinneDependentDiplomacySignaling2014",
    "type": "article-journal",
    "container-title": "International Studies Quarterly",
    "DOI": "10.1111/isqu.12047",
    "ISSN": "00208833",
    "issue": "2",
    "journalAbbreviation": "Int Stud Q",
    "language": "en",
    "page": "247-259",
    "source": "DOI.org (Crossref)",
    "title": "Dependent Diplomacy: Signaling, Strategy, and Prestige in the Diplomatic Network",
    "title-short": "Dependent Diplomacy",
    "URL": "https://academic.oup.com/isq/article-lookup/doi/10.1111/isqu.12047",
    "volume": "58",
    "author": [
      {
        "family": "Kinne",
        "given": "Brandon J"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2014",
          6
        ]
      ]
    }
  },
  {
    "id": "berardoSelfOrganizingPolicyNetworks2010",
    "type": "article-journal",
    "container-title": "American Journal of Political Science",
    "DOI": "10.1111/j.1540-5907.2010.00451.x",
    "ISSN": "00925853, 15405907",
    "issue": "3",
    "language": "en",
    "page": "632-649",
    "source": "DOI.org (Crossref)",
    "title": "Self-Organizing Policy Networks: Risk, Partner Selection, and Cooperation in Estuaries: SELF-ORGANIZING POLICY NETWORKS",
    "title-short": "Self-Organizing Policy Networks",
    "URL": "https://onlinelibrary.wiley.com/doi/10.1111/j.1540-5907.2010.00451.x",
    "volume": "54",
    "author": [
      {
        "family": "Berardo",
        "given": "Ramiro"
      },
      {
        "family": "Scholz",
        "given": "John T."
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2010",
          6,
          21
        ]
      ]
    }
  },
  {
    "id": "kinneNetworkDynamicsEvolution2013",
    "type": "article-journal",
    "abstract": "Cooperation helps states realize mutual gains, but mistrust and disagreements over institutional design inhibit cooperation. This article develops a network explanation for how states achieve cooperation in the face of persistent coordination and collaboration problems. The analysis focuses on bilateral cooperation agreements, a vast body of treaties spanning multiple issue areas. Bilateral agreements constitute an evolving network of cooperative ties. This network defines the strategic environment in which states bargain over new agreements, endogenously influencing subsequent bilateral endeavors by revealing strategically valuable information about states’ trustworthiness and preferences over institutional design, while also generating externalities that incentivize bilateral partnerships. Inferential network analysis shows that states are more likely to create bilateral agreements if they (1) share agreements with common third parties, (2) accede to more agreements in general, and/or (3) share important exogenous characteristics with current bilateral partners. These network dynamics drive bilateral cooperation in everything from commodities to cultural exchange to fisheries.",
    "container-title": "American Political Science Review",
    "DOI": "10.1017/S0003055413000440",
    "ISSN": "0003-0554, 1537-5943",
    "issue": "4",
    "journalAbbreviation": "Am Polit Sci Rev",
    "language": "en",
    "page": "766-785",
    "source": "DOI.org (Crossref)",
    "title": "Network Dynamics and the Evolution of International Cooperation",
    "URL": "https://www.cambridge.org/core/product/identifier/S0003055413000440/type/journal_article",
    "volume": "107",
    "author": [
      {
        "family": "Kinne",
        "given": "Brandon J"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          15
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2013",
          11
        ]
      ]
    }
  },
  {
    "id": "thurnerEuropeanUnionTransgovernmental2009",
    "type": "article-journal",
    "container-title": "European Journal of Political Research",
    "DOI": "10.1111/j.1475-6765.2008.00825.x",
    "ISSN": "03044130, 14756765",
    "issue": "1",
    "language": "en",
    "page": "80-106",
    "source": "DOI.org (Crossref)",
    "title": "European Union transgovernmental networks: The emergence of a new political space beyond the nation-state?",
    "title-short": "European Union transgovernmental networks",
    "URL": "https://onlinelibrary.wiley.com/doi/10.1111/j.1475-6765.2008.00825.x",
    "volume": "48",
    "author": [
      {
        "family": "Thurner",
        "given": "Paul W."
      },
      {
        "family": "Binder",
        "given": "Martin"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          16
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2009",
          1
        ]
      ]
    }
  },
  {
    "id": "snijdersModelingCoevolutionNetworks2007",
    "type": "article-journal",
    "container-title": "Longitudinal models in the behavioral and related sciences",
    "issue": "4",
    "page": "41–71",
    "source": "Google Scholar",
    "title": "Modeling the co-evolution of networks and behavior",
    "volume": "31",
    "author": [
      {
        "family": "Snijders",
        "given": "Tom AB"
      },
      {
        "family": "Steglich",
        "given": "Christian"
      },
      {
        "family": "Schweinberger",
        "given": "Michael"
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2007"
        ]
      ]
    }
  },
  {
    "id": "mohrenbergStudyingPolicyDiffusion2017",
    "type": "chapter",
    "container-title": "Networked Governance",
    "event-place": "Cham",
    "ISBN": "978-3-319-50384-4",
    "language": "en",
    "note": "DOI: 10.1007/978-3-319-50386-8_10",
    "page": "163-188",
    "publisher": "Springer International Publishing",
    "publisher-place": "Cham",
    "source": "DOI.org (Crossref)",
    "title": "Studying Policy Diffusion with Stochastic Actor-Oriented Models",
    "URL": "http://link.springer.com/10.1007/978-3-319-50386-8_10",
    "editor": [
      {
        "family": "Hollstein",
        "given": "Betina"
      },
      {
        "family": "Matiaske",
        "given": "Wenzel"
      },
      {
        "family": "Schnapp",
        "given": "Kai-Uwe"
      }
    ],
    "author": [
      {
        "family": "Mohrenberg",
        "given": "Steffen"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          16
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2017"
        ]
      ]
    }
  },
  {
    "id": "rhueDigitalAccessPolitical2014",
    "type": "article-journal",
    "abstract": "We examine the effects of digital access on the prevalence of democracy and its diffusion via trade, geographical and migration networks across 189 countries between 2000 and 2010. We find that different digital technologies may have varying impacts on freedom while affecting its diffusion via different political networks, and that related changes in civil liberties can be affected by both media freedom and internal political institutions. Our analysis suggests three key mechanisms linking information technology with democratic change and highlights the importance of a country's “susceptibility” to political influence that is triggered by greater digitally induced visibility.",
    "collection-title": "Special Issue on Political Networks",
    "container-title": "Social Networks",
    "DOI": "10.1016/j.socnet.2012.06.007",
    "ISSN": "0378-8733",
    "journalAbbreviation": "Social Networks",
    "page": "40-53",
    "source": "ScienceDirect",
    "title": "Digital access, political networks and the diffusion of democracy",
    "URL": "https://www.sciencedirect.com/science/article/pii/S0378873312000524",
    "volume": "36",
    "author": [
      {
        "family": "Rhue",
        "given": "Lauren"
      },
      {
        "family": "Sundararajan",
        "given": "Arun"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          16
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2014",
          1,
          1
        ]
      ]
    }
  },
  {
    "id": "redheadCoalitionsConflictLongitudinal2021",
    "type": "article-journal",
    "abstract": "Abstract\n            \n              \n                \n              \n            \n          , \n            Abstract\n            To negotiate conflict and navigate status hierarchy, individuals in many species form coalitions. We describe inter-personal conflicts and assess theories of coalition formation in a small-scale human society. Based on longitudinal and cross-sectional social network analysis of men in two communities of Tsimane forager–horticulturalists, we find evidence of reciprocity in coalitional support, as well as evidence of transitivity: an ally of my ally is likely to become my ally. We find mixed support for coalition formation between individuals who share a common adversary. Coalition formation was also predicted by food- and labour-sharing and especially by kinship. Physically formidable men and men higher in informal status were more likely to provide coalitional support over time; evidence was mixed that they receive more coalitional support. The highest status men are hubs of a dense coalitional support network that indirectly link all men in the community. These findings suggest that male coalition formation is multiply motivated, and in general reveals the political dynamics that structure men's lives in small, relatively egalitarian communities.",
    "container-title": "Evolutionary Human Sciences",
    "DOI": "10.1017/ehs.2021.26",
    "ISSN": "2513-843X",
    "journalAbbreviation": "Evolut. Hum. Sci.",
    "language": "en",
    "page": "e31",
    "source": "DOI.org (Crossref)",
    "title": "Coalitions and conflict: A longitudinal analysis of men's politics",
    "title-short": "Coalitions and conflict",
    "URL": "https://www.cambridge.org/core/product/identifier/S2513843X21000268/type/journal_article",
    "volume": "3",
    "author": [
      {
        "family": "Redhead",
        "given": "Daniel"
      },
      {
        "family": "Von Rueden",
        "given": "Christopher R."
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          16
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2021"
        ]
      ]
    }
  },
  {
    "id": "box-steffensmeierEventHistoryModeling2004",
    "type": "book",
    "publisher": "Cambridge University Press",
    "source": "Google Scholar",
    "title": "Event history modeling: A guide for social scientists",
    "title-short": "Event history modeling",
    "author": [
      {
        "family": "Box-Steffensmeier",
        "given": "Janet M."
      },
      {
        "family": "Jones",
        "given": "Bradford S."
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2004"
        ]
      ]
    }
  },
  {
    "id": "ceoldoStochasticActorOriented2023a",
    "type": "article-journal",
    "container-title": "arXiv preprint arXiv:2304.07312",
    "source": "Google Scholar",
    "title": "Stochastic Actor Oriented Model with Random Effects",
    "author": [
      {
        "family": "Ceoldo",
        "given": "Giacomo"
      },
      {
        "family": "Snijders",
        "given": "Tom AB"
      },
      {
        "family": "Wit",
        "given": "Ernst C."
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2023"
        ]
      ]
    }
  },
  {
    "id": "steglichStochasticNetworkModeling2022",
    "type": "article-journal",
    "container-title": "Handbook of rigorous theoretical and empirical sociology, Research Handbooks in Sociology Series",
    "page": "73–99",
    "source": "Google Scholar",
    "title": "Stochastic network modeling as generative social science",
    "author": [
      {
        "family": "Steglich",
        "given": "Christian EG"
      },
      {
        "family": "Snijders",
        "given": "Tom AB"
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2022"
        ]
      ]
    }
  },
  {
    "id": "dokukaStatisticheskieModeliDlya2015",
    "type": "article-journal",
    "abstract": "Research on co-evolution of networks and behavior became possible with the emergence of student performance and behavior dynamic data collection and storage tools, as well as with the development of new social network analysis methods. Dynamic network analysis answers the question, how specific forms of student behavior, like bad habits, develop and propagate. It is also helpful in following how school or university students enter into friendship or antagonism with each other, as well as in assessing the impact social relations have on academic performance. The paper gives a review of the two key methods used for empirical analysis of social network dynamics. Stochastic Actor-Oriented Models (SAOM) represent one of the most elaborated techniques of social network dynamics investigation. This approach regards the present state of a network as dependable on its preceding state uniquely. Network evolution appears to be continuous, not discrete, so that a structural macro change is, in fact, a multitude of micro changes. Instead of dealing with structure of the network and prerequisites for its development, the SAOM model studies the processes underlying any changes recorded. Separable Temporal Exponential Random Graph Models (STERGM) are an alternative approach towards research on social network dynamics. In this case, the social network observed is a materialization of one of possible networks with predetermined characteristics. Any network develops in the result of a stochastic process, and the research should be aimed at discovering what forces this process is driven by. Comparison of an empirically discovered network with networks of similar size reveals structural features of the network and characteristics of actors who influenced the process of its establishment. In this paper, we also give an example of how both models can be used with the same set of data.",
    "container-title": "Вопросы образования",
    "ISSN": "1814-9545",
    "issue": "1",
    "note": "number: 1\npublisher-place: Россия, Москва\npublisher: Федеральное государственное автономное образовательное учреждение высшего образования «Национальный исследовательский университет «Высшая школа экономики»",
    "page": "201-213",
    "source": "cyberleninka.ru",
    "title": "Статистические модели для анализа динамики социальных сетей в исследованиях образования",
    "URL": "https://cyberleninka.ru/article/n/statisticheskie-modeli-dlya-analiza-dinamiki-sotsialnyh-setey-v-issledovaniyah-obrazovaniya",
    "author": [
      {
        "family": "Докука",
        "given": "София Владимировна"
      },
      {
        "family": "Валеева",
        "given": "Диляра Рашитовна"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          16
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2015"
        ]
      ]
    }
  },
  {
    "id": "dokukaIspolzovanieStohasticheskihAktornoorientirovannyh2021",
    "type": "article-journal",
    "abstract": "Human behavior depends on many factors including the social environment. Over the past decades, scholars have actively developed models that evaluate the impact of the environment on the individual. This article describes stochastic actor-oriented modeling (SAOM) which allows to test hypotheses about the structural evolution of social networks, as well as to analyze the co-evolution of networks and behavior in detail. The authors present theoretical and methodological foundations of SAOM; specify requirements for research design and data collection; consider the specification of the model and an example of co-evolution of the network and academic achievement of students; point out limitations of the method, and suggest promising avenues for further research. The article concludes that using SAOM is preferable for small social networks with low rotation, in particular, for organizational units and study groups. The authors argue that the existing studies mainly consider the educational context and social networks of young people that does not allow to draw conclusions about the evolution of social ties in communities of a different type and other age groups. In addition, most of the research is based on data collected in Western democracies which indicates the need to investigate a variety of samples.",
    "container-title": "Мониторинг общественного мнения: экономические и социальные перемены",
    "ISSN": "1815-8617",
    "issue": "2",
    "note": "number: 2\npublisher-place: Россия, Москва\npublisher: Открытое акционерное общество «Всероссийский центр изучения общественного мнения»",
    "page": "273-285",
    "source": "cyberleninka.ru",
    "title": "Использование стохастических акторно-ориентированных моделей для анализа коэволюции сетей и поведения",
    "URL": "https://cyberleninka.ru/article/n/ispolzovanie-stohasticheskih-aktorno-orientirovannyh-modeley-dlya-analiza-koevolyutsii-setey-i-povedeniya",
    "author": [
      {
        "family": "Докука",
        "given": "София Владимировна"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          16
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2021"
        ]
      ]
    }
  },
  {
    "id": "kimStabilityEvaluationRussian2021",
    "type": "article-journal",
    "abstract": "This study deals with the stability evaluation of the online community of Russian sociologists. Based on the data from the Facebook group, which consists of 7 years of communication from 2011 till 2018, we constructed the networks based on commenting and reacting. The participants activity includes four main periods for stability evaluation of the community. The blockmodeling discloses the structural patterns of interactions in the community. The results show the \"core-periphery\" type of the global structure. The core and periphery are structured differently in the networks of comments and reactions. The stability between the positions in the global structure is high and while the structure may vary in some periods, the size of the core and periphery fluctuates. However, the stability within the positions of the global structure is low, according to the modified Rand index (Cugmas, Ferligoj, 2018).",
    "DOI": "10.48550/ARXIV.2110.08756",
    "license": "arXiv.org perpetual, non-exclusive license",
    "note": "publisher: arXiv\nversion: 1",
    "source": "DOI.org (Datacite)",
    "title": "Stability evaluation of the Russian sociologists online community: 2011-2018 years",
    "title-short": "Stability evaluation of the Russian sociologists online community",
    "URL": "https://arxiv.org/abs/2110.08756",
    "author": [
      {
        "family": "Kim",
        "given": "Aryuna"
      },
      {
        "family": "Maltseva",
        "given": "Daria"
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          16
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2021"
        ]
      ]
    }
  },
  {
    "id": "RelationalEventFramework",
    "type": "webpage",
    "title": "4. A Relational Event Framework for Social Action - Carter T. Butts, 2008",
    "URL": "https://journals.sagepub.com/doi/10.1111/j.1467-9531.2008.00203.x",
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          17
        ]
      ]
    }
  },
  {
    "id": "leifeldStochasticActororientedModel2022",
    "type": "article-journal",
    "container-title": "Network Science",
    "DOI": "10.1017/nws.2022.7",
    "ISSN": "2050-1242, 2050-1250",
    "issue": "1",
    "journalAbbreviation": "Net Sci",
    "language": "en",
    "page": "15-19",
    "source": "DOI.org (Crossref)",
    "title": "The stochastic actor-oriented model is a theory as much as it is a method and must be subject to theory tests",
    "URL": "https://www.cambridge.org/core/product/identifier/S2050124222000078/type/journal_article",
    "volume": "10",
    "author": [
      {
        "family": "Leifeld",
        "given": "Philip"
      },
      {
        "family": "Cranmer",
        "given": "Skyler J."
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          9,
          17
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2022",
          3
        ]
      ]
    }
  },
  {
    "id": "leifeldTheoreticalEmpiricalComparison2019",
    "type": "article-journal",
    "container-title": "Network science",
    "issue": "1",
    "note": "publisher: Cambridge University Press",
    "page": "20–51",
    "source": "Google Scholar",
    "title": "A theoretical and empirical comparison of the temporal exponential random graph model and the stochastic actor-oriented model",
    "volume": "7",
    "author": [
      {
        "family": "Leifeld",
        "given": "Philip"
      },
      {
        "family": "Cranmer",
        "given": "Skyler J."
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2019"
        ]
      ]
    }
  },
  {
    "id": "batagelj",
    "abstract": "Large networks, having thousands of vertices and lines, can be found in many different areas, e. g: genealogies, ﬂow graphs of programs, molecule, computer networks, transportation networks, social networks, intra/inter organisational networks ... Many standard network algorithms are very time and space consuming and therefore unsuitable for analysis of such networks. In the article we present some approaches to analysis and visualisation of large networks implemented in program Pajek. Some typical examples are also given.",
    "author": [
      {
        "family": "Batagelj",
        "given": "Vladimir"
      },
      {
        "family": "Mrvar",
        "given": "Andrej"
      }
    ],
    "citation-key": "batagelj",
    "language": "en",
    "source": "Zotero",
    "title": "Pajek – Program for Large Network Analysis",
    "type": "article-journal"
  },
  {
    "id": "borgatti2009",
    "abstract": "Over the past decade, there has been an explosion of interest in network research across the physical and social sciences. For social scientists, the theory of networks has been a gold mine, yielding explanations for social phenomena in a wide variety of disciplines from psychology to economics. Here, we review the kinds of things that social scientists have tried to explain using social network analysis and provide a nutshell description of the basic assumptions, goals, and explanatory mechanisms prevalent in the field. We hope to contribute to a dialogue among researchers from across the physical and social sciences who share a common interest in understanding the antecedents and consequences of network phenomena.",
    "accessed": {
      "date-parts": [
        [
          2023,
          6,
          22
        ]
      ]
    },
    "author": [
      {
        "family": "Borgatti",
        "given": "Stephen P."
      },
      {
        "family": "Mehra",
        "given": "Ajay"
      },
      {
        "family": "Brass",
        "given": "Daniel J."
      },
      {
        "family": "Labianca",
        "given": "Giuseppe"
      }
    ],
    "citation-key": "borgatti2009",
    "container-title": "Science",
    "container-title-short": "Science",
    "DOI": "10.1126/science.1165821",
    "ISSN": "0036-8075, 1095-9203",
    "issue": "5916",
    "issued": {
      "date-parts": [
        [
          2009,
          2,
          13
        ]
      ]
    },
    "language": "en",
    "page": "892-895",
    "source": "DOI.org (Crossref)",
    "title": "Network Analysis in the Social Sciences",
    "type": "article-journal",
    "URL": "https://www.science.org/doi/10.1126/science.1165821",
    "volume": "323"
  },
  {
    "id": "serrat2017",
    "accessed": {
      "date-parts": [
        [
          2023,
          6,
          22
        ]
      ]
    },
    "author": [
      {
        "family": "Serrat",
        "given": "Olivier"
      }
    ],
    "citation-key": "serrat2017",
    "container-author": [
      {
        "family": "Serrat",
        "given": "Olivier"
      }
    ],
    "container-title": "Knowledge Solutions",
    "DOI": "10.1007/978-981-10-0983-9_9",
    "event-place": "Singapore",
    "ISBN": "978-981-10-0982-2 978-981-10-0983-9",
    "issued": {
      "date-parts": [
        [
          2017
        ]
      ]
    },
    "language": "en",
    "page": "39-43",
    "publisher": "Springer Singapore",
    "publisher-place": "Singapore",
    "source": "DOI.org (Crossref)",
    "title": "Social Network Analysis",
    "type": "chapter",
    "URL": "http://link.springer.com/10.1007/978-981-10-0983-9_9"
  },
  {
    "id": "xu2015",
    "accessed": {
      "date-parts": [
        [
          2023,
          6,
          22
        ]
      ]
    },
    "author": [
      {
        "family": "Xu",
        "given": "Zenglin"
      },
      {
        "family": "Yan",
        "given": "Feng"
      },
      {
        "family": "Qi",
        "given": "Yuan"
      }
    ],
    "citation-key": "xu2015",
    "container-title": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
    "container-title-short": "IEEE Trans. Pattern Anal. Mach. Intell.",
    "DOI": "10.1109/TPAMI.2013.201",
    "ISSN": "0162-8828, 2160-9292",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          2015,
          2
        ]
      ]
    },
    "page": "475-487",
    "source": "DOI.org (Crossref)",
    "title": "Bayesian Nonparametric Models for Multiway Data Analysis",
    "type": "article-journal",
    "URL": "http://ieeexplore.ieee.org/document/6629993/",
    "volume": "37"
  },
  {
    "id": "zotero-7",
    "abstract": "Tensor decomposition is a powerful computational tool for multiway data analysis. Many popular tensor decomposition approaches—such as the Tucker decomposition and CANDECOMP/PARAFAC (CP)—amount to multi-linear factorization. They are insufficient to model (i) complex interactions between data entities, (ii) various data types (e.g., missing data and binary data), and (iii) noisy observations and outliers. To address these issues, we propose tensor-variate latent nonparametric Bayesian models for multiway data analysis. We name these models InfTucker. These new models essentially conduct Tucker decomposition in an infinite feature space. Unlike classical tensor decomposition models, our new approaches handle both continuous and binary data in a probabilistic framework. Unlike previous Bayesian models on matrices and tensors, our models are based on latent Gaussian or \n<inline-formula xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"> <tex-math notation=\"LaTeX\">$t$ </tex-math></inline-formula>\n processes with nonlinear covariance functions. Moreover, on network data, our models reduce to nonparametric stochastic blockmodels and can be used to discover latent groups and predict missing interactions. To learn the models efficiently from data, we develop a variational inference technique and explore properties of the Kronecker product for computational efficiency. Compared with a classical variational implementation, this technique reduces both time and space complexities by several orders of magnitude. On real multiway and network data, our new models achieved significantly higher prediction accuracy than state-of-art tensor decomposition methods and blockmodels.",
    "accessed": {
      "date-parts": [
        [
          2023,
          6,
          22
        ]
      ]
    },
    "citation-key": "zotero-7",
    "language": "en-US",
    "title": "Bayesian Nonparametric Models for Multiway Data Analysis",
    "type": "webpage",
    "URL": "https://ieeexplore.ieee.org/abstract/document/6629993/"
  },
  {
    "id": "malcevaRussianPublicationsWeb2023",
    "type": "article-journal",
    "container-title": "(препринт) COLLNET Journal of Scientometrics and Information Management",
    "title": "Russian Publications in Web of Science: A Bibliometric Study",
    "author": [
      {
        "family": "Мальцева",
        "given": "Д. В."
      },
      {
        "family": "Fiala",
        "given": "D."
      }
    ],
    "issued": {
      "date-parts": [
        [
          "2023"
        ]
      ]
    }
  },
  {
    "id": "barabasi1999",
    "abstract": "Systems as diverse as genetic networks or the World Wide Web are best described as networks with complex topology. A common property of many large networks is that the vertex connectivities follow a scale-free power-law distribution. This feature was found to be a consequence of two generic mechanisms: (i) networks expand continuously by the addition of new vertices, and (ii) new vertices attach preferentially to sites that are already well connected. A model based on these two ingredients reproduces the observed stationary scale-free distributions, which indicates that the development of large networks is governed by robust self-organizing phenomena that go beyond the particulars of the individual systems.",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Barabási",
        "given": "Albert-László"
      },
      {
        "family": "Albert",
        "given": "Réka"
      }
    ],
    "citation-key": "barabasi1999",
    "container-title-short": "Science",
    "DOI": "10.1126/science.286.5439.509",
    "ISSN": "0036-8075, 1095-9203",
    "issue": "5439",
    "issued": {
      "date-parts": [
        [
          1999,
          10,
          15
        ]
      ]
    },
    "language": "en",
    "page": "509-512",
    "source": "DOI.org (Crossref)",
    "title": "Emergence of Scaling in Random Networks",
    "type": "article-journal",
    "URL": "https://www.science.org/doi/10.1126/science.286.5439.509",
    "volume": "286"
  },
  {
    "id": "batagelj",
    "abstract": "Large networks, having thousands of vertices and lines, can be found in many different areas, e. g: genealogies, ﬂow graphs of programs, molecule, computer networks, transportation networks, social networks, intra/inter organisational networks ... Many standard network algorithms are very time and space consuming and therefore unsuitable for analysis of such networks. In the article we present some approaches to analysis and visualisation of large networks implemented in program Pajek. Some typical examples are also given.",
    "author": [
      {
        "family": "Batagelj",
        "given": "Vladimir"
      },
      {
        "family": "Mrvar",
        "given": "Andrej"
      }
    ],
    "citation-key": "batagelj",
    "language": "en",
    "source": "Zotero",
    "title": "Pajek – Program for Large Network Analysis",
    "type": "document"
  },
  {
    "id": "ferligoj2015",
    "abstract": "This paper examines the collaboration structures and dynamics of the co-authorship network of all Slovenian researchers. Its goal is to identify the key factors driving collaboration and the main differences in collaboration behavior across scientific fields and disciplines. Two approaches to modelling network dynamics are combined in this paper: the small-world model and the mechanism of preferential attachment, also known as the process of cumulative advantage. Stochastic-actor-based modelling of co-authorship network dynamics uses data for the complete longitudinal co-authorship networks for the entire Slovenian scientific community from 1996 to 2010. We confirmed the presence of clustering in all fields and disciplines. Preferential attachment is far more complex than a single global mechanism. There were two clear distinctions regarding collaboration within scientific fields and disciplines. One was that some fields had an internal national saturation inhibiting further collaboration. The second concerned the differential impact of collaboration with scientists from abroad on domestic collaboration. In the natural, technical, medical, and biotechnical sciences, this promotes collaboration within the Slovenian scientific community while in the social sciences and humanities this inhibits internal collaboration.",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Ferligoj",
        "given": "Anuška"
      },
      {
        "family": "Kronegger",
        "given": "Luka"
      },
      {
        "family": "Mali",
        "given": "Franc"
      },
      {
        "family": "Snijders",
        "given": "Tom A. B."
      },
      {
        "family": "Doreian",
        "given": "Patrick"
      }
    ],
    "citation-key": "ferligoj2015",
    "container-title": "Scientometrics",
    "container-title-short": "Scientometrics",
    "DOI": "10.1007/s11192-015-1585-7",
    "ISSN": "1588-2861",
    "issue": "3",
    "issued": {
      "date-parts": [
        [
          2015,
          9,
          1
        ]
      ]
    },
    "language": "en",
    "page": "985-1012",
    "source": "Springer Link",
    "title": "Scientific Collaboration Dynamics in a National Scientific System",
    "type": "article-journal",
    "URL": "https://doi.org/10.1007/s11192-015-1585-7",
    "volume": "104"
  },
  {
    "id": "garfield1979",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          9
        ]
      ]
    },
    "author": [
      {
        "family": "Garfield",
        "given": "Eugene"
      }
    ],
    "citation-key": "garfield1979",
    "ISBN": "978-0-471-02559-7",
    "issued": {
      "date-parts": [
        [
          1979
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "306",
    "publisher": "New York : Wiley",
    "source": "Internet Archive",
    "title": "Citation Indexing: Its Theory and Application in Science, Technology, and Humanities",
    "type": "book"
  },
  {
    "id": "glanzel2004",
    "author": [
      {
        "family": "Glänzel",
        "given": "Wolfgang"
      },
      {
        "family": "Schubert",
        "given": "András"
      }
    ],
    "citation-key": "glanzel2004",
    "container-title": "Handbook of Quantitative Science and Technology Research",
    "issued": {
      "date-parts": [
        [
          2004
        ]
      ]
    },
    "language": "en",
    "page": "257–276",
    "publisher": "Springer, Dordrecht",
    "title": "Analysing Scientific Networks Through Co-authorship",
    "type": "chapter",
    "URL": "https://doi.org/10.1007/1-4020-2755-9_12"
  },
  {
    "id": "glanzel2019",
    "abstract": "This handbook presents the state of the art of quantitative methods and models to understand and assess the science and technology system. Focusing on various aspects of the development and application of indicators derived from data on scholarly publications, patents and electronic communications, the individual chapters, written by leading experts, discuss theoretical and methodological issues, illustrate applications, highlight their policy context and relevance, and point to future research directions.A substantial portion of the book is dedicated to detailed descriptions and analyses of data sources, presenting both traditional and advanced approaches. It addresses the main bibliographic metrics and indexes, such as the journal impact factor and the h-index, as well as altmetric and webometric indicators and science mapping techniques on different levels of aggregation and in the context of their value for the assessment of research performance as well as their impact on research policy and society. It also presents and critically discusses various national research evaluation systems.Complementing the sections reflecting on the science system, the technology section includes multiple chapters that explain different aspects of patent statistics, patent classification and database search methods to retrieve patent-related information. In addition, it examines the relevance of trademarks and standards as additional technological indicators.The Springer Handbook of Science and Technology Indicators is an invaluable resource for practitioners, scientists and policy makers wanting a systematic and thorough analysis of the potential and limitations of the various approaches to assess research and research performance.",
    "author": [
      {
        "family": "Glänzel",
        "given": "Wolfgang"
      },
      {
        "family": "Moed",
        "given": "Henk F."
      },
      {
        "family": "Schmoch",
        "given": "Ulrich"
      },
      {
        "family": "Thelwall",
        "given": "Mike"
      }
    ],
    "citation-key": "glanzel2019",
    "ISBN": "978-3-030-02511-3",
    "issued": {
      "date-parts": [
        [
          2019,
          10,
          30
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "1126",
    "publisher": "Springer Nature",
    "source": "Google Books",
    "title": "Springer Handbook of Science and Technology Indicators",
    "type": "book"
  },
  {
    "id": "granovetter1985",
    "author": [
      {
        "family": "Granovetter",
        "given": "Mark"
      }
    ],
    "citation-key": "granovetter1985",
    "container-title": "American Journal of Sociology",
    "container-title-short": "American Journal of Sociology",
    "issue": "3",
    "issued": {
      "date-parts": [
        [
          1985
        ]
      ]
    },
    "language": "en",
    "page": "481-510",
    "source": "Zotero",
    "title": "Economic Action and Social Structure: The Problem of Embeddedness",
    "type": "article-journal",
    "URL": "http://www.jstor.org/stable/2780199",
    "volume": "91"
  },
  {
    "id": "katz1997",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Katz",
        "given": "J. Sylvan"
      },
      {
        "family": "Martin",
        "given": "Ben R."
      }
    ],
    "citation-key": "katz1997",
    "container-title": "Research Policy",
    "container-title-short": "Research Policy",
    "DOI": "10.1016/S0048-7333(96)00917-1",
    "ISSN": "00487333",
    "issue": "1",
    "issued": {
      "date-parts": [
        [
          1997,
          3
        ]
      ]
    },
    "language": "en",
    "page": "1-18",
    "source": "DOI.org (Crossref)",
    "title": "What Is Research Collaboration?",
    "type": "article-journal",
    "URL": "https://linkinghub.elsevier.com/retrieve/pii/S0048733396009171",
    "volume": "26"
  },
  {
    "id": "leydesdorff2016a",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Leydesdorff",
        "given": "Loet"
      },
      {
        "family": "Bornmann",
        "given": "Lutz"
      },
      {
        "family": "Zhou",
        "given": "Ping"
      }
    ],
    "citation-key": "leydesdorff2016a",
    "container-title": "Journal of Informetrics",
    "container-title-short": "Journal of Informetrics",
    "DOI": "10.1016/j.joi.2016.07.008",
    "ISSN": "17511577",
    "issue": "4",
    "issued": {
      "date-parts": [
        [
          2016,
          11
        ]
      ]
    },
    "language": "en",
    "page": "902-918",
    "source": "DOI.org (Crossref)",
    "title": "Construction of a Pragmatic Base Line for Journal Classifications and Maps Based on Aggregated Journal-Journal Citation Relations",
    "type": "article-journal",
    "URL": "https://linkinghub.elsevier.com/retrieve/pii/S175115771630102X",
    "volume": "10"
  },
  {
    "id": "lundberg2006",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Lundberg",
        "given": "Jonas"
      },
      {
        "family": "Tomson",
        "given": "Göran"
      },
      {
        "family": "Lundkvist",
        "given": "Inger"
      },
      {
        "family": "Skar",
        "given": "John"
      },
      {
        "family": "Brommels",
        "given": "Mats"
      }
    ],
    "citation-key": "lundberg2006",
    "container-title": "Scientometrics",
    "container-title-short": "Scientometrics",
    "DOI": "10.1007/s11192-006-0170-5",
    "ISSN": "0138-9130, 1588-2861",
    "issue": "3",
    "issued": {
      "date-parts": [
        [
          2006,
          12
        ]
      ]
    },
    "language": "en",
    "page": "575-589",
    "source": "DOI.org (Crossref)",
    "title": "Collaboration Uncovered: Exploring the Adequacy of Measuring University-Industry Collaboration through Co-authorship and Funding",
    "title-short": "Collaboration uncovered",
    "type": "article-journal",
    "URL": "http://link.springer.com/10.1007/s11192-006-0170-5",
    "volume": "69"
  },
  {
    "id": "mali2010",
    "abstract": "The article deals with some processes generating increases of research collaboration one of the most characteristic tendencies of modern science. The major empirical focus is the increasing tendency of co-authorship in sociology in Slovenia. Bibliometric analyses, based on two joint national research information systems (SICRIS and COBISS), shows the amount of co-authored publications in the field of sociology increased over the last two decades. Blockmodeling of co-authorship networks in sociology has shown that the sociologists who are not systematically tied to strongly connected and well-established research groups produce the most excellent scientific publications in their field.",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Mali",
        "given": "Franc"
      },
      {
        "family": "Kronegger",
        "given": "Luka"
      },
      {
        "family": "Ferligoj",
        "given": "Anuska"
      }
    ],
    "citation-key": "mali2010",
    "container-title": "Corvinus Journal of Sociology and Social Policy",
    "container-title-short": "Corvinus Journal of Sociology and Social Policy",
    "DOI": "10.14267/cjssp.2010.02.02",
    "ISSN": "2062-087X",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          2010,
          12,
          22
        ]
      ]
    },
    "language": "en",
    "license": "Copyright (c)",
    "number": "2",
    "source": "cjssp.uni-corvinus.hu",
    "title": "Co-authorship Trends and Collaboration Patterns in the Slovenian Sociological Community",
    "type": "article-journal",
    "URL": "https://cjssp.uni-corvinus.hu/index.php/cjssp/article/view/24",
    "volume": "1"
  },
  {
    "id": "maltseva2020",
    "abstract": "Abstract This paper presents the results of the analysis of keywords used in Social Network Analysis (SNA) articles included in the WoS database and main SNA journals, from 1970 to 2018. 32,409 keywords were obtained from 70,792 works with complete descriptions. We provide a list of the most used keywords and show subgroups of keywords which are connected to each other. To go deeper, we place the keywords into the contexts of selected groups of authors and journals. We use temporal analysis to get an insight into some keyword usage. The distributions of the number of keyword types and tokens over time show fast growth starting from 2010s, which is the result of the growth in the number of articles on SNA topics and applications of SNA in various scientific fields. Even though the most frequently used keywords are trivial or general, the approaches used for the normalization of network link weights allow us to extract keywords representing substantive topics and methodological issues in SNA.",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Maltseva",
        "given": "Daria"
      },
      {
        "family": "Batagelj",
        "given": "Vladimir"
      }
    ],
    "citation-key": "maltseva2020",
    "container-title": "Scientometrics",
    "container-title-short": "Scientometrics",
    "ISSN": "1588-2861",
    "issue": "1",
    "issued": {
      "date-parts": [
        [
          2020
        ]
      ]
    },
    "page": "357-382",
    "publisher": "Springer",
    "source": "RePEc - Econpapers",
    "title": "Towards a systematic Description of the Field Using Keywords Analysis: Main Topics in Social Networks",
    "title-short": "Towards a systematic description of the field using keywords analysis",
    "type": "article-journal",
    "URL": "https://econpapers.repec.org/article/sprscient/v_3a123_3ay_3a2020_3ai_3a1_3ad_3a10.1007_5fs11192-020-03365-0.htm",
    "volume": "123"
  },
  {
    "id": "merton1968",
    "author": [
      {
        "family": "Merton",
        "given": "Robert K."
      }
    ],
    "citation-key": "merton1968",
    "container-title-short": "Science",
    "issue": "3810",
    "issued": {
      "date-parts": [
        [
          1968
        ]
      ]
    },
    "language": "en",
    "page": "56–63",
    "source": "Zotero",
    "title": "The Matthew Effect on Science",
    "type": "article-journal",
    "volume": "159"
  },
  {
    "id": "moed2018",
    "abstract": "Trends are analysed in the annual number of documents published by Russian institutions and indexed in Scopus and Web of Science, giving special attention to the time period starting in the year 2013 in which the Project 5-100 was launched by the Russian Government. Numbers are broken down by document type, publication language, type of source, research discipline, country and source. It is concluded that Russian publication counts strongly depend upon the database used, and upon changes in database coverage, and that one should be cautious when using indicators derived from WoS, and especially from Scopus, as tools in the measurement of research performance and international orientation of the Russian science system.",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Moed",
        "given": "Henk F."
      },
      {
        "family": "Markusova",
        "given": "Valentina"
      },
      {
        "family": "Akoev",
        "given": "Mark"
      }
    ],
    "citation-key": "moed2018",
    "container-title": "Scientometrics",
    "container-title-short": "Scientometrics",
    "DOI": "10.1007/s11192-018-2769-8",
    "ISSN": "0138-9130, 1588-2861",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          2018,
          8
        ]
      ]
    },
    "language": "en",
    "page": "1153-1180",
    "source": "DOI.org (Crossref)",
    "title": "Trends in Russian research output indexed in Scopus and Web of Science",
    "type": "article-journal",
    "URL": "http://link.springer.com/10.1007/s11192-018-2769-8",
    "volume": "116"
  },
  {
    "id": "moral-munoz2020",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Moral-Muñoz",
        "given": "José A."
      },
      {
        "family": "Enrique Herrera-Viedma",
        "given": "Enrique"
      },
      {
        "family": "Santisteban-Espejo",
        "given": "Antonio"
      },
      {
        "family": "Cobo",
        "given": "Manuel J."
      }
    ],
    "citation-key": "moral-munoz2020",
    "container-title-short": "El Profesional de la Información",
    "DOI": "https://doi.org/10.3145/epi.2020.ene.03",
    "issue": "1",
    "issued": {
      "date-parts": [
        [
          2020
        ]
      ]
    },
    "language": "en",
    "title": "Software Tools for Conducting Bibliometric Analysis in Science: An Up-to-Date Review",
    "type": "article-journal",
    "URL": "https://www.scipedia.com/public/Moral-Munoz_et_al_2020a",
    "volume": "29"
  },
  {
    "id": "pavlova2023",
    "abstract": "Relevance. Bibliometric analysis using network analysis methods is an actively developing scientific research area. Its methods and software tools contribute to progress in understanding how scientific disciplines develop. VOSviewer is an open software product that can be used to build bibliometric maps (networks) of various types (citation, co-authorship, co-occurrence, co-citation, etc.). Bibliometric analysis of the co-presence (cooccurrence) of keywords (simultaneous presence of keywords in different publications) allows building a map of keywords, which can be considered, under certain assumptions, as a model of the knowledge structure in the analyzed area. The objective of this study is to build a keyword map of the research field on the topic «health capital» based on the data of the Web of Science database, as well as to analyze the process of building a bibliometric network of keywords co-occurrence in the VOSviewer program. Methods: bibliometric analysis with methods of network analysis. The materials of the Web of Science database were used as an empirical basis for the study (57853 publications found by the words of health and capital and downloaded in spring 2022 in files of 500 publications each in full record format). To build a keyword map, the VOSviewer program, version 1.6.19, was used. Results. At the first stage, when constructing a keyword map based on the entire array of 57853 publications without preliminary data processing (data cleaning), five clusters were identified and analyzed. At the second stage, a keyword map was built based on 3000 most relevant publications with data processing (data cleaning through the construction of a thesaurus). As a result, keywords that characterize different types of capital (social capital, human capital, cultural capital, psychological capital) are identified and analyzed. Conclusions. Keyword mapping can be done as a preliminary step before conducting a systematic review, since such a preliminary analysis of the field of study through keywords guides and accelerates the process of literature review on the desired scientific topic. Such a map – a network of keywords – helps to enhance the coverage of theories, concepts, approaches by visualizing the keywords of the research field. The example presented in the work on the topic «Health capital» shows that even with «raw» (uncleaned) data, clusters can be built, which, thanks to the visual representation of the research field through keywords, contribute to the building further research steps. The bibliometric analysis of the keywords co-occurrence made it possible to present a structural model of the knowledge in the domain of the research topic of health capital, i. e. (1) to map thematic clusters; (2) build temporal networks to analyze the evolution of knowledge in the chosen scientific field; (3) to identify different types of capitals, within which the health capital is further analyzed and a systematic literature review is elaborated.",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Павлова",
        "given": "Ирина Анатольевна"
      }
    ],
    "citation-key": "pavlova2023",
    "container-title": "Векторы благополучия",
    "DOI": "10.18799/26584956/2023/2/1592",
    "ISSN": "2658-4956",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          2023,
          6,
          30
        ]
      ]
    },
    "language": "ru",
    "license": "Copyright (c) 2023 ТПУ",
    "number": "2",
    "page": "38-54",
    "source": "jwt.su",
    "title": "Построение карты соприсутствия ключевых слов по теме «Капитал здоровья» в программе Vosviewer",
    "type": "article-journal",
    "URL": "https://jwt.su/journal/article/view/1592",
    "volume": "49"
  },
  {
    "id": "perianes-rodriguez2016",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Perianes-Rodriguez",
        "given": "Antonio"
      },
      {
        "family": "Waltman",
        "given": "Ludo"
      },
      {
        "family": "Van Eck",
        "given": "Nees Jan"
      }
    ],
    "citation-key": "perianes-rodriguez2016",
    "container-title": "Journal of Informetrics",
    "container-title-short": "Journal of Informetrics",
    "DOI": "10.1016/j.joi.2016.10.006",
    "ISSN": "17511577",
    "issue": "4",
    "issued": {
      "date-parts": [
        [
          2016,
          11
        ]
      ]
    },
    "language": "en",
    "page": "1178-1195",
    "source": "DOI.org (Crossref)",
    "title": "Constructing Bibliometric Networks: A Comparison Between Full and Fractional Counting",
    "title-short": "Constructing bibliometric networks",
    "type": "article-journal",
    "URL": "https://linkinghub.elsevier.com/retrieve/pii/S1751157716302036",
    "volume": "10"
  },
  {
    "id": "pike2010",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Pike",
        "given": "Thomas W."
      }
    ],
    "citation-key": "pike2010",
    "container-title-short": "Behavioral Ecology",
    "DOI": "10.1093/beheco/arp194",
    "ISSN": "1465-7279, 1045-2249",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          2010
        ]
      ]
    },
    "language": "en",
    "page": "431-435",
    "source": "DOI.org (Crossref)",
    "title": "Collaboration Networks and Scientific Impact among Behavioral Ecologists",
    "type": "article-journal",
    "URL": "https://academic.oup.com/beheco/article-lookup/doi/10.1093/beheco/arp194",
    "volume": "21"
  },
  {
    "id": "pranckute2021",
    "abstract": "Nowadays, the importance of bibliographic databases (DBs) has increased enormously, as they are the main providers of publication metadata and bibliometric indicators universally used both for research assessment practices and for performing daily tasks. Because the reliability of these tasks ﬁrstly depends on the data source, all users of the DBs should be able to choose the most suitable one. Web of Science (WoS) and Scopus are the two main bibliographic DBs. The comprehensive evaluation of the DBs’ coverage is practically impossible without extensive bibliometric analyses or literature reviews, but most DBs users do not have bibliometric competence and/or are not willing to invest additional time for such evaluations. Apart from that, the convenience of the DB’s interface, performance, provided impact indicators and additional tools may also inﬂuence the users’ choice. The main goal of this work is to provide all of the potential users with an all-inclusive description of the two main bibliographic DBs by gathering the ﬁndings that are presented in the most recent literature and information provided by the owners of the DBs at one place. This overview should aid all stakeholders employing publication and citation data in selecting the most suitable DB.",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          9
        ]
      ]
    },
    "author": [
      {
        "family": "Pranckutė",
        "given": "Raminta"
      }
    ],
    "citation-key": "pranckute2021",
    "container-title-short": "Publications",
    "DOI": "10.3390/publications9010012",
    "ISSN": "2304-6775",
    "issued": {
      "date-parts": [
        [
          2021,
          3,
          12
        ]
      ]
    },
    "language": "en",
    "page": "1–59",
    "source": "DOI.org (Crossref)",
    "title": "Web of Science (WoS) and Scopus: The Titans of Bibliographic Information in Today’s Academic World",
    "title-short": "Web of Science (WoS) and Scopus",
    "type": "article-journal",
    "URL": "https://www.mdpi.com/2304-6775/9/1/12"
  },
  {
    "id": "price1965",
    "author": [
      {
        "family": "Price",
        "given": "D. J."
      }
    ],
    "citation-key": "price1965",
    "container-title": "Science (New York, N.Y.)",
    "container-title-short": "Science",
    "DOI": "10.1126/science.149.3683.510",
    "ISSN": "0036-8075",
    "issue": "3683",
    "issued": {
      "date-parts": [
        [
          1965,
          7,
          30
        ]
      ]
    },
    "language": "eng",
    "page": "510-515",
    "PMID": "14325149",
    "source": "PubMed",
    "title": "Netwrks of Scientific Papers",
    "type": "article-journal",
    "volume": "149"
  },
  {
    "id": "price1976",
    "abstract": "Abstract\n            A Cumulative Advantage Distribution is proposed which models statistically the situation in which success breeds success. It differs from the Negative Binomial Distribution in that lack of success, being a non‐event, is not punished by increased chance of failure. It is shown that such a stochastic law is governed by the Beta Function, containing only one free parameter, and this is approximated by a skew or hyperbolic distribution of the type that is widespread in bibliometrics and diverse social science phenomena. In particular, this is shown to be an appropriate underlying probabilistic theory for the Bradford Law, the Lotka Law, the Pareto and Zipf Distributions, and for all the empirical results of citation frequency analysis. As side results one may derive also the obsolescence factor for literature use. The Beta Function is peculiarly elegant for these manifold purposes because it yields both the actual and the cumulative distributions in simple form, and contains a limiting case of an inverse square law to which many empirical distributions conform.",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Price",
        "given": "Derek De Solla"
      }
    ],
    "citation-key": "price1976",
    "container-title-short": "Journal of the American Society for Information Science",
    "DOI": "10.1002/asi.4630270505",
    "ISSN": "0002-8231, 1097-4571",
    "issue": "5",
    "issued": {
      "date-parts": [
        [
          1976,
          9
        ]
      ]
    },
    "language": "en",
    "page": "292-306",
    "source": "DOI.org (Crossref)",
    "title": "A General Theory of Bibliometric and Other Cumulative Advantage Processes",
    "type": "article-journal",
    "URL": "https://asistdl.onlinelibrary.wiley.com/doi/10.1002/asi.4630270505",
    "volume": "27"
  },
  {
    "id": "price1986",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          9
        ]
      ]
    },
    "archive": "Книги (изданные с 1831 г. по настоящее время)",
    "author": [
      {
        "family": "Price",
        "given": "Derek John de Solla"
      }
    ],
    "call-number": "FB 5 88-7/59-3",
    "citation-key": "price1986",
    "event-place": "New York",
    "ISBN": "978-0-231-04957-3",
    "issued": {
      "date-parts": [
        [
          1986
        ]
      ]
    },
    "language": "eng",
    "note": "RSLID: 01000493248\nBBK: Ю25,0\"XX\"; Ч210.52,0",
    "number-of-pages": "301",
    "publisher": "Columbia univ. press",
    "publisher-place": "New York",
    "source": "Российская Государственная Библиотека",
    "title": "Little Science, Big Science…and Beyond",
    "type": "book",
    "URL": "https://search.rsl.ru/ru/record/01000493248"
  },
  {
    "id": "rousseau2018",
    "abstract": "Becoming Metric-Wise: A Bibliometric Guide for Researchers aims to inform researchers about metrics so that they become aware of the evaluative techniques being applied to their scientific output. Understanding these concepts will help them during their funding initiatives, and in hiring and tenure. The book not only describes what indicators do (or are designed to do, which is not always the same thing), but also gives precise mathematical formulae so that indicators can be properly understood and evaluated. Metrics have become a critical issue in science, with widespread international discussion taking place on the subject across scientific journals and organizations.  As researchers should know the publication-citation context, the mathematical formulae of indicators being used by evaluating committees and their consequences, and how such indicators might be misused, this book provides an ideal tome on the topic. Provides researchers with a detailed understanding of bibliometric indicators and their applications Empowers researchers looking to understand the indicators relevant to their work and careers Presents an informed and rounded picture of bibliometrics, including the strengths and shortcomings of particular indicators Supplies the mathematics behind bibliometric indicators so they can be properly understood Written by authors with longstanding expertise who are considered global leaders in the field of bibliometrics",
    "author": [
      {
        "family": "Rousseau",
        "given": "Ronald"
      },
      {
        "family": "Egghe",
        "given": "Leo"
      },
      {
        "family": "Guns",
        "given": "Raf"
      }
    ],
    "citation-key": "rousseau2018",
    "ISBN": "978-0-08-102475-1",
    "issued": {
      "date-parts": [
        [
          2018,
          1,
          2
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "403",
    "publisher": "Chandos Publishing",
    "source": "Google Books",
    "title": "Becoming Metric-Wise: A Bibliometric Guide for Researchers",
    "title-short": "Becoming Metric-Wise",
    "type": "book"
  },
  {
    "id": "shrum1988",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Shrum",
        "given": "W"
      },
      {
        "family": "Mullins",
        "given": "N"
      }
    ],
    "citation-key": "shrum1988",
    "container-title": "Handbook of Quantitative Studies of Science and Technology",
    "ISBN": "0-444-70537-6",
    "issued": {
      "date-parts": [
        [
          1988
        ]
      ]
    },
    "language": "en",
    "publisher": "Elsevier Science Publishers B.V.",
    "title": "Network Analysis in the Study of Science and Technology",
    "type": "chapter",
    "URL": "https://www.researchgate.net/publication/284854948_NETWORK_ANALYSIS_IN_THE_STUDY_OF_SCIENCE_AND_TECHNOLOGY"
  },
  {
    "id": "shrum2007",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Shrum",
        "given": "Wesley"
      },
      {
        "family": "Genuth",
        "given": "Joel"
      },
      {
        "family": "Chompalov",
        "given": "Ivan"
      }
    ],
    "citation-key": "shrum2007",
    "ISBN": "978-0-262-19559-1",
    "issued": {
      "date-parts": [
        [
          2007
        ]
      ]
    },
    "language": "en",
    "number-of-pages": "296",
    "publisher": "The MIT Press",
    "title": "Structures of Scientific Collaboration",
    "type": "book"
  },
  {
    "id": "trofimova2023",
    "abstract": "Аннотация\n\t\t\t\t\tРоссийская наука всегда была частью мировой академической среды, успешно сотрудничала и конкурировала с ведущими в научно-техническом развитии странами. Недавняя ситуация с пандемией коронавируса COVID-19 и текущая геополитическая напряженность негативно сказываются на международных научных связях, в связи с чем возникла острая и срочная необходимость перестройки сложившихся партнерств и выстраивания новых. В статье рассматривается феномен участия российских исследователей в международном научном сотрудничестве в контексте существующей глобальной конкуренции и неравенства в науке. В качестве источника данных использовалась база библиографических записей Web of Science за весь доступный период наблюдения с выделением объединенных окон публикаций и цитирования с 2018 по 2022 год. Для оценки влияния публикаций были взяты показатели цитируемости статей и квартилей журналов. Данные о количестве, цитируемости статей и квартилях журналов, в которых они были напечатаны, были извлечены для России, стран Содружества Независимых Государств, группы стран БРИКС и стран-лидеров с наибольшим количеством публикаций. Анализ показал увеличение количества совместных публикаций и положительный эффект соавторства с коллегами, прежде всего, из стран-лидеров научно-технического развития. В статье делается вывод о  необходимости активизации и расширения международного научного сотрудничества за счет новых стран-партнеров.",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Трофимова",
        "given": "Ирина Николаевна"
      }
    ],
    "citation-key": "trofimova2023",
    "container-title-short": "Мир России",
    "DOI": "10.17323/1811-038X-2023-32-4-178-198",
    "ISSN": "1811-0398",
    "issue": "4",
    "issued": {
      "date-parts": [
        [
          2023,
          8,
          12
        ]
      ]
    },
    "language": "ru",
    "license": "Copyright (c)",
    "number": "4",
    "page": "178-198",
    "source": "mirros.hse.ru",
    "title": "Международное сотрудничество российских исследователей: текущие позиции и тенденции: по данным Web of Science за 2018–2022 гг.",
    "title-short": "Международное сотрудничество российских исследователей",
    "type": "article-journal",
    "URL": "https://mirros.hse.ru/article/view/17753",
    "volume": "32"
  },
  {
    "id": "vaneck2010",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          12
        ]
      ]
    },
    "author": [
      {
        "family": "Eck",
        "given": "Nees Jan",
        "non-dropping-particle": "van"
      },
      {
        "family": "Waltman",
        "given": "Ludo"
      }
    ],
    "citation-key": "vaneck2010",
    "container-title-short": "Scientometrics",
    "DOI": "10.1007/s11192-009-0146-3",
    "issued": {
      "date-parts": [
        [
          2010
        ]
      ]
    },
    "language": "en",
    "page": "523–538",
    "title": "Software survey: VOSviewer, a computer program for bibliometric mapping | Scientometrics",
    "type": "article-journal",
    "URL": "https://link.springer.com/article/10.1007/s11192-009-0146-3",
    "volume": "84"
  },
  {
    "id": "watts1998a",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          11
        ]
      ]
    },
    "author": [
      {
        "family": "Watts",
        "given": "Duncan J."
      },
      {
        "family": "Strogatz",
        "given": "Steven H."
      }
    ],
    "citation-key": "watts1998a",
    "container-title-short": "Nature",
    "DOI": "https://doi.org/10.1038/30918",
    "issue": "Steven H.",
    "issued": {
      "date-parts": [
        [
          1998
        ]
      ]
    },
    "language": "en",
    "page": "440–442",
    "title": "Collective Dynamics of ‘Small-World’ Networks",
    "type": "article-journal",
    "URL": "https://www.nature.com/articles/30918"
  },
  {
    "id": "zhu2020",
    "abstract": "Web of Science and Scopus are two world-leading and competing citation databases. By using the Science Citation Index Expanded and Social Sciences Citation Index, this paper conducts a comparative, dynamic, and empirical study focusing on the use of Web of Science (WoS) and Scopus in academic papers published during 2004 and 2018. This brief communication reveals that although both Web of Science and Scopus are increasingly used in academic papers, Scopus as a new-comer is really challenging the dominating role of WoS. Researchers from more and more countries/regions and knowledge domains are involved in the use of these two databases. Even though the main producers of related papers are developed economies, some developing economies such as China, Brazil and Iran also act important roles but with different patterns in the use of these two databases. Both two databases are widely used in meta-analysis related studies especially for researchers in China. Health/medical science related domains and the traditional Information Science & Library Science field stand out in the use of citation databases.",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          9
        ]
      ]
    },
    "author": [
      {
        "family": "Zhu",
        "given": "Junwen"
      },
      {
        "family": "Liu",
        "given": "Weishu"
      }
    ],
    "citation-key": "zhu2020",
    "container-title": "Scientometrics",
    "container-title-short": "Scientometrics",
    "DOI": "10.1007/s11192-020-03387-8",
    "ISSN": "0138-9130, 1588-2861",
    "issue": "1",
    "issued": {
      "date-parts": [
        [
          2020,
          4
        ]
      ]
    },
    "language": "en",
    "page": "321–335",
    "source": "DOI.org (Crossref)",
    "title": "A Tale of Two Databases: the Use of Web of Science and Scopus in Academic Papers",
    "title-short": "A tale of two databases",
    "type": "article-journal",
    "URL": "http://link.springer.com/10.1007/s11192-020-03387-8",
    "volume": "123"
  },
  {
    "id": "zotero-14",
    "accessed": {
      "date-parts": [
        [
          2023,
          8,
          30
        ]
      ]
    },
    "citation-key": "zotero-14",
    "container-title": "eLibrary.ru",
    "language": "rus",
    "title": "Сравнение уровня публикаций российских ученых в базах данных Web of Science, Scopus и RSCI",
    "type": "webpage",
    "URL": "https://elibrary.ru/wos_scopus_rsci.asp?"
  },
  {
    "id": "fairbrotherDoesInequalityErode2013",
    "author": [
      {
        "family": "Fairbrother",
        "given": "Malcolm"
      },
      {
        "family": "Martin",
        "given": "Isaac W."
      }
    ],
    "citation-key": "fairbrotherDoesInequalityErode2013",
    "container-title": "Social science research",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          2013
        ]
      ]
    },
    "page": "347–360",
    "publisher": "Elsevier",
    "source": "Google Scholar",
    "title": "Does inequality erode social trust? Results from multilevel models of US states and counties",
    "title-short": "Does inequality erode social trust?",
    "type": "article-journal",
    "volume": "42"
  },
  {
    "id": "georgalosTestingEmergenceSpontaneous2020",
    "author": [
      {
        "family": "Georgalos",
        "given": "Konstantinos"
      },
      {
        "family": "Hey",
        "given": "John"
      }
    ],
    "citation-key": "georgalosTestingEmergenceSpontaneous2020",
    "container-title": "Experimental Economics",
    "issue": "3",
    "issued": {
      "date-parts": [
        [
          2020
        ]
      ]
    },
    "page": "912–932",
    "publisher": "Springer",
    "source": "Google Scholar",
    "title": "Testing for the emergence of spontaneous order",
    "type": "article-journal",
    "volume": "23"
  },
  {
    "id": "http://zotero.org/users/local/Q7DWuSGG/items/RXWEMMA3",
    "type": "article-journal",
    "abstract": "Gossip, or sharing information about absent others, has been identified as an effective solution to free rider problems in situations with conflicting interests. Yet, the information transmitted via gossip can be biased, because gossipers may send dishonest information about others for personal gains. Such dishonest gossip makes reputation-based cooperation more difficult to evolve. But when are people likely to share honest or dishonest gossip? We build formal models to provide the theoretical foundation for individuals' gossip strategies, taking into account the gossiper's fitness interdependence with the receiver and the target. Our models across four different games suggest a very simple rule: when there is a perfect match (mismatch) between fitness interdependence and the effect of honest gossip, the gossiper should always be honest (dishonest); however, in the case of a partial match, the gossiper should make a choice based on their fitness interdependence with the receiver and the target and the marginal cost/benefit in terms of pay-off differences caused by possible choices of the receiver and the target in the game. Moreover, gossipers can use this simple rule to make optimal decisions even under noise. We discuss empirical examples that support the predictions of our model and potential extensions.\n\nThis article is part of the theme issue ‘The language of cooperation: reputation and honest signalling’.",
    "container-title": "Philosophical Transactions of the Royal Society B: Biological Sciences",
    "DOI": "10.1098/rstb.2020.0300",
    "issue": "1838",
    "note": "publisher: Royal Society",
    "page": "20200300",
    "source": "royalsocietypublishing.org (Atypon)",
    "title": "Honesty and dishonesty in gossip strategies: a fitness interdependence analysis",
    "title-short": "Honesty and dishonesty in gossip strategies",
    "URL": "https://royalsocietypublishing.org/doi/10.1098/rstb.2020.0300",
    "volume": "376",
    "author": [
      {
        "family": "Wu",
        "given": "Junhui"
      },
      {
        "family": "Számadó",
        "given": "Szabolcs"
      },
      {
        "family": "Barclay",
        "given": "Pat"
      },
      {
        "family": "Beersma",
        "given": "Bianca"
      },
      {
        "family": "Dores Cruz",
        "given": "Terence D."
      },
      {
        "family": "Iacono",
        "given": "Sergio Lo"
      },
      {
        "family": "Nieper",
        "given": "Annika S."
      },
      {
        "family": "Peters",
        "given": "Kim"
      },
      {
        "family": "Przepiorka",
        "given": "Wojtek"
      },
      {
        "family": "Tiokhin",
        "given": "Leo"
      },
      {
        "family": "Van Lange",
        "given": "Paul A. M."
      }
    ],
    "accessed": {
      "date-parts": [
        [
          "2023",
          7,
          3
        ]
      ]
    },
    "issued": {
      "date-parts": [
        [
          "2021",
          10,
          4
        ]
      ]
    }
  },
  {
    "id": "zhou2021",
    "abstract": "Learning with noisy labels is an important and challenging task for training accurate deep neural networks. Some commonly-used loss functions, such as Cross Entropy (CE), suffer from severe overfitting to noisy labels. Robust loss functions that satisfy the symmetric condition were tailored to remedy this problem, which however encounter the underfitting effect. In this paper, we theoretically prove that \\textbf{any loss can be made robust to noisy labels} by restricting the network output to the set of permutations over a fixed vector. When the fixed vector is one-hot, we only need to constrain the output to be one-hot, which however produces zero gradients almost everywhere and thus makes gradient-based optimization difficult. In this work, we introduce the sparse regularization strategy to approximate the one-hot constraint, which is composed of network output sharpening operation that enforces the output distribution of a network to be sharp and the $\\ell_p$-norm ($p\\le 1$) regularization that promotes the network output to be sparse. This simple approach guarantees the robustness of arbitrary loss functions while not hindering the fitting ability. Experimental results demonstrate that our method can significantly improve the performance of commonly-used loss functions in the presence of noisy labels and class imbalance, and outperform the state-of-the-art methods. The code is available at https://github.com/hitcszx/lnl_sr.",
    "accessed": {
      "date-parts": [
        [
          2023,
          6,
          22
        ]
      ]
    },
    "author": [
      {
        "family": "Zhou",
        "given": "Xiong"
      },
      {
        "family": "Liu",
        "given": "Xianming"
      },
      {
        "family": "Wang",
        "given": "Chenyang"
      },
      {
        "family": "Zhai",
        "given": "Deming"
      },
      {
        "family": "Jiang",
        "given": "Junjun"
      },
      {
        "family": "Ji",
        "given": "Xiangyang"
      }
    ],
    "citation-key": "zhou2021",
    "issued": {
      "date-parts": [
        [
          2021,
          7,
          31
        ]
      ]
    },
    "number": "arXiv:2108.00192",
    "publisher": "arXiv",
    "source": "arXiv.org",
    "title": "Learning with Noisy Labels via Sparse Regularization",
    "type": "article",
    "URL": "http://arxiv.org/abs/2108.00192"
  },
  {
    "id": "batagelj1999",
    "abstract": "The goal of blockmodeling is to reduce a large, potentially incoherent network to a smaller comprehensible structure that can be interpreted more readily. In the paper we present some basic ideas and developments in this area. 1 Basic Notions 1.1 Network Let E = {X 1 , X 2 , . . . , X n } be a finite set of units or units. The units are related by binary relations R t # E E, t = 1, . . . , r, r # 1 which determine a network N = (E, R 1 , R 2 , . . . , R r ) In the following we restrict our discussion to a single relation R described by a corresponding binary matrix R = [r ij ] nn where r ij = # 1 X i RX j 0 otherwise In some applications r ij can be a nonnegative real number expressing the strength of the relation R between units X i and X j . 1.1.1 Example: Student Government In Table 1 and Figure 1 the Student Government network is presented. It consists of communication interactions among twelve members and advisors of the Student Government at the Universit...",
    "author": [
      {
        "family": "Batagelj",
        "given": "Vladimir"
      },
      {
        "family": "Ferligoj",
        "given": "Anuska"
      },
      {
        "family": "Doreian",
        "given": "Patrick"
      }
    ],
    "citation-key": "batagelj1999",
    "issued": {
      "date-parts": [
        [
          1999,
          10,
          27
        ]
      ]
    },
    "source": "ResearchGate",
    "title": "Generalized Blockmodeling",
    "type": "article-journal"
  },
  {
    "id": "marcot2019",
    "abstract": "Bayesian network (BN) modeling is a rapidly advancing field. Here we explore new methods by which BN model development and application are being joined with other tools and model frameworks. Advances include improving areas of Bayesian classifiers and machine-learning algorithms for model structuring and parameterization, and development of time-dynamic models. Increasingly, BN models are being integrated with: management decision networks; structural equation modeling of causal networks; Bayesian neural networks; combined discrete and continuous variables; object-oriented and agent-based models; state-and-transition models; geographic information systems; quantum probability; and other fields. Integrated BNs (IBNs) are becoming useful tools in risk analysis, risk management, and decision science for resource planning and environmental management. In the near future, IBNs may become self-structuring, self-learning systems fed by real-time monitoring data. Such advances may make model validation difficult, and may question model credibility, particularly if based on uncertain sources of knowledge systems and big data.",
    "accessed": {
      "date-parts": [
        [
          2023,
          6,
          22
        ]
      ]
    },
    "author": [
      {
        "family": "Marcot",
        "given": "Bruce G."
      },
      {
        "family": "Penman",
        "given": "Trent D."
      }
    ],
    "citation-key": "marcot2019",
    "container-title": "Environmental Modelling & Software",
    "container-title-short": "Environmental Modelling & Software",
    "DOI": "10.1016/j.envsoft.2018.09.016",
    "ISSN": "13648152",
    "issued": {
      "date-parts": [
        [
          2019,
          1
        ]
      ]
    },
    "language": "en",
    "page": "386-393",
    "source": "DOI.org (Crossref)",
    "title": "Advances in Bayesian network modelling: Integration of modelling technologies",
    "title-short": "Advances in Bayesian network modelling",
    "type": "article-journal",
    "URL": "https://linkinghub.elsevier.com/retrieve/pii/S1364815218302937",
    "volume": "111"
  },
  {
    "key": "GXFU9JJE",
    "version": 2,
    "library": {
      "type": "group",
      "id": 5103907,
      "name": "ANR Lab Report 2023",
      "links": {
        "alternate": {
          "href": "https://www.zotero.org/groups/anr_lab_report_2023",
          "type": "text/html"
        }
      }
    },
    "links": {
      "self": {
        "href": "https://api.zotero.org/groups/5103907/items/GXFU9JJE",
        "type": "application/json"
      },
      "alternate": {
        "href": "https://www.zotero.org/groups/anr_lab_report_2023/items/GXFU9JJE",
        "type": "text/html"
      }
    },
    "meta": {
      "createdByUser": {
        "id": 6110230,
        "username": "emsiadad",
        "name": "",
        "links": {
          "alternate": {
            "href": "https://www.zotero.org/emsiadad",
            "type": "text/html"
          }
        }
      },
      "creatorSummary": "Larrañaga et al.",
      "parsedDate": "2013",
      "numChildren": 0
    },
    "data": {
      "key": "GXFU9JJE",
      "version": 2,
      "itemType": "journalArticle",
      "title": "A review on evolutionary algorithms in Bayesian network learning and inference tasks",
      "creators": [
        {
          "creatorType": "author",
          "firstName": "Pedro",
          "lastName": "Larrañaga"
        },
        {
          "creatorType": "author",
          "firstName": "Hossein",
          "lastName": "Karshenas"
        },
        {
          "creatorType": "author",
          "firstName": "Concha",
          "lastName": "Bielza"
        },
        {
          "creatorType": "author",
          "firstName": "Roberto",
          "lastName": "Santana"
        }
      ],
      "abstractNote": "",
      "publicationTitle": "Information Sciences",
      "volume": "233",
      "issue": "",
      "pages": "109-125",
      "date": "6/2013",
      "series": "",
      "seriesTitle": "",
      "seriesText": "",
      "journalAbbreviation": "Information Sciences",
      "language": "en",
      "DOI": "10.1016/j.ins.2012.12.051",
      "ISSN": "00200255",
      "shortTitle": "",
      "url": "https://linkinghub.elsevier.com/retrieve/pii/S0020025513000443",
      "accessDate": "2023-06-22T08:21:50Z",
      "archive": "",
      "archiveLocation": "",
      "libraryCatalog": "DOI.org (Crossref)",
      "callNumber": "",
      "rights": "",
      "extra": "",
      "tags": [],
      "collections": [],
      "relations": {},
      "dateAdded": "2023-06-23T16:38:52Z",
      "dateModified": "2023-06-23T16:38:52Z"
    }
  },
  {
    "id": "aria2017",
    "author": [
      {
        "family": "Aria",
        "given": "Massimo"
      },
      {
        "family": "Cuccurullo",
        "given": "Corrado"
      }
    ],
    "citation-key": "aria2017",
    "container-title": "Journal of informetrics",
    "container-title-short": "Journal of informetrics",
    "ISSN": "1751-1577",
    "issue": "4",
    "issued": {
      "date-parts": [
        [
          2017
        ]
      ]
    },
    "page": "959-975",
    "publisher": "Elsevier",
    "title": "bibliometrix: An R-tool for comprehensive science mapping analysis",
    "type": "article-journal",
    "volume": "11"
  },
  {
    "id": "cobo2011",
    "abstract": "This paper presents an approach to analyze the thematic evolution of a given research field. This approach combines performance analysis and science mapping for detecting and visualizing conceptual subdomains (particular themes or general thematic areas). It allows us to quantify and visualize the thematic evolution of a given research field. To do this, co-word analysis is used in a longitudinal framework in order to detect the different themes treated by the research field across the given time period. The performance analysis uses different bibliometric measures, including the h-index, with the purpose of measuring the impact of both the detected themes and thematic areas. The presented approach includes a visualization method for showing the thematic evolution of the studied field. Then, as an example, the thematic evolution of the Fuzzy Sets Theory field is analyzed using the two most important journals in the topic: Fuzzy Sets and Systems and IEEE Transactions on Fuzzy Systems.",
    "accessed": {
      "date-parts": [
        [
          2023,
          11,
          15
        ]
      ]
    },
    "author": [
      {
        "family": "Cobo",
        "given": "M. J."
      },
      {
        "family": "López-Herrera",
        "given": "A. G."
      },
      {
        "family": "Herrera-Viedma",
        "given": "E."
      },
      {
        "family": "Herrera",
        "given": "F."
      }
    ],
    "citation-key": "cobo2011",
    "container-title": "Journal of Informetrics",
    "container-title-short": "Journal of Informetrics",
    "DOI": "10.1016/j.joi.2010.10.002",
    "ISSN": "1751-1577",
    "issue": "1",
    "issued": {
      "date-parts": [
        [
          2011,
          1,
          1
        ]
      ]
    },
    "page": "146-166",
    "source": "ScienceDirect",
    "title": "An approach for detecting, quantifying, and visualizing the evolution of a research field: A practical application to the Fuzzy Sets Theory field",
    "title-short": "An approach for detecting, quantifying, and visualizing the evolution of a research field",
    "type": "article-journal",
    "URL": "https://www.sciencedirect.com/science/article/pii/S1751157710000891",
    "volume": "5"
  },
  {
    "id": "maltseva2020a",
    "accessed": {
      "date-parts": [
        [
          2023,
          9,
          21
        ]
      ]
    },
    "author": [
      {
        "family": "Maltseva",
        "given": "Daria"
      },
      {
        "family": "Batagelj",
        "given": "Vladimir"
      }
    ],
    "citation-key": "maltseva2020a",
    "container-title": "Scientometrics",
    "container-title-short": "Scientometrics",
    "DOI": "10.1007/s11192-020-03365-0",
    "ISSN": "0138-9130, 1588-2861",
    "issue": "1",
    "issued": {
      "date-parts": [
        [
          2020,
          4
        ]
      ]
    },
    "language": "en",
    "page": "357-382",
    "source": "DOI.org (Crossref)",
    "title": "Towards a systematic description of the field using keywords analysis: main topics in social networks",
    "title-short": "Towards a systematic description of the field using keywords analysis",
    "type": "article-journal",
    "URL": "http://link.springer.com/10.1007/s11192-020-03365-0",
    "volume": "123"
  },
  {
    "id": "pavlova2023",
    "author": [
      {
        "family": "Павлова",
        "given": "Ирина Анатольевна"
      }
    ],
    "citation-key": "pavlova2023",
    "container-title": "Векторы благополучия",
    "container-title-short": "Векторы благополучия",
    "ISSN": "2658-4956",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          2023
        ]
      ]
    },
    "page": "38-54",
    "title": "ПОСТРОЕНИЕ КАРТЫ СОПРИСУТСТВИЯ КЛЮЧЕВЫХ СЛОВ ПО ТЕМЕ «КАПИТАЛ ЗДОРОВЬЯ» В ПРОГРАММЕ VOSVIEWER",
    "type": "article-journal",
    "volume": "49"
  },
  {
    "id": "vaneck2010",
    "author": [
      {
        "family": "Van Eck",
        "given": "Nees"
      },
      {
        "family": "Waltman",
        "given": "Ludo"
      }
    ],
    "citation-key": "vaneck2010",
    "container-title": "scientometrics",
    "container-title-short": "scientometrics",
    "ISSN": "0138-9130",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          2010
        ]
      ]
    },
    "page": "523-538",
    "publisher": "Akadémiai Kiadó, co-published with Springer Science+ Business Media BV …",
    "title": "Software survey: VOSviewer, a computer program for bibliometric mapping",
    "type": "article-journal",
    "volume": "84"
  }
]
