[
  {"id":"batagelj2007","author":[{"family":"Batagelj","given":"Vladimir"},{"family":"Ferligoj","given":"Anuška"},{"family":"Doreian","given":"Patrick"}],"citation-key":"batagelj2007","container-title":"Selected Contributions in Data Analysis and Classification","event-place":"Berlin","ISBN":"3-540-73558-5","issued":{"date-parts":[[2007]]},"page":"151-159","publisher":"Springer","publisher-place":"Berlin","title":"Indirect Blockmodeling of 3-Way Networks","type":"chapter"},
  {"id":"batagelj2018","abstract":"ibm3m - indirect block modeling of 3-mode data","accessed":{"date-parts":[[2023,11,28]]},"author":[{"family":"Batagelj","given":"V."}],"citation-key":"batagelj2018","genre":"R","issued":{"date-parts":[[2018]]},"license":"GPL-3.0","original-date":{"date-parts":[[2018,2,23]]},"source":"GitHub","title":"Indirect block modeling of 3-mode data and analysis of multiway networks","type":"software","URL":"https://github.com/bavla/ibm3m"},
  {"id":"kroonenberg2008","abstract":"From a preeminent authority—a modern and applied treatment of multiway data analysis This groundbreaking book is the first of its kind to present methods for analyzing multiway data by applying multiway component techniques. Multiway analysis is a specialized branch of the larger field of multivariate statistics that extends the standard methods for two-way data, such as component analysis, factor analysis, cluster analysis, correspondence analysis, and multidimensional scaling to multiway data. Applied Multiway Data Analysis presents a unique, thorough, and authoritative treatment of this relatively new and emerging approach to data analysis that is applicable across a range of fields, from the social and behavioral sciences to agriculture, environmental sciences, and chemistry. General introductions to multiway data types, methods, and estimation procedures are provided in addition to detailed explanations and advice for readers who would like to learn more about applying multiway methods. Using carefully laid out examples and engaging applications, the book begins with an introductory chapter that serves as a general overview of multiway analysis, including the types of problems it can address. Next, the process of setting up, carrying out, and evaluating multiway analyses is discussed along with commonly encountered issues, such as preprocessing, missing data, model and dimensionality selection, postprocessing, and transformation, as well as robustness and stability issues. Extensive examples are presented within a unified framework consisting of a five-step structure: objectives; data description and design; model and dimensionality selection; results and their interpretation; and validation. Procedures featured in the book are conducted using 3WayPack, which is software developed by the author, and analyses can also be carried out within the R and MATLAB systems. Several data sets and 3WayPack can be downloaded via the book's related Web site. The author presents the material in a clear, accessible style without unnecessary or complex formalism, assuring a smooth transition from well-known standard two-analysis to multiway analysis for readers from a wide range of backgrounds. An understanding of linear algebra, statistics, and principal component analyses and related techniques is assumed, though the author makes an effort to keep the presentation at a conceptual, rather than mathematical, level wherever possible. Applied Multiway Data Analysis is an excellent supplement for component analysis and statistical multivariate analysis courses at the upper-undergraduate and beginning graduate levels. The book can also serve as a primary reference for statisticians, data analysts, methodologists, applied mathematicians, and social science researchers working in academia or industry. Visit the Related Website: http://three-mode.leidenuniv.nl/, to view data from the book.","author":[{"family":"Kroonenberg","given":"Pieter M."}],"citation-key":"kroonenberg2008","ISBN":"978-0-470-23799-1","issued":{"date-parts":[[2008]]},"language":"en","number-of-pages":"615","publisher":"John Wiley & Sons","source":"Google Books","title":"Applied Multiway Data Analysis","type":"book"},
  {"id":"morup2011","author":[{"family":"Mørup","given":"Morten"}],"citation-key":"morup2011","container-title":"Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery","container-title-short":"Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery","ISSN":"1942-4787","issue":"1","issued":{"date-parts":[[2011]]},"page":"24-40","publisher":"Wiley Online Library","title":"Applications of tensor (multiway array) factorizations and decompositions in data mining","type":"article-journal","volume":"1"}
]
